{
  "author": {
    "authorId": "40107319",
    "url": "https://www.semanticscholar.org/author/40107319",
    "name": "Nataliya Kushnir",
    "aliases": [
      "N. Kushnir",
      "N. О. Kushnir"
    ],
    "affiliations": [],
    "homepage": null,
    "paperCount": 28,
    "citationCount": 113,
    "hIndex": 7,
    "publications": null
  },
  "publications": {
    "offset": 0,
    "data": [
      {
        "paperId": "3f707ce86124859badbd7319ec7aa11b4cfead63",
        "corpusId": 248162756,
        "publicationVenue": {
          "id": "eadfe8f0-005d-4373-a4c9-0fe511c86a05",
          "name": "Economic scope",
          "alternate_names": [
            "Econ scope"
          ],
          "issn": "2224-6282",
          "url": "http://www.nbuv.gov.ua/portal/Soc_Gum/Ekpr/"
        },
        "url": "https://www.semanticscholar.org/paper/3f707ce86124859badbd7319ec7aa11b4cfead63",
        "title": "ASSESSMENT OF THE IMF'S ACTIVITIES IN THE SYSTEM OF INTERNATIONAL ECONOMIC RELATIONS",
        "abstract": "Globalization processes in the economy require proper management of financial resources of countries, because the regulation of the international financial market is one of the most important tasks for the successful development of the world economy and individual national economies. Since its inception, the International Monetary Fund has been designed to regulate the financial situation in the postwar period in the world. In modern conditions of information development of world economic systems, the role and importance of international financial organizations is changing. Therefore, the policy and activities of the IMF are increasingly criticized, which is justified and requires restructuring and reform of certain areas of the fund. The main task of the International Monetary Fund is to provide loans to countries that do not have sufficient foreign exchange reserves and are in a balance of payments deficit. The International Monetary Fund currently has 190 member countries. Each member country is obliged to pay contributions to the IMF, the amount of which is calculated taking into account the national economic potential. This entitles these countries to borrow money when needed. The IMF is the central institution of the international monetary and financial system. It is designed to avoid crises in this system by encouraging states to adopt sound economic policies; at the same time, it is also a fund that can be used by Member States in need of temporary funding to address balance of payments problems. The newly created IMF is designed to regulate monetary relations between countries and the implementation of financial assistance to member countries by providing them with short-term foreign currency loans due to currency difficulties due to imbalances in balance of payments.",
        "venue": "Economic scope",
        "year": 2021,
        "referenceCount": 0,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": null,
        "s2FieldsOfStudy": [
          {
            "category": "Economics",
            "source": "s2-fos-model"
          },
          {
            "category": "Political Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "name": "Economic scope"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2162432642",
            "name": "Ivan Stoyka"
          }
        ],
        "citations": [],
        "references": []
      },
      {
        "paperId": "47988765fc885369b041c1e4ae033edd40bf450b",
        "corpusId": 248167772,
        "publicationVenue": {
          "id": "eadfe8f0-005d-4373-a4c9-0fe511c86a05",
          "name": "Economic scope",
          "alternate_names": [
            "Econ scope"
          ],
          "issn": "2224-6282",
          "url": "http://www.nbuv.gov.ua/portal/Soc_Gum/Ekpr/"
        },
        "url": "https://www.semanticscholar.org/paper/47988765fc885369b041c1e4ae033edd40bf450b",
        "title": "ANALYSIS OF THE IMPACT OF THE ASSOCIATION AGREEMENT ON A CERTAIN BRANCH OF THE ECONOMY AND COMMODITY MARKETS OF UKRAINE",
        "abstract": "The Association Agreement with the EU is an important step for any country seeking to integrate into the European community. After all, the European Union has a huge influence on the world stage when it expresses a common position. The economic part of the Agreement with the EU to some extent covers the main areas and sectors of the economy and significantly brings the country's economic system closer to the EU economic system through mutual liberalization of goods, capital and services, and harmonization of much legislation with EU norms and practices. The agreement is a new format of relations aimed at creating a deep and comprehensive free trade area and the gradual integration of the country into the internal market of the European Union. The Deep and Comprehensive Free Trade Area is part of the Association Agreement between Ukraine and the European Union and one of the most ambitious bilateral agreements ever concluded by the European Union. It is a large-scale trade agreement aimed at reducing and abolishing tariffs applied by the parties to goods, liberalizing access to the services market, and bringing Ukrainian business rules and regulations into line with EU rules and regulations in order to ensure free movement of goods and services between the two parties and mutual non-discriminatory treatment of companies, goods and services in Ukraine and the EU. A deep and comprehensive free trade area will provide Ukraine with opportunities to modernize its trade relations and economic development. The tools for this are to open their markets by phasing out customs tariffs, providing dutyfree access under quotas, and large-scale harmonization of Ukrainian laws, norms and standards with those in force in the EU in various sectors directly or indirectly related to trade. This creates conditions for harmonization of Ukraine and EU standards in key areas.",
        "venue": "Economic scope",
        "year": 2021,
        "referenceCount": 0,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": null,
        "s2FieldsOfStudy": [
          {
            "category": "Economics",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "name": "Economic scope"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2162459952",
            "name": "Oleg Andriyiv"
          }
        ],
        "citations": [],
        "references": []
      },
      {
        "paperId": "72bbd84bbd0adde61f017e4699996f14e6b8b739",
        "corpusId": 239006658,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/72bbd84bbd0adde61f017e4699996f14e6b8b739",
        "title": "Using Chatbots to Approach Individual Learning Trajectories in Physics for Foreign Students",
        "abstract": "This paper presents the chatbot as the way of learning individualization and individual work organization for high education applicants. Authors consider the methodology of teaching physics to foreign students in High Maritime Institution with national, psychological, linguistic and cognitive aspects examined. For the analysis to be done data from Kherson State Maritime Academy was used. Furthermore, functions and areas of usage in everyday life, professional and educational environments are defined in this paper. Likewise, a comparative analysis of platforms and their potential for the implementation of chatbots was held. Based on the Telegram platform, ‘Your Physics Trainer’ bot was created for implementation into the educational process of future sailors of Kherson State Maritime Academy. An experimental research was conducted to test the effectiveness of the chatbot application in the learning process delivering evidence of the expediency of its use.",
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2021,
        "referenceCount": 14,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Physics",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "253-263"
        },
        "authors": [
          {
            "authorId": "2133114140",
            "name": "Iryna Bohomolova"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2133048636",
            "name": "S. Moshkovska"
          }
        ],
        "citations": [
          {
            "paperId": "b3c1de56ba31946107e2a4f173f76409a326b2c2",
            "title": "An Evolutive Knowledge Base for “AskBot” Toward Inclusive and Smart Learning-based NLP Techniques"
          }
        ],
        "references": [
          {
            "paperId": "b305672bc79f2d6059dc4ad8ac6f5624eb851f71",
            "title": "Chatbots for learning: A review of educational chatbots for the Facebook Messenger"
          },
          {
            "paperId": "a4548334017c1783c8c10b736e0642ab861f92ad",
            "title": "Bots for Language Learning Now: Current and Future Directions."
          },
          {
            "paperId": "6040f83fa8d0cf1e9e3f39db6606769001eaabfe",
            "title": "Design of a chatbot as a distance learning assistant"
          },
          {
            "paperId": "f6c174a91efd5012c541030643a5c9a6a8ee5e7e",
            "title": "Current and future directions"
          },
          {
            "paperId": "fc61e0b425f3930834b6d3e4e1a8f04dfb37891d",
            "title": "Bringing chatbots into education: Towards natural language negotiation of open learner models"
          },
          {
            "paperId": "96d4addaae06b89a611f20eaa75e25daee0523e4",
            "title": "Designing a Chat Bot for Learning a Subject in a Telegram Messenger"
          },
          {
            "paperId": "b7ee46fab98b20183a34116a0cd9f19103ed86b7",
            "title": "A system for educational and vocational guidance in Morocco: Chatbot E-Orientation"
          },
          {
            "paperId": "81f8c8ab6c3b383ddbd59388875b79a6209c644a",
            "title": "MathBot: Transforming Online Resources for Learning Math into Conversational Interactions"
          },
          {
            "paperId": "bf980c1d0582f3f452cd2041c84e2bdd25d1fc16",
            "title": "Chatbot for e-learning: A case of study"
          },
          {
            "paperId": null,
            "title": "7 solid reasons to suppose that chatbot interfaces will work in learning, 2017"
          },
          {
            "paperId": null,
            "title": "London: International Mari-time Organization"
          },
          {
            "paperId": null,
            "title": "A Case of Study, Int"
          },
          {
            "paperId": null,
            "title": "Certification and Watchkeeping for Sea-farers (STCW) and STCW Code (including 2010 Manila amendments"
          },
          {
            "paperId": null,
            "title": "10 uses for Chatbots in Learning"
          }
        ]
      },
      {
        "paperId": "c1d584bf3a35936f89c7ac183508ccde7656b67b",
        "corpusId": 247966175,
        "publicationVenue": {
          "id": "0ce4fe1e-6156-4235-b30f-c601de7dba16",
          "name": "Herald UNU. International Economic Relations And World Economy",
          "type": "journal",
          "alternate_names": [
            "Her UNU Int Econ Relat World Econ"
          ],
          "issn": "2413-9971"
        },
        "url": "https://www.semanticscholar.org/paper/c1d584bf3a35936f89c7ac183508ccde7656b67b",
        "title": "WORLD TOURISM INDUSTRY IN THE CONDITIONS OF INTERNATIONAL COMPETITION AND THE COVID-19 PANDEMIC",
        "abstract": "As a result of our research, we found that the COVID-19 pandemic has caused radical changes in the global tourism market, the consequences of which on its further development are currently impossible to predict. The pandemic has caused an unprecedented decline in the tourism market in most countries. In response to these challenges, travel companies have been forced to substantially revise their marketing plans and programs. The changes to a greater or lesser extent affected all areas of tourism business, including the marketing of tourist destinations. The COVID-19 pandemic has significantly reduced the number of international tourist arrivals in all countries. The complexity of the situation in which the tourism industry finds itself requires an adaptation period for tourists and for tourism industry in general. Despite the global scale, tourism has remained regional and national in content. This industry supports national traditions, stimulates the development of folk crafts, revival of recipes for interesting and tasty dishes, requires nature conservation and creating favorable social conditions for its operation, so in many countries international tourism is developing as a system that provides all necessary opportunities to get acquainted with culture, customs, history, religious and spiritual values of the state and its people. The coronavirus pandemic has affected all countries and the capital without exception. One of the sectors most affected is the tourism sector. the situation with the epidemic is developing so unpredictably that tourist facilities do not have time to reformat the work to sanitary requirements, which often change. In addition, not everyone is ready to respond to changes in quarantine zones, and for businesses this creates additional difficulties in organizing work. The World Travel and Tourism Council (WTTC) forecasts that up to 75 million jobs are at risk in the sector. This estimation is even more worrying when we reflect on the fact that tourism is a leading job creator for those vulnerable segments of population: in fact, a far higher share of low-skilled immigrants, women and students are employed in tourism compared to the total non-financial business economy. The contribution of tourism to world GDP by countries that are most popular among tourists is analyzed. The percentage change in international tourist arrivals by region in 2020 and the dynamics of destinations that were most popular among tourists around the world in 2018-2020 are considered. It was found that due to the pandemic tourist flows. The COVID-19 pandemic has significantly reduced the number of international tourist arrivals in all countries. At the same time, this pandemic opens up to the industry a rare opportunity for analysis and reorganization what could be done and what could be changed. Governments have the opportunity to recognize the unique ability of tourism not only to provide jobs but also to promote equality and social integration. Because tourism is one of the fastest growing industries in the world, it is expected to play a significant role in restoring socio-economic stability after the COVID-19 pandemic. The changes caused by the pandemic situation are forcing the governments of almost all countries without exception especially those in which tourism is leading or sufficient significant direction of national development, in a new way approach to the formation of development strategies and programs tourism industry.",
        "venue": "Herald UNU. International Economic Relations And World Economy",
        "year": 2021,
        "referenceCount": 0,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": null,
        "s2FieldsOfStudy": [
          {
            "category": "Business",
            "source": "s2-fos-model"
          },
          {
            "category": "Economics",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "name": "Herald UNU. International Economic Relations And World Economy"
        },
        "authors": [
          {
            "authorId": "2161466975",
            "name": "Oleksandr Kish"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          }
        ],
        "citations": [],
        "references": []
      },
      {
        "paperId": "189af22499546a6ad6d89784f6fd02c1764106c8",
        "corpusId": 213331941,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/189af22499546a6ad6d89784f6fd02c1764106c8",
        "title": "DESIGN OF THE EDUCATIONAL ENVIRONMENT FOR STEM-ORIENTED LEARNING",
        "abstract": "The article examines the impact of market requirements on the educational system, technological development of society and changes in the economic development of the country. The main directions of changes in European educational policy and their formalization in the framework of competences have been reviewed. The considered practices of organizing educational space in Ukraine and other countries allowed determining the structure of the interaction of participants in the educational environment of STEM-oriented training: administrative and managerial component, cooperation between education and business structures, scientific and methodological support, technological factor, popularization and human factor. The article gives a definition of the educational environment of STEM-oriented learning. According to each of the points of this structure, the peculiarities of their implementation in Ukraine have been presented: steps to implementation at legislative level have been taken, a list of measures aimed at popularizing and supporting STEM-education has been developed, a way of the dissemination of these ideas has been outlined and the list of already existing developments and implementation practices has been made. The conditions required for the development of educational STEM-environment have been defined. The article presents the model of the educational environment of STEM-oriented learning developed at the STEM-school of Kherson State University. The description of the project activity of the teacher and students in the context of the creation of educational environment of STEM-oriented learning is given. Also, the article offers examples of interdisciplinary projects. Their implementation requires that the teacher have a good theoretical foundation in mathematics, physics, technology and programming.",
        "venue": "",
        "year": 2020,
        "referenceCount": 0,
        "citationCount": 8,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "https://journal.iitta.gov.ua/index.php/itlt/article/download/3213/1614",
          "status": null
        },
        "fieldsOfStudy": null,
        "s2FieldsOfStudy": [
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "Review"
        ],
        "publicationDate": "2020-02-24",
        "journal": {
          "volume": "75",
          "pages": "316-330",
          "name": "Information Technologies and Learning Tools"
        },
        "authors": [
          {
            "authorId": "72307091",
            "name": "V. Osadchyi"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          }
        ],
        "citations": [
          {
            "paperId": "75ea0fac9f9fa27c30d5fe69d21f269687fa3cb3",
            "title": "STEM education in the context of improving the science and mathematics literacy of pupils"
          },
          {
            "paperId": "d788a34dd404fdc180087c4c4f13f3aa1f26dacc",
            "title": "Psychological and pedagogical features: the use of digital technology in a blended learning environment"
          },
          {
            "paperId": "25b9eab633fe56572882743300ae796355b02965",
            "title": "Becoming a STEM-Focused School District: Administrators’ Roles and Experiences"
          },
          {
            "paperId": "579c9f8d7ad8004d1a214dcb3a552ad384d9150f",
            "title": "Broadening the role of STEM educators: Developing a more equitable STEM workforce for the future"
          },
          {
            "paperId": "4b097e430198c537270fd6588cc9f51eb1080365",
            "title": "Educational Technology Quarterly: in the beginning"
          },
          {
            "paperId": "9cb079dd135408ed431a681bdba5362fd69b42f1",
            "title": "Future masters of psychology training for professional activity in the conditions of non-formal education"
          },
          {
            "paperId": "0c056f2d6b12d6a86439ddc857b4db49f2f39c21",
            "title": "The transforming of an online, distance-learning masters of nature science"
          },
          {
            "paperId": "f9299315baa3700d1f86e0de9038c534af98600a",
            "title": "DEVELOPMENT OF AN INFORMATION SYSTEM FOR PROFESSIONAL TRAINING OF STUDENTS IN DIGITAL EDUCATIONAL ENVIRONMENT"
          }
        ],
        "references": []
      },
      {
        "paperId": "49d9f6bb9f9e3b5ba0d11a009349ca15f7465f65",
        "corpusId": 226967774,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/49d9f6bb9f9e3b5ba0d11a009349ca15f7465f65",
        "title": "Model of an Education Robotics Course for Natural Sciences Teachers",
        "abstract": "STEM is a priority area of education in Ukraine. One of the innovative approaches in STEM education is the integration of academic disciplines through project-based learning using robotics. Therefore, the urgent problem is the development of training courses on educational robotics for teachers of natural sciences. The article presents the model of teaching the Education Robotics course for teachers of natural sciences, which includes the goal, objectives, principles, content, forms, methods, teaching aids. The educational robotics course is designed to introduce future teachers to the principles of creating robotic systems, programming systems, and learn how to create robotic devices based on educational designers, as well as control programs. The course has a modular structure, designed for 150 hours and provides for the study of robotics based on Lego EV3, MBot, Arduino designers and demonstrates scientific and technical solutions to global problems, such as environmental ecology, help with the elements, conservation of flora and fauna, creating favorable conditions for humanity in extraterrestrial conditions, eco-energy and etc. The article contains the rationale for the choice of programming platforms, the methodological basis for the selection of projects for conducting in the lessons at school in accordance with the curriculum. Particular attention is paid to the features of using the project methodology and the formation of soft skills. The importance of introducing the Education Robotics course in the professional training of teachers of natural sciences is due to the support of society for innovation in educational activities and is associated with the level of scientific and technological achievements",
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2020,
        "referenceCount": 12,
        "citationCount": 2,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Engineering"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Engineering",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "322-333"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "1381915893",
            "name": "N. Osypova"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "1659061515",
            "name": "L. Kuzmich"
          }
        ],
        "citations": [
          {
            "paperId": "1a309cdeb7c36381af109ed8696d156b2e2392e4",
            "title": "Advancing educational robotics: competence development for pre-service computer science teachers"
          },
          {
            "paperId": "c6c74bdd8a2bbda092cbf0c368402094349bc055",
            "title": "Model of the Competences in Educational Robotics"
          }
        ],
        "references": [
          {
            "paperId": "6628fd76f15fa4e62b3eec88f13046538d7b80b0",
            "title": "Computer Modelling of Educational Process as the Way to Modern Learning Technologies"
          },
          {
            "paperId": "048ee67c69156e7d8379bd3b199ca89f4a879f45",
            "title": "Systematic Review of Research Trends in Robotics Education for Young Children"
          },
          {
            "paperId": "cae272b2b0bcf462ac66408877e3030c33a7457b",
            "title": "DigComp 2.0: The Digital Competence Framework for Citizens. Update Phase 1: the Conceptual Reference Model."
          },
          {
            "paperId": "67c486d7c3bba1104f526e4e25a81340add18b7d",
            "title": "ROBOTICS AS A MEANS OF TRAINING OF FUTURE TEACHERS OF NATURAL AND MATHEMATICAL DISCIPLINES"
          },
          {
            "paperId": "6a8e0e8c1b34bc24cae33ff0ab1a80985898f568",
            "title": "Activity Plan Template for Supporting Study Science with Robotics and Programming"
          },
          {
            "paperId": "ff28ca7d8dd6fb8bdaff93b8c2ab1ea623157c7f",
            "title": "STEM: country comparisons: international comparisons of science, technology, engineering and mathematics (STEM) education. Final report."
          },
          {
            "paperId": "28b88ac1ab8510149c70c8e71b51747ea11196ea",
            "title": "Teaching robotics with an open curriculum based on the e-puck robot , simulations and competitions"
          },
          {
            "paperId": null,
            "title": "Prospects for convergence of NBIC technologies to create a technological platform for a new economy, Business Inform, No 2, pp"
          },
          {
            "paperId": null,
            "title": "Experience of foundation STEMschool"
          },
          {
            "paperId": null,
            "title": "Educational robotics as a promising area of STEM education. Open educational e-environment of a modern university"
          },
          {
            "paperId": null,
            "title": "Educational robotics as a tool of knowledge in the educational process in physics, West. Chelyab. state ped un-that"
          },
          {
            "paperId": null,
            "title": "STEM pedagogical technology as a means of reforming the educational system of Ukraine, Gifted Personality Education and Development, No 3(58), pp"
          }
        ]
      },
      {
        "paperId": "62c544d06c9d2444c9d116bb2c4765929d3c1efa",
        "corpusId": 226967855,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/62c544d06c9d2444c9d116bb2c4765929d3c1efa",
        "title": "Distance Learning Technologies in Institution of Higher Education by Means of LCMS Moodle",
        "abstract": "Distance learning (DL) is one of the most rapidly expanding sectors in higher education today. Distance Learning Development requires a consistent solution to a number of important tasks in the field of regulatory, organizational, educational, technical, software and staffing, the interaction of all these elements of the DL system in the implementation of educational programs. One of the most important tasks in organizing distance learning is to define a scalable and viable strategy for creating an information and communication environment. The article presents a review of distance learning literature; the purposes, advantages, disadvantages. The experience of Kherson State University in the use of distance learning was summarized. Particular attention is paid to the implementation features of the KSUONLINE distance learning system developed on the basis of LMS Moodle. The educational courses and webinars were designed to introduce teachers to the principles of creating Distance courses and learn how to ensure effective communication between teachers and students. The research of the level of satisfaction of teachers with seminars to study the capabilities of the distance learning system KSUONLINE was conducted. The main problems associated with the introduction of distance education in Institution of Higher Education are analyzed in this paper. The factors that influence the development of distance learning in universities are identified.",
        "venue": "ICTERI Workshops",
        "year": 2020,
        "referenceCount": 17,
        "citationCount": 7,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle",
          "Review"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "1152-1163"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "1381915893",
            "name": "N. Osypova"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "1659061515",
            "name": "L. Kuzmich"
          }
        ],
        "citations": [
          {
            "paperId": "7f0850179e96cd2a3a353331dac15abd6172656c",
            "title": "MODEL OF BLENDED LEARNING IN HIGHER EDUCATIONAL INSTITUTIONS: DEVELOPMENT, IMPLEMENTATION AND EVALUATION"
          },
          {
            "paperId": "2c41ac1931c88b48fd7161cf554f80ae68affcde",
            "title": "9th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "340fa84ee2c40dea229907e618832be16f7cfd1b",
            "title": "8th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "e8030ec2fe7bd830c600e294512e19a1407dd17b",
            "title": "Cloud resources use for students' project activities"
          },
          {
            "paperId": "4a5803c50fe874f0dc2549f876f345cbce09b140",
            "title": "A DIAGNOSIS OF THE LEVELS OF DEVELOPMENT OF HIGHER EDUCATION STUDENTS' COGNITIVE ACTIVITY IN THE PROCESS OF LEARNING A FOREIGN LANGUAGE USING ICT DURING PRACTICAL CLASSES"
          },
          {
            "paperId": "16f5c8f18299ce56eec2cc1a77f24ec05dd4973f",
            "title": "AREdu 2021 - Immersive technology today"
          },
          {
            "paperId": "2d34a6ce38486d1e24e0631f66cd4b84196c21de",
            "title": "The Use of ICT for Training Future Teachers: An Example of the Course on «Art Education of Preschool Children»"
          }
        ],
        "references": [
          {
            "paperId": "c82e665938b1b645d77260636b6777c23ea9a702",
            "title": "A Review of Distance Learning and Learning Management Systems"
          },
          {
            "paperId": "b07e6613c72e0f9d2e2bf0e7e9fd2bccbbada8a2",
            "title": "The Experience of the Master Classes as a Means of Formation of Readiness of Teachers to Implement Innovation"
          },
          {
            "paperId": "afdda31ab8231af15e0c048a3c8bf327850fb424",
            "title": "Information Competence of University Students in Ukraine: Development Status and Prospects"
          },
          {
            "paperId": "17e0ae79424f03c9235243711d61c3a2a36bd92d",
            "title": "Future and Experienced Teachers Should Collaborate on ICT Integration"
          },
          {
            "paperId": "697ff3c6f5ce20c71dd1bc8f22b8089ad9cb5ace",
            "title": "ELECTRONIC SUPPORT SYSTEM OF NORMATIVE LEGAL BASE OF DISTANCE LEARNING SYSTEM"
          },
          {
            "paperId": "b08f8418d94e73fd124c4dea28fa30fa9b15b103",
            "title": "Aims and tasks of the project “Formation of bank of electronic documents in distance learning of higher pedagogical education”"
          },
          {
            "paperId": "fd3ec742eb294b2c89fbaf873ec8d2d5d9ff497b",
            "title": "‘Distance education’ and ‘e-learning’: Not the same thing"
          },
          {
            "paperId": "577913f54e194d4b967a8a27e41c6363ec6d9bd6",
            "title": "Increase of the Level of Graphic Competence Future Bachelor in Computer Sciences in the Process of Studying 3D Modeling"
          },
          {
            "paperId": "f02705bde2570df5bcd53f66948ad3bceaf4e237",
            "title": "ICT Advanced Training of University Teachers"
          },
          {
            "paperId": "0567e023f4909ee1066382e076c6969102406ed2",
            "title": "Mobile Learning Technologies for Learning English"
          },
          {
            "paperId": "76ef4468e37ec0429df1d538ef3fda83102772e3",
            "title": "UNESCO INSTITUTE FOR INFORMATION TECHNOLOGIES IN EDUCATION"
          },
          {
            "paperId": null,
            "title": "The Regulation on Distance Learning at Kherson State University"
          },
          {
            "paperId": null,
            "title": "Model Standard of ICT Competence of University Teachers in the Context of Improving the Quality of Education"
          },
          {
            "paperId": null,
            "title": "Distance Education conferences worldwide"
          },
          {
            "paperId": null,
            "title": "The Evolution, Principles and Practices of Distance Education"
          },
          {
            "paperId": null,
            "title": "E - learning system of universities based on Moodle . Toolkit"
          },
          {
            "paperId": null,
            "title": "Educational and methodological complex of distance learning teacher training"
          }
        ]
      },
      {
        "paperId": "88fe658e053f73a806d3551d9355e323f98b29ab",
        "corpusId": 235041211,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/88fe658e053f73a806d3551d9355e323f98b29ab",
        "title": "ANALYSIS OF THE EFFECTIVENESS OF ATTRACTING INTELLECTUAL INVESTMENTS IN UKRAINE",
        "abstract": null,
        "venue": "",
        "year": 2020,
        "referenceCount": 0,
        "citationCount": 2,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "https://doi.org/10.32782/2413-9971/2020-30-19",
          "status": null
        },
        "fieldsOfStudy": null,
        "s2FieldsOfStudy": [
          {
            "category": "Economics",
            "source": "s2-fos-model"
          },
          {
            "category": "Business",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "volume": "",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          }
        ],
        "citations": [
          {
            "paperId": "35d664b0d9f1d9a98481d727e390abd814e922b5",
            "title": "Prospects for the development of investment and innovation activity in Ukraine"
          },
          {
            "paperId": "404260c9a2271528ed05e7a72e870d69c5fe8c02",
            "title": "GLOBAL MARKET OF INTELLIGENT INVESTMENTS: EXPERIENCE FOR UKRAINE"
          }
        ],
        "references": []
      },
      {
        "paperId": "08329eb5ab22692d9213f7b1b72afeaba7ab6c76",
        "corpusId": 211344902,
        "publicationVenue": {
          "id": "ca56c454-b2d7-49df-b227-864eca950217",
          "name": "B U L L E T I N OF OLEKSANDR DOVZHENKO HLUKHIV NATIONAL PEDAGOGICAL UNIVERSITY",
          "alternate_names": [
            "B U L L T N OLEKSANDR DOVZHENKO HLUKHIV NATIONAL PEDAGOG UNIV"
          ],
          "issn": "2410-0897"
        },
        "url": "https://www.semanticscholar.org/paper/08329eb5ab22692d9213f7b1b72afeaba7ab6c76",
        "title": "TRAINING TEACHERS OF PRIMARY EDUCATION AND CHALLENGES OF NEW UKRAINIAN SCHOOL (NUS)",
        "abstract": "primary school teachers’ training is substantiated, a number of measures are proposed for leveling the challenges of the New Ukrainian School in the system of pedagogical personnel’s training. Conclusion . The outlined preliminary steps in the development of primary school teachers’ training methodical system based on the principles of the New Ukrainian School require further experimental verification, the development of the content for new courses, the synthesis of experience of the first steps of the NUS Concept implementation. These steps should include introducing changes into the methodological courses of primary education and provide a generalized integrated course which can help to get acquainted with the modern pedagogical technologies.",
        "venue": "B U L L E T I N OF OLEKSANDR DOVZHENKO HLUKHIV NATIONAL PEDAGOGICAL UNIVERSITY",
        "year": 2019,
        "referenceCount": 2,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "http://irbis-nbuv.gov.ua/cgi-bin/irbis_nbuv/cgiirbis_64.exe?C21COM=2&I21DBN=UJRN&P21DBN=UJRN&IMAGE_FILE_DOWNLOAD=1&Image_file_name=PDF/vgnpu_2019_1_13.pdf",
          "status": null
        },
        "fieldsOfStudy": [
          "Political Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Political Science",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "name": "B U L L E T I N  OF  OLEKSANDR DOVZHENKO HLUKHIV   NATIONAL  PEDAGOGICAL UNIVERSITY"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "122669493",
            "name": "V. Shakotko"
          }
        ],
        "citations": [
          {
            "paperId": "6dfff50914f3d0dcdfe12d87cdb418fd4ba33565",
            "title": "Development of the Ideological Culture of the Future Primary School Teacher in the Conditions of the New Ukrainian School"
          }
        ],
        "references": [
          {
            "paperId": "8887b46ff687a2e464b57883c41d76068ca84092",
            "title": "НОВА УКРАЇНСЬКА ШКОЛА КРІЗЬ ПРИЗМУ ІДЕЙ ВАСИЛЯ СУХОМЛИНСЬКОГО: «У КОЖНОЇ ШКОЛИ МАЄ БУТИ СВОЄ НЕПОВТОРНЕ ОБЛИЧЧЯ»"
          },
          {
            "paperId": "f79581c068d5049da130061e9f63024e3a8c3ba8",
            "title": "Концептуальні засади реформування військово-патріотичного виховання дітей та учнівської молоді України"
          }
        ]
      },
      {
        "paperId": "6a8e0e8c1b34bc24cae33ff0ab1a80985898f568",
        "corpusId": 201081409,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/6a8e0e8c1b34bc24cae33ff0ab1a80985898f568",
        "title": "Activity Plan Template for Supporting Study Science with Robotics and Programming",
        "abstract": "Today, specialists in engineering specialties are becoming increasingly popular on the labor market. In accordance with the requirements of society, the educational system is looking for opportunities to increase children's interest in the study of subjects in the natural and mathematical cycle. The article presents the experience of holding a summer camp for children for the purpose of attracting them to scientific research and acquaintance with the courses of STEM (science, technology, engineering, and math). The teachers of the STEM-school of the Kherson State University developed the \"Summer Intensive\" course to familiarize children with the basics of robotics, programming and physics. The course is designed for five days, each of which includes 4 lessons: from physics in practice and experiments, the basics of robotics, the basics of programming, needlework, as well as active games, walks in the park, excursions. During two years 188 children were trained, the article contains the justification for the selection of experiments in physics for children 6-14 years old, a detailed description of their conduct, organization of acquaintance with the basics of robotics using Lego Education WeDo 2.0, programming with Scratch. Particular attention is paid to the peculiarities of the organization and the generalization of the results of training in the summer camp in general and in the context of each subject.",
        "venue": "ICTERI Workshops",
        "year": 2019,
        "referenceCount": 5,
        "citationCount": 8,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "132-143"
        },
        "authors": [
          {
            "authorId": "148198690",
            "name": "Tetiana Goncharenko"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          }
        ],
        "citations": [
          {
            "paperId": "2c41ac1931c88b48fd7161cf554f80ae68affcde",
            "title": "9th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "340fa84ee2c40dea229907e618832be16f7cfd1b",
            "title": "8th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "9403721be4bdbd5d872f5def2ed1c186f272fe1f",
            "title": "Formation of informational and digital competence of secondary school students in laboratory work in physics"
          },
          {
            "paperId": "5a0fef073d5b18e8bb3d0189173b27d2bd186a48",
            "title": "Digitalization of the educational process for the training of the pre-service teachers"
          },
          {
            "paperId": "e8030ec2fe7bd830c600e294512e19a1407dd17b",
            "title": "Cloud resources use for students' project activities"
          },
          {
            "paperId": "a7e98a8678f9a2e72879f9fecde970f006922ede",
            "title": "Cloud technologies for STEM education"
          },
          {
            "paperId": "49d9f6bb9f9e3b5ba0d11a009349ca15f7465f65",
            "title": "Model of an Education Robotics Course for Natural Sciences Teachers"
          },
          {
            "paperId": "c6c74bdd8a2bbda092cbf0c368402094349bc055",
            "title": "Model of the Competences in Educational Robotics"
          }
        ],
        "references": [
          {
            "paperId": null,
            "title": "The curriculum of the optional course (the curriculum \"Technologies"
          },
          {
            "paperId": null,
            "title": "The curriculum of the optional course of labor training and technical creativity for 5-9 classes of secondary schools"
          },
          {
            "paperId": null,
            "title": "Educational program for out-of-school education of the scientific and technical direction for pupils aged 12 to 18 by M.A"
          },
          {
            "paperId": null,
            "title": "WatsonSTEM Occupations: Past, Present, And Future, U.S"
          },
          {
            "paperId": null,
            "title": "Curriculum of the circle for children aged 6-15 years by D.I"
          }
        ]
      },
      {
        "paperId": "8372b88773bbb260b97cf578bdf04c14dbdd75bc",
        "corpusId": 203414464,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/8372b88773bbb260b97cf578bdf04c14dbdd75bc",
        "title": "Determining the Level of Readiness of Teachers to Implementation of STEM-Education in Ukraine",
        "abstract": null,
        "venue": "ICTERI Workshops",
        "year": 2019,
        "referenceCount": 0,
        "citationCount": 18,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Psychology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "144-155"
        },
        "authors": [
          {
            "authorId": "72307091",
            "name": "V. Osadchyi"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          }
        ],
        "citations": [
          {
            "paperId": "5bec6b8200c228ea373e58167b4821e91efc7545",
            "title": "Features of using Moodle tools in the training of future social workers"
          },
          {
            "paperId": "26e909cedb993168d6b33791c2c71b042817101b",
            "title": "Research on the impact of specialized STEM education on later education choices"
          },
          {
            "paperId": "2c41ac1931c88b48fd7161cf554f80ae68affcde",
            "title": "9th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "892d2034737ddf61c54f1446430171d3c9c9bcbf",
            "title": "Teacher readiness in STEM education: Voices of Indonesian Physics teachers"
          },
          {
            "paperId": "0664d2383541c662bed3ceb17b9f15ca13e1c0b0",
            "title": "Features of the development of an automated educational and control complex for checking the quality of students"
          },
          {
            "paperId": "340fa84ee2c40dea229907e618832be16f7cfd1b",
            "title": "8th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "9403721be4bdbd5d872f5def2ed1c186f272fe1f",
            "title": "Formation of informational and digital competence of secondary school students in laboratory work in physics"
          },
          {
            "paperId": "a6f552327565b64ccd7c0ad4c3fe636deab062ad",
            "title": "Using augmented reality technologies for STEM education organization"
          },
          {
            "paperId": "279caa415cdf1f7bb4d7837222797fe94cd09f80",
            "title": "Use of AR/VR Technologies in the Development of Future Specialists' Stress Resistance: Experience of STEAM-Laboratory and Laboratory of Psychophysiological Research Cooperation"
          },
          {
            "paperId": "0c056f2d6b12d6a86439ddc857b4db49f2f39c21",
            "title": "The transforming of an online, distance-learning masters of nature science"
          },
          {
            "paperId": "4605555c714d01e98ff83d40168e3db62bc498cb",
            "title": "Discord platform as an online learning environment for emergencies"
          },
          {
            "paperId": "f893cc3abf52ecb6bd74b8bd2764e2ffa7071b02",
            "title": "Realities and prospects of distance learning at higher education institutions of Ukraine"
          },
          {
            "paperId": "a7e98a8678f9a2e72879f9fecde970f006922ede",
            "title": "Cloud technologies for STEM education"
          },
          {
            "paperId": "5f547ebde05169288890de04128d086675f14da5",
            "title": "Instrumentation, Implementation and Tools in STEM - STEAM Education: A Systematic Literature Review"
          },
          {
            "paperId": "d40ed37cbf8cdc54fbcf46c8936243a98bffdfe6",
            "title": "Studies of impact of specialized STEM training on choice further education"
          },
          {
            "paperId": "16634219ae3aaf852f07b08f6847c1ab88aee5af",
            "title": "Formation of project competence of future environmentalists"
          },
          {
            "paperId": "8c3ab259e65f4d68a8a01aea83032301bf90c532",
            "title": "FORMATION OF THE TUTOR ICT-COMPETENCE IN THE PROCESS OF FUTURE TEACHERS’ PROFESSIONAL TRAINING"
          },
          {
            "paperId": "3d7493d273e8b13caa6099a17bf5d3cac0b9e023",
            "title": "Professional Preparation of Future Teachers of Vocational Training in the Transport Area of Expertise with Use of the Author's Educational Application"
          }
        ],
        "references": []
      },
      {
        "paperId": "8ca1bb82690998cfc2dd93e4748b0350377ee74e",
        "corpusId": 67777266,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/8ca1bb82690998cfc2dd93e4748b0350377ee74e",
        "title": "Experience of Foundation STEM-School",
        "abstract": "The development of artificial intelligence systems in the near future will lead to a reduction in routine, template work. The toolkit changes in most professions. There is a need for a quick retraining of a specialist and the use of computer systems. Nowadays, separate devices and systems have been created that can solve some of the problems that appear in everyday life. Therefore, STEM education is one of the directions that is in demand in society. During last few years in Ukraine there has been a rapid increase in the number of technical groups robotics and programming. All of them are new form of organization, types of classes, target audience. We made an effort to summarize the information received on this issue. In this article we analyze the situation on the market of educational services of the STEM-direction in Ukraine and in other countries, consider the existing technical and methodological support of STEM-education, as well as the experience of creating a STEM-school based on the post-graduate education center of Kherson State University. We describe the steps needed to create such a structure, its place in the educational system. Also we describe the experience of developing the material for the development of curricula, a series of events that promote the attraction of researches, and the introduction of digital technologies in the educational process.",
        "venue": "ICTERI Workshops",
        "year": 2018,
        "referenceCount": 2,
        "citationCount": 9,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Psychology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "431-446"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          },
          {
            "authorId": "29870506",
            "name": "T. Bazanova"
          }
        ],
        "citations": [
          {
            "paperId": "de382a67340b6f7b493565e3f5a652d0429d290b",
            "title": "Integrating STEM based Education for Sustainable Development (ESD) to Promote Quality Education: A Systematic Literature Review"
          },
          {
            "paperId": "a06325ff12ce4f2781d7209a88e684bbddd2d93a",
            "title": "Online Game-Based Learning through Minecraft: Education Edition Programming Contest"
          },
          {
            "paperId": "340fa84ee2c40dea229907e618832be16f7cfd1b",
            "title": "8th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "9403721be4bdbd5d872f5def2ed1c186f272fe1f",
            "title": "Formation of informational and digital competence of secondary school students in laboratory work in physics"
          },
          {
            "paperId": "5a0fef073d5b18e8bb3d0189173b27d2bd186a48",
            "title": "Digitalization of the educational process for the training of the pre-service teachers"
          },
          {
            "paperId": "0ee4195f5cdd92bc3d48fe75f7299785e948132f",
            "title": "Blended learning in the context of digitalization"
          },
          {
            "paperId": "7a7d7c74f18dc9d4d64e9e44eba7c7a90262ad49",
            "title": "Formation of Personalized Learning Path for Foreign Students Based on the MOODLE E-learning Platform Using SCORM-package"
          },
          {
            "paperId": "ebed1b68af294a9e1b8b97a6ad5b84a61826384a",
            "title": "Experience of Developing and Implementation of the Virtual Case Environment in Physics Learning by Google Services"
          },
          {
            "paperId": "6dbc3a31635ad2cd034f8385624b95bd498a378c",
            "title": "Technologies of Virtual and Augmented Reality for High Education and Secondary School"
          }
        ],
        "references": [
          {
            "paperId": "1cb10eee7512436dda9b4a5dce843e1bf714b7ea",
            "title": "REVIEW OF TRENDS, APPROACHES AND PERSPECTIVE PRACTICES OF STEM-EDUCATION FOR TRAINING CENTER OPENING"
          },
          {
            "paperId": null,
            "title": "Why don’t European girls like science or technology? - March, 2017"
          }
        ]
      },
      {
        "paperId": "194f44511da61ca4aeed87fe10126b6a95f71cc8",
        "corpusId": 195552218,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/194f44511da61ca4aeed87fe10126b6a95f71cc8",
        "title": "АНАЛІЗ ОСВІТНІХ ПРОГРАМ НАВЧАННЯ МАЙБУТНІХ ВЧИТЕЛІВ У КОНТЕКСТІ STEM-ОСВІТИ",
        "abstract": "The main task of training vary according to the technologies existing or emerging and developing at a given time. The concept of semantic networks worldwide nowadays brings to the fore the ability to find, analyze information and be able to work as a team. Formation of such skills demanded by the labor market and can provide a successful personal fulfillment in a particular profession. STEM-education is promising directions of educational activities within the challenges of the 21st century. The implementation of new standards of training provides deep understanding of the subject of research, interdisciplinary knowledge and skills. In article open educational resources that can be used to organize STEM-schooling and in-service training for teachers. DOI: https://doi.org/10.28925/2414-0325.2017.3.24755",
        "venue": "",
        "year": 2017,
        "referenceCount": 0,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2017-09-06",
        "journal": {
          "volume": "",
          "pages": "247-255",
          "name": ""
        },
        "authors": [
          {
            "authorId": "103538467",
            "name": "Надія Олександрівна Кушнір"
          },
          {
            "authorId": "148580297",
            "name": "Наталія Валько"
          },
          {
            "authorId": "144174522",
            "name": "Н.В. Осипова"
          },
          {
            "authorId": "2130690702",
            "name": "Людмила Василівна Кузьмич"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          },
          {
            "authorId": "69368540",
            "name": "Liudmyla Kuzmich"
          }
        ],
        "citations": [
          {
            "paperId": "b6497de0d7f02c4bc63c7f71760e0a255b4f107b",
            "title": "Technology of forecasting in the professional activity of future applicants for higher pedagogical education"
          }
        ],
        "references": []
      },
      {
        "paperId": "1cb10eee7512436dda9b4a5dce843e1bf714b7ea",
        "corpusId": 80359471,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/1cb10eee7512436dda9b4a5dce843e1bf714b7ea",
        "title": "REVIEW OF TRENDS, APPROACHES AND PERSPECTIVE PRACTICES OF STEM-EDUCATION FOR TRAINING CENTER OPENING",
        "abstract": "STEM is one of the most current educational trends, it provides young people training according to information society in the science, technology, engineering and mathematics. The leading ideas are interdisciplinary education by solving real practical problems, project work and cooperation. The state of STEM-education in the world and Ukraine is analyzed. Particular attention is paid robotics that enables to develop programming skills and design, and it is the integrator of all components of STEM. The range of services in robotics, constructors for learning is considered. The experience of STEM-center of Kherson State University is presented.",
        "venue": "",
        "year": 2017,
        "referenceCount": 21,
        "citationCount": 4,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Medicine"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Medicine",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "Review"
        ],
        "publicationDate": "2017-06-28",
        "journal": {
          "volume": "",
          "pages": "69-80",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "69368540",
            "name": "Liudmyla Kuzmich"
          }
        ],
        "citations": [
          {
            "paperId": "25b9eab633fe56572882743300ae796355b02965",
            "title": "Becoming a STEM-Focused School District: Administrators’ Roles and Experiences"
          },
          {
            "paperId": "833b73fecd07e668038e647b205df76cb6d4a56d",
            "title": "OSOBLIWOŚCI WYKORZYSTANIA PLATFORMY «TRANSLATOR’S AMANUENSIS 2020» PRZEZ TŁUMACZY JAKO ŚRODKA POSTEDYCJI"
          },
          {
            "paperId": "a7e98a8678f9a2e72879f9fecde970f006922ede",
            "title": "Cloud technologies for STEM education"
          },
          {
            "paperId": "8ca1bb82690998cfc2dd93e4748b0350377ee74e",
            "title": "Experience of Foundation STEM-School"
          }
        ],
        "references": [
          {
            "paperId": "86d25e71d0dbb74b0c52db93b9ec56d46e776330",
            "title": "Validity and worth in the science curriculum: learning school science outside the laboratory"
          },
          {
            "paperId": "cfacfd46d7ea295295b2303e35d1cbc7d4ababba",
            "title": "Activity Plan Template: A Mediating Tool for Supporting Learning Design with Robotics"
          },
          {
            "paperId": "6cd6678a5d75bf436fdc09ae984a5ab8cb492630",
            "title": "Robots in Education"
          },
          {
            "paperId": null,
            "title": "MON Ta Lego Foundation Rozshyriuiut Spivpratsiu [Ministry of Education and Science of Ukraine and Lego Foundation expand cooperation"
          },
          {
            "paperId": null,
            "title": "LEGO Education in schools of Ukraine"
          },
          {
            "paperId": null,
            "title": "The use of robotics and simulators in the education environment"
          },
          {
            "paperId": null,
            "title": "Learn Arduino. (b.d.)"
          },
          {
            "paperId": null,
            "title": "7 things you should know about makerspaces"
          },
          {
            "paperId": null,
            "title": "Desember 12) Audialyi, Vizualyi, Kinestetiki i Digitalyi"
          },
          {
            "paperId": null,
            "title": "Innovatsiini Metody, Zasoby Ta Formy Orhanizatsii Navchalnoho Protsesu U Stem -Osviti [Innovative Methods, Means And Forms Of Of Educational Process Organization In Stem -Education"
          },
          {
            "paperId": null,
            "title": "Innovative methods , means and forms of of educational process organization in STEM - education / N . Osipova , N . Kushnir , N"
          },
          {
            "paperId": null,
            "title": "Cтаття надійшла до редакції"
          },
          {
            "paperId": null,
            "title": "Vision facilitating trainings of IT specialists and boosting the educational eco-system from BrainBasket"
          },
          {
            "paperId": null,
            "title": "The 10 skills you need to thrive in the Fourth Industrial Revolution"
          },
          {
            "paperId": null,
            "title": "Innovative methods, means and forms of of educational process organization in STEM"
          },
          {
            "paperId": null,
            "title": "Vision facilitating trainings of IT specialists and boosting the educational eco-system from BrainBasket Foundation site"
          },
          {
            "paperId": null,
            "title": "Innovative methods, means and forms of of educational process organization in STEM - education"
          },
          {
            "paperId": null,
            "title": "Ukrainski shkoliari rozrobliaiut pershi proekty Internetu rechei"
          },
          {
            "paperId": null,
            "title": "Map of STEM-education centers"
          },
          {
            "paperId": null,
            "title": "STEM Lessons and Resources for Educators"
          },
          {
            "paperId": null,
            "title": "The use of robotics and simulators in the education environment"
          }
        ]
      },
      {
        "paperId": "9dbca3a7a75a6fc3f518632459e31b75053937cf",
        "corpusId": 169432251,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/9dbca3a7a75a6fc3f518632459e31b75053937cf",
        "title": "OPEN EDUCATIONAL RESOURCES TO ORGANIZE TRAINING IN THE CONTEXT OF STEM-EDUCATION",
        "abstract": "The main task of training vary according to the technologies existing or emerging and developing at a given time. The concept of semantic networks worldwide nowadays brings to the fore the ability to find, analyze information and be able to work as a team. Formation of such skills demanded by the labor market and can provide a successful personal fulfillment in a particular profession. STEM-education is promising directions of educational activities within the challenges of the 21st century. The implementation of new standards of training provides deep understanding of the subject of research, interdisciplinary knowledge and skills. In article open educational resources that can be used to organize STEM-schooling and in-service training for teachers. DOI:  https://doi.org/10.28925/2414-0325.2017.3.24755",
        "venue": "",
        "year": 2017,
        "referenceCount": 2,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "http://openedu.kubg.edu.ua/journal/index.php/openedu/article/download/89/122",
          "status": null
        },
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2017-09-06",
        "journal": {
          "volume": "",
          "pages": "247-255",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          },
          {
            "authorId": "69368540",
            "name": "Liudmyla Kuzmich"
          }
        ],
        "citations": [
          {
            "paperId": "7d96da7765fc5d04559e653aec4068daca73aaed",
            "title": "ПРОЄКТНИЙ МЕТОД У STEM-ОСВІТІ ІЗ ЗАСТОСУВАННЯМ ПРОГРАМНО-АПАРАТНОЇ ПЛАТФОРМИ ARDUINO PROJECT METHOD IN STEM EDUCATION USING ARDUINO SOFTWARE AND HARDWARE PLATFORM"
          }
        ],
        "references": [
          {
            "paperId": "1e8552aef64d1deb78de80cc194a2a22eecfb276",
            "title": "A Framework for K-12 Science Education: Practices, Crosscutting Concepts, and Core Ideas"
          },
          {
            "paperId": "4dc89690658b327e7591c6d27decd8a08f7ebe81",
            "title": "Reforming Science Teaching: What Research Says About Inquiry"
          }
        ]
      },
      {
        "paperId": "f02705bde2570df5bcd53f66948ad3bceaf4e237",
        "corpusId": 30096895,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/f02705bde2570df5bcd53f66948ad3bceaf4e237",
        "title": "ICT Advanced Training of University Teachers",
        "abstract": "Nowadays ICT is the integral part of modern teacher’s and scholar’s activity. For teachers it is reasonable to allocate two basic approach of ICT use: e-learning courses designing (to satisfaction of educational needs of students and implementation of new educational approaches) and openness in the presentation of their own research interests. For effective implementation of these approaches it requires information and educational environment of the university and special training of teachers. The model of informational and educational environment of Kherson State University, which is regarded as a set of processes and activities is presented in the article. The curriculum of advanced training course for teachers of the University was designed; the successful completion will allow teachers effectively use ICT to solve professional tasks in educational and research activities. The results of training of group of teachers of Kherson State University are analyzed.",
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2017,
        "referenceCount": 9,
        "citationCount": 14,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "176-190"
        },
        "authors": [
          {
            "authorId": "133669051",
            "name": "Spivakovskiy Oleksandr"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "2781143",
            "name": "Maksym Vinnyk"
          }
        ],
        "citations": [
          {
            "paperId": "e8021d119af57e36ca61ad3e015e13999b3eafa8",
            "title": "XV International Conference on Mathematics, Science and Technology Education"
          },
          {
            "paperId": "26e909cedb993168d6b33791c2c71b042817101b",
            "title": "Research on the impact of specialized STEM education on later education choices"
          },
          {
            "paperId": "965c245ee6c4824a3faad6aa9d94d020e684ecb3",
            "title": "Development of an electronic system for remote assessment of students' knowledge in cloud-based learning environment"
          },
          {
            "paperId": "340fa84ee2c40dea229907e618832be16f7cfd1b",
            "title": "8th Workshop on Cloud Technologies in Education: Report"
          },
          {
            "paperId": "2a151fc15d1261f64419aa1295322399a9593bf4",
            "title": "Роль духовності при формуванні відповідальності у студентів технічних університетів"
          },
          {
            "paperId": "fe85f5c29db86774885a2789e4898803c60c4b95",
            "title": "How Does the Digital Transformation Affect the Job of University Teachers?"
          },
          {
            "paperId": "2d34a6ce38486d1e24e0631f66cd4b84196c21de",
            "title": "The Use of ICT for Training Future Teachers: An Example of the Course on «Art Education of Preschool Children»"
          },
          {
            "paperId": "ec800846d145fc2cc27df51a93420382f4b5961a",
            "title": "Education individualization by means of artificial neural networks"
          },
          {
            "paperId": "d40ed37cbf8cdc54fbcf46c8936243a98bffdfe6",
            "title": "Studies of impact of specialized STEM training on choice further education"
          },
          {
            "paperId": "a96ad0d141e2712290c4c1b1565baf5dead7e92b",
            "title": "IMPLEMENTATION OF THE TOPIC ON CHAT-BOT DEVELOPMENT INTO \"OFFICE COMPUTER TECHNOLOGIES\" UNIVERSITY COURSE"
          },
          {
            "paperId": "62c544d06c9d2444c9d116bb2c4765929d3c1efa",
            "title": "Distance Learning Technologies in Institution of Higher Education by Means of LCMS Moodle"
          },
          {
            "paperId": "61ebb986378c0b1cb07edf041d2804842f0962a9",
            "title": "COMPUTER MEANS TO FORM PROFESSIONAL COMPETENCE OF FUTURE ECOLOGISTS AND BIOLOGISTS IN UKRAINE"
          },
          {
            "paperId": "637596d4c44d7490f2a4b7096e1c2f53870280c7",
            "title": "WEB RESOURCE FOR STUDYING THE ARDUINO PLATFORM FOR SOFTWARE ENGINEERS IN HIGHER EDUCATION OF UKRAINE"
          },
          {
            "paperId": "e5484342e2b9d1c1f50649b189949eba8103aa53",
            "title": "THE INFORMATION SYSTEM OF\nEDUCATIONAL PURPOSE FOR\nTEACHING ECOLOGISTS IN UKRAINE"
          }
        ],
        "references": [
          {
            "paperId": "0a86650d9d29b4569deb66aff923898914698c77",
            "title": "Student Searching Behavior and the Web: Use of Academic Resources and Google"
          },
          {
            "paperId": "d6a3be77d17f6b68963bfcba7c593a300ef84020",
            "title": "Information Illiterate or Lazy: How College Students Use the Web for Research"
          },
          {
            "paperId": "88952bd2038722b0a0f411c038c7802f356e87a5",
            "title": "Worries with the Web: A Look at Student Use of Web Resources"
          },
          {
            "paperId": "b161dc0d334e1205ac2866d2e10ee617745a0522",
            "title": "METHODOLOGICAL COMPLEX OF DISTANCE LEARNING"
          },
          {
            "paperId": null,
            "title": "Technology to Help Teachers Do what they Do Best"
          },
          {
            "paperId": null,
            "title": "The Principles for Developing a Modern Course for Pedagogical Students: a Personality-Oriented Approach"
          },
          {
            "paperId": null,
            "title": "Model Standard of ICT Competence of University Teachers in the Context of Improving the Quality of Education"
          },
          {
            "paperId": null,
            "title": "Diversification of Learning Platforms: Analytical Note"
          },
          {
            "paperId": null,
            "title": "University ICT Infrastructure Construction: Problems and Solutions"
          }
        ]
      },
      {
        "paperId": "2eab4c8ebd39457e861f3b3cdf170ade39659e68",
        "corpusId": 115551172,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/2eab4c8ebd39457e861f3b3cdf170ade39659e68",
        "title": "ФОРМУВАННЯ ТЕХНОЛОГІЧНИХ КОМПЛЕКСІВ НА РОДОВИЩАХ БЛОЧНОГО ОБЛИЦЮВАЛЬНОГО КАМЕНЮ",
        "abstract": "One of the main problems in the Ukrainian dimension stone sector is the distribution problem. A typical quarry exploits up to 1000–1500 m3/y of trade blocks. Thus, it is very difficult to perform a standard foreign order of 500-1000 m3. This is often due to improper exploitation technique planning and management. The aim of the study is to identify the best exploitation technique for the Ukrainian shield conditions in terms of the highest technical and economic applicability. The data were collected at several Ukrainian and Italian quarries. Performance data of dimension stone exploitation techniques was measured in order to determine which of them are the most economic and the least labour-intensive. Unit costs for the monolith explosive separation (using detonating cord) are more than 3 times lower than the use of the combination of diamond wire sawing and dynamic splitting in terms of 1 m3 of trade blocks. The combination of diamond wire saw with «hydrorocksplitters» is slightly cheaper; it justifies its widespread use in Ukrainian quarries. To preserve the rock mass integrity and block surface quality all of the techniques are suitable. Among the tipping techniques the use of wheel loaders is disseminating nowadays. Hydraulic jacks are used at this stage sometimes. Block separation on trade units is often carried out by splitting with manual or hydraulic wedges. Expensive rock blocks can be also splitted by a diamond wire saw. A wheel loader can be used for block handling under short trips condition. While long trip the use of dump trucks for block and waste products transportation is require.",
        "venue": "",
        "year": 2016,
        "referenceCount": 0,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Engineering"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Engineering",
            "source": "external"
          },
          {
            "category": "Engineering",
            "source": "s2-fos-model"
          },
          {
            "category": "Environmental Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Geology",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2016-12-22",
        "journal": {
          "volume": "",
          "pages": "119-126",
          "name": ""
        },
        "authors": [
          {
            "authorId": "144864218",
            "name": "А. Morozov"
          },
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "101047903",
            "name": "Т. M. Loktikova"
          }
        ],
        "citations": [],
        "references": []
      },
      {
        "paperId": "5ba7f5604863b00f4ea800c3ad0dd9d619252231",
        "corpusId": 158613053,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/5ba7f5604863b00f4ea800c3ad0dd9d619252231",
        "title": "PARADIGM CHANGE THE EDUCATION THE TEACHERS OF PRIMARY CLASSES IN THE CONDITIONS OF INFORMATION SOCIETY DEVELOPMENT",
        "abstract": null,
        "venue": "",
        "year": 2016,
        "referenceCount": 0,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Political Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Political Science",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2016-12-01",
        "journal": {
          "volume": "",
          "pages": "89-99",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "52426878",
            "name": "T. Vinnyk"
          }
        ],
        "citations": [],
        "references": []
      },
      {
        "paperId": "784b5afb4da02a548c26fe42f6731801498ecbb6",
        "corpusId": 217663544,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/784b5afb4da02a548c26fe42f6731801498ecbb6",
        "title": "ADVANCED TRAINING OF UNIVERSITY TEACHERS AS PART OF INFORMATION-EDUCATIONAL ENVIRONMENT OF UNIVERSITY",
        "abstract": null,
        "venue": "",
        "year": 2016,
        "referenceCount": 1,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "http://openedu.kubg.edu.ua/journal/index.php/openedu/article/download/47/87",
          "status": null
        },
        "fieldsOfStudy": [
          "Psychology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": null,
        "journal": {
          "volume": "",
          "pages": "204-214",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "2075076847",
            "name": "Maxim O. Vinnik"
          }
        ],
        "citations": [],
        "references": [
          {
            "paperId": "1e6f97f07709f0069f053e8fc63b836de306cd47",
            "title": "STRATEGIES TO DEVELOP MODERN COURSE FOR FUTURE TEACHERS: PERSON-CENTRED APPROACH"
          }
        ]
      },
      {
        "paperId": "8682603e67d8ad3a4724a24824de28c11c7e1c50",
        "corpusId": 217533368,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/8682603e67d8ad3a4724a24824de28c11c7e1c50",
        "title": "ПІДВИЩЕННЯ КВАЛІФІКАЦІЇ ВИКЛАДАЧІВ УНІВЕРСИТЕТУ ЯК ЕЛЕМЕНТ РОЗВИТКУ ІНФОРМАЦІЙНО-ОСВІТНЬОГО СЕРЕДОВИЩА УНІВЕРСИТЕТУ",
        "abstract": "In the article the elements of building (construction) a modern information-educational environment on the example of Kherson State University are considered. The model information-educational environment, which is seen as a set of processes and activities is presented. One of the key elements of this environment, we believe (on our opinion), is the training of teachers of the university (is improvement of professional skill of university teachers). Professional work of the teacher (of each teacher) in the development of information and educational environment of the university guarantees the creation of the modern university. In the article the course program for teachers of university is presented, successful completion of which will enable teachers to more effectively use their professional needs in educational and research activities. DOI: https://doi.org/10.28925/2414-0325.2016.2.204-14",
        "venue": "",
        "year": 2016,
        "referenceCount": 0,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": {
          "url": "http://openedu.kubg.edu.ua/journal/index.php/openedu/article/download/47/87",
          "status": null
        },
        "fieldsOfStudy": [
          "Sociology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Sociology",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2016-09-06",
        "journal": {
          "volume": "",
          "pages": "204-214",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "1692601414",
            "name": "Maxim O. Vinnik"
          }
        ],
        "citations": [
          {
            "paperId": "b15ba4020f1bede7d165245a214e35e975685596",
            "title": "MONITORING OF THE TEACHER'S RATING INDICATORS FOR MAKING MANAGEMENT DECISIONS USING ICT"
          }
        ],
        "references": []
      },
      {
        "paperId": "b07e6613c72e0f9d2e2bf0e7e9fd2bccbbada8a2",
        "corpusId": 2262582,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/b07e6613c72e0f9d2e2bf0e7e9fd2bccbbada8a2",
        "title": "The Experience of the Master Classes as a Means of Formation of Readiness of Teachers to Implement Innovation",
        "abstract": null,
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2016,
        "referenceCount": 12,
        "citationCount": 7,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Psychology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": "2016-06-21",
        "journal": {
          "pages": "200-214"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "144891591",
            "name": "Nataliia Osypova"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "2113811888",
            "name": "O. Litvinenko"
          }
        ],
        "citations": [
          {
            "paperId": "c6f5ee69a05a6c386275226849ae6dd0abb25df1",
            "title": "Improving the learning environment for future mathematics teachers with the use application of the dynamic mathematics system GeoGebra AR"
          },
          {
            "paperId": "4b097e430198c537270fd6588cc9f51eb1080365",
            "title": "Educational Technology Quarterly: in the beginning"
          },
          {
            "paperId": "9950bc1827bbda04b584bff4d918614172185ed8",
            "title": "Model of the On-Line Course for Training Master Students Majoring in Mathematics for Teaching at University"
          },
          {
            "paperId": "bf7cfc86428824686fcc413cb03e5bc21f8932cf",
            "title": "TEACHERS’ CONCEPTION TOWARDS THE USE OF SOCIAL NETWORKS AS A TOOL FOR PROFESSIONAL DEVELOPMENT IN TANZANIA GOVERNMENT SECONDARY SCHOOLS: THE CASE OF DODOMA MUNICIPALITY, TANZANIA"
          },
          {
            "paperId": "7ed5169e0fd22a997c4ac4bf7b5ef6ee605fb81b",
            "title": "Augmented and Virtual Reality Technologies in Teacher Retraining"
          },
          {
            "paperId": "62c544d06c9d2444c9d116bb2c4765929d3c1efa",
            "title": "Distance Learning Technologies in Institution of Higher Education by Means of LCMS Moodle"
          },
          {
            "paperId": "2e686675ebe9a3d8bd0c244b802f8475ab94e3ee",
            "title": "Implementation of Immersive Technologies in Professional Training of Teachers"
          }
        ],
        "references": [
          {
            "paperId": "33e83140600d815f7bae188a68a3d551f5dd1e27",
            "title": "TRAINING OF FUTURE TEACHER OF INFORMATICS TO WORK IN MODERN INFORMATION AND EDUCATIONAL ENVIRONMENT OF SCHOOL"
          },
          {
            "paperId": "a7889d72509efab870caf2f759fefc61d10b0621",
            "title": "SOCIAL NETWORKS AS A MEANS OF LEARNING PROCESS"
          },
          {
            "paperId": "f8cd7b9a7e60e5724b694b1377991565ec0f891a",
            "title": "A Review of Research on Mobile Learning in Teacher Education"
          },
          {
            "paperId": "17e0ae79424f03c9235243711d61c3a2a36bd92d",
            "title": "Future and Experienced Teachers Should Collaborate on ICT Integration"
          },
          {
            "paperId": "afdda31ab8231af15e0c048a3c8bf327850fb424",
            "title": "Information Competence of University Students in Ukraine: Development Status and Prospects"
          },
          {
            "paperId": "a10318bd20b649981c2c42d93845d4227ad23a21",
            "title": "Formation of Digital Competence of Future Teachers of Elementary School"
          },
          {
            "paperId": "852716b0f08cfa74cc9b4af40440e0e688882d86",
            "title": "Towards a framework for the use of ICT in teacher training in Africa"
          },
          {
            "paperId": "026f367878081bcc72e3be397a2d08c4a0e24127",
            "title": "Mobile learning in teacher training"
          },
          {
            "paperId": "0e11f436bad5682800c2ed6c0a2962f93b970e45",
            "title": "Information and Communication Technologies in Education, Research, and Industrial Applications"
          },
          {
            "paperId": "2cba31ab8effe1c61a8983e6523555177174f30e",
            "title": "Teaching Strategies for the Net Generation"
          },
          {
            "paperId": null,
            "title": "Digital Literacy and Internet Security. Methodical Manual for Specialists Basic General Education"
          },
          {
            "paperId": null,
            "title": "How to Train Teachers to Computer Technologies Ceased to Be a Miracle in Training? The Computer at School and Family"
          }
        ]
      },
      {
        "paperId": "17e0ae79424f03c9235243711d61c3a2a36bd92d",
        "corpusId": 22062061,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/17e0ae79424f03c9235243711d61c3a2a36bd92d",
        "title": "Future and Experienced Teachers Should Collaborate on ICT Integration",
        "abstract": null,
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2014,
        "referenceCount": 16,
        "citationCount": 6,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Psychology",
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": "2014-06-09",
        "journal": {
          "pages": "217-237"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          }
        ],
        "citations": [
          {
            "paperId": "a7e98a8678f9a2e72879f9fecde970f006922ede",
            "title": "Cloud technologies for STEM education"
          },
          {
            "paperId": "b07e6613c72e0f9d2e2bf0e7e9fd2bccbbada8a2",
            "title": "The Experience of the Master Classes as a Means of Formation of Readiness of Teachers to Implement Innovation"
          },
          {
            "paperId": "c5a0f11f6919eabf64c48e28660696719facd3c9",
            "title": "Effects of teacher- and school-level ICT training on teachers' use of digital educational resources in rural schools in China: A multilevel moderation model"
          },
          {
            "paperId": "62c544d06c9d2444c9d116bb2c4765929d3c1efa",
            "title": "Distance Learning Technologies in Institution of Higher Education by Means of LCMS Moodle"
          },
          {
            "paperId": "025b7970d882c2c2196e288b28534367a62c5356",
            "title": "Monitoring of Efficiency of Feedback Systems Use on the Base of Kherson State University"
          },
          {
            "paperId": "5c3760dd7f0f37383aa14c0aa975be72f4d35b7e",
            "title": "Creating Texts Together—Collaborative Writing in Polish Secondary School"
          }
        ],
        "references": [
          {
            "paperId": "67998ad7bc779fb78aca1bba3fc2dfa42b2610e9",
            "title": "Bridging the Generation Gap in ICT Education"
          },
          {
            "paperId": "d934bdb914852999e0b1cbc908dc0d48b59ee517",
            "title": "Commentary: The New Pedagogy: Students and Teachers as Learning Partners"
          },
          {
            "paperId": "126fd7a3a7d9fbf9dfddaa65033229a27046d517",
            "title": "The Status of Computer-Assisted Language Instruction"
          },
          {
            "paperId": "a10318bd20b649981c2c42d93845d4227ad23a21",
            "title": "Formation of Digital Competence of Future Teachers of Elementary School"
          },
          {
            "paperId": "0ef25defc74a6d869ea3fce46685299e5a915629",
            "title": "Students' Voices about Learning with Technology"
          },
          {
            "paperId": "b4ec52c69fccf4e5b1cad7da77f37f661bb8d84d",
            "title": "\\IWhere Good Ideas Come From: The Natural History of Innovation\\N By Steven Johnson. New York City: Riverhead Books, 2010."
          },
          {
            "paperId": "07d0a5c516301f6a0302594f3391b1f432f3ccaa",
            "title": "Where Good Ideas Come From"
          },
          {
            "paperId": "021883aba48f9a94ecd2ad3d00db82c397582a12",
            "title": "Leading Gen Y Teachers: Emerging Strategies for School Leaders. TQ Research & Policy Brief."
          },
          {
            "paperId": "ec4f602285ae502c9d70b02f5102d0d6f8c2ed66",
            "title": "The 'digital natives' debate: A critical review of the evidence"
          },
          {
            "paperId": "ba1b91bba5cb64bbf14fbed1815f0a4535a7f932",
            "title": "Bridging the Generation Gap."
          },
          {
            "paperId": "cae155b295abd5b0ab02fb26351720c40e969907",
            "title": "The Structure of Scientific Revolutions"
          },
          {
            "paperId": "363830c2b159f79ca713befcb3b09b393fc53239",
            "title": "Oceans of Innovation. The Atlantic, the Pacific, Global Leadership and the Future of Education"
          },
          {
            "paperId": "7d255e927c42695170cc16f6ba34c9fb128b73f2",
            "title": "ICT in Education, Research, and Industrial Applications"
          },
          {
            "paperId": "95eb15a894b18cf96e2ab7cc53b1a2f77f5a1ed5",
            "title": "Recognizing the potential of ICT in early childhood education"
          },
          {
            "paperId": "2cba31ab8effe1c61a8983e6523555177174f30e",
            "title": "Teaching Strategies for the Net Generation"
          },
          {
            "paperId": "42316e483f17404ec275ef22a1bbc622fdaafd03",
            "title": "College students' perceptions of libraries and information resources : a report to the OCLC membership"
          }
        ]
      },
      {
        "paperId": "1de7c012736833f4a0afcfff377c0e3d6a7fdf82",
        "corpusId": 80456177,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/1de7c012736833f4a0afcfff377c0e3d6a7fdf82",
        "title": "MODEL OF TRAINING OF PRIMARY SCHOOL TEACHERS IN LEARNING THE BASICS OF INFORMATION AND COMMUNICATION TECHNOLOGIES",
        "abstract": null,
        "venue": "",
        "year": 2013,
        "referenceCount": 0,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Medicine"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Medicine",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2013-08-01",
        "journal": {
          "volume": "",
          "pages": "147-153",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          }
        ],
        "citations": [
          {
            "paperId": "b4c3526ced9b695429b1760cf4be3286270a0dc3",
            "title": "Principles of effective functioning of training system of future teachers of natural science and mathematics for STEM technologies usage"
          }
        ],
        "references": []
      },
      {
        "paperId": "1e6f97f07709f0069f053e8fc63b836de306cd47",
        "corpusId": 117253316,
        "publicationVenue": null,
        "url": "https://www.semanticscholar.org/paper/1e6f97f07709f0069f053e8fc63b836de306cd47",
        "title": "STRATEGIES TO DEVELOP MODERN COURSE FOR FUTURE TEACHERS: PERSON-CENTRED APPROACH",
        "abstract": null,
        "venue": "",
        "year": 2013,
        "referenceCount": 0,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Engineering"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Engineering",
            "source": "external"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": null,
        "publicationDate": "2013-05-09",
        "journal": {
          "volume": "",
          "pages": "263-275",
          "name": ""
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          }
        ],
        "citations": [
          {
            "paperId": "784b5afb4da02a548c26fe42f6731801498ecbb6",
            "title": "ADVANCED TRAINING OF UNIVERSITY TEACHERS AS PART OF INFORMATION-EDUCATIONAL ENVIRONMENT OF UNIVERSITY"
          }
        ],
        "references": []
      },
      {
        "paperId": "3b1cdb46a1a5d8044c1a443713ccf5a5d7db2ae0",
        "corpusId": 29537601,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/3b1cdb46a1a5d8044c1a443713ccf5a5d7db2ae0",
        "title": "New Approaches of Teaching ICT to Meet Educational Needs of Net Students Generation",
        "abstract": "The paper describes the educational needs of modern students as generation Net representatives, highlights the contradiction between their characteristics and traditional ways of teaching ICT disciplines. The paper reports teaching experience and poll results for three years at Kherson State University, Ukraine. The purpose of the paper is to offer new teaching approaches to cope with a generation gap and way to improve the quality of ICT teaching.",
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2013,
        "referenceCount": 25,
        "citationCount": 4,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "195-208"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          }
        ],
        "citations": [
          {
            "paperId": "15c1ec5d92da85c2d9f295cacae9b3d2ae2d8870",
            "title": "Evaluation of Methods Adopted for Training Students in the Use of Quantity Surveying Software Packages in Tertiary Institutions in Nigeria"
          },
          {
            "paperId": "87bd51c696de09c8a88f43eacbf61f785b4e1f2e",
            "title": "Mooc implementation in addressing the needs of generation z towards discrete mathematics learning"
          },
          {
            "paperId": "747a3c9fd10fc78927bd7d780fcae5cc3ded2c20",
            "title": "EFFECTIVENESS OF MULTIMEDIA PACAKGE ON LEARNING OUTCOME OF PROSPECTIVE TEACHERS IN RELATION TO ACADEMIC STREAM"
          },
          {
            "paperId": "28e037ea63961304c18cfdc281eb3ab25692082e",
            "title": "University Curricula Modification Based on Advancements in Information and Communication Technologies"
          }
        ],
        "references": [
          {
            "paperId": "a10318bd20b649981c2c42d93845d4227ad23a21",
            "title": "Formation of Digital Competence of Future Teachers of Elementary School"
          },
          {
            "paperId": "9ed86eb6bc00a82f868304dbbd299a131a029bee",
            "title": "The Condition of Education"
          },
          {
            "paperId": "f8861f695962ea88c76ebab950a5763cd957d1bb",
            "title": "Grown Up Digital – How the Net Generation Is Changing Your World"
          },
          {
            "paperId": "021883aba48f9a94ecd2ad3d00db82c397582a12",
            "title": "Leading Gen Y Teachers: Emerging Strategies for School Leaders. TQ Research & Policy Brief."
          },
          {
            "paperId": "457ae57b08cf0cf989c2e05e96e598358684bc79",
            "title": "Review of \"Connecting to the net.generation: What higher education professionals need to know about today's students\""
          },
          {
            "paperId": "5f3006253b492b50988f70d981fd37ac87ddd718",
            "title": "Technological Preparedness among Entering Freshmen: The Role of Race, Class, and Gender"
          },
          {
            "paperId": "1ed7a7cd979d6dd807f3aedc8968b13e20d3bb11",
            "title": "The American Freshman: National Norms for Fall 2000."
          },
          {
            "paperId": "611daecf4291960dd835f820c5951298903fbdaf",
            "title": "The American Freshman: National Norms for Fall 1992."
          },
          {
            "paperId": "a39ec55ea44d4dd0331d96e3b2261fbdaf94b937",
            "title": "Student Affairs Administrators in Higher Education"
          },
          {
            "paperId": "7d255e927c42695170cc16f6ba34c9fb128b73f2",
            "title": "ICT in Education, Research, and Industrial Applications"
          },
          {
            "paperId": null,
            "title": "State-of-the-Art, Challenges and Prospects for Development"
          },
          {
            "paperId": "2cba31ab8effe1c61a8983e6523555177174f30e",
            "title": "Teaching Strategies for the Net Generation"
          },
          {
            "paperId": null,
            "title": "Theoretical and Methodological Background of Informational competencies Formation of Elementary School Teachers"
          },
          {
            "paperId": null,
            "title": "Facebook Traffic up 117%, Veoh Soars 346"
          },
          {
            "paperId": null,
            "title": "Stats Confirm it: Teens don‘t Tweet"
          },
          {
            "paperId": null,
            "title": "Generation We: How Millennial Youth are Taking over America and Changing our World Forever"
          },
          {
            "paperId": null,
            "title": "Home Broadband Adoption"
          },
          {
            "paperId": null,
            "title": "the Mainstreaming of Online Life"
          },
          {
            "paperId": "9862af867c2af9ec7619ec5567782f5b65dc4370",
            "title": "The American College Teacher: National Norms for the 2001-2002 HERI Faculty Survey."
          },
          {
            "paperId": "d76cf3254c29026e3639610c02381f4b65509a2c",
            "title": "The Information-Age Mindset: Changes in Students and Implications for Higher Education"
          },
          {
            "paperId": "83841dcdeafb8ef944670a13f8253129cac9b38d",
            "title": "The American Freshman: National Norms for Fall 1978."
          },
          {
            "paperId": "6875c3dbd64f74f52cd5cffc65803a0a8fe6a3dd",
            "title": "The Condition of education"
          },
          {
            "paperId": null,
            "title": "My goals, objectives and deadlines (to 2020 year)"
          },
          {
            "paperId": null,
            "title": "A letter from You yourself in 2020"
          },
          {
            "paperId": null,
            "title": "My completed tasks"
          }
        ]
      },
      {
        "paperId": "67998ad7bc779fb78aca1bba3fc2dfa42b2610e9",
        "corpusId": 59628789,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/67998ad7bc779fb78aca1bba3fc2dfa42b2610e9",
        "title": "Bridging the Generation Gap in ICT Education",
        "abstract": null,
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2013,
        "referenceCount": 10,
        "citationCount": 8,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Political Science"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Political Science",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": "2013-06-19",
        "journal": {
          "pages": "229-251"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          },
          {
            "authorId": "152711454",
            "name": "Nataliia Valko"
          }
        ],
        "citations": [
          {
            "paperId": "e1651451b5c627500d15ad0d56950f05cea4823d",
            "title": "TRENDS IN DIGITAL ADAPTATION OF SCHOOLS DURING THE COVID-19 PANDEMIC"
          },
          {
            "paperId": "4b097e430198c537270fd6588cc9f51eb1080365",
            "title": "Educational Technology Quarterly: in the beginning"
          },
          {
            "paperId": "e8030ec2fe7bd830c600e294512e19a1407dd17b",
            "title": "Cloud resources use for students' project activities"
          },
          {
            "paperId": "0c056f2d6b12d6a86439ddc857b4db49f2f39c21",
            "title": "The transforming of an online, distance-learning masters of nature science"
          },
          {
            "paperId": "17e0ae79424f03c9235243711d61c3a2a36bd92d",
            "title": "Future and Experienced Teachers Should Collaborate on ICT Integration"
          },
          {
            "paperId": "578f07b274364070e918eb5670be2c3d0523cf0a",
            "title": "A functional requirement model of e-learning system in secondary school in Dhi-Qar province, Iraq"
          },
          {
            "paperId": "275cbee16ac865813e8237f8021c8370fb290638",
            "title": "FLEXIBILITY ICT TRAINING FUTURE TEACHERS UNDER THE INFLUENCE OF FAST CHANGES DIGITAL WORLD"
          },
          {
            "paperId": "af1d3bab62af31e6f8de7df3bc925bfe41664f4f",
            "title": "Computer Anxiety and Computer Self-Efficacy of Older Adults"
          }
        ],
        "references": [
          {
            "paperId": "a10318bd20b649981c2c42d93845d4227ad23a21",
            "title": "Formation of Digital Competence of Future Teachers of Elementary School"
          },
          {
            "paperId": "9ed86eb6bc00a82f868304dbbd299a131a029bee",
            "title": "The Condition of Education"
          },
          {
            "paperId": "021883aba48f9a94ecd2ad3d00db82c397582a12",
            "title": "Leading Gen Y Teachers: Emerging Strategies for School Leaders. TQ Research & Policy Brief."
          },
          {
            "paperId": "f0022cb1d51aea9de13ee6bce2cd53905d37ff36",
            "title": "Grown Up Digital: How the Net Generation is Changing Your World"
          },
          {
            "paperId": "5f3006253b492b50988f70d981fd37ac87ddd718",
            "title": "Technological Preparedness among Entering Freshmen: The Role of Race, Class, and Gender"
          },
          {
            "paperId": "611daecf4291960dd835f820c5951298903fbdaf",
            "title": "The American Freshman: National Norms for Fall 1992."
          },
          {
            "paperId": "2fb1f543fc5d3256e1e9efd42cec8e8f29ac4021",
            "title": "Lessons Learned from Comprehensive Deployments of Multiagent CSCL Applications I-MINDS and ClassroomWiki"
          },
          {
            "paperId": "2cba31ab8effe1c61a8983e6523555177174f30e",
            "title": "Teaching Strategies for the Net Generation"
          },
          {
            "paperId": "d76cf3254c29026e3639610c02381f4b65509a2c",
            "title": "The Information-Age Mindset: Changes in Students and Implications for Higher Education"
          },
          {
            "paperId": "f27e41c19af18087a16f51cea115f7160a06dc37",
            "title": "The Sensitivity of Adolescents to the Processes of Change When Viewed in Relation to Their Own Lives."
          }
        ]
      },
      {
        "paperId": "46d915c5f3bfa4c00f08370027a1bdcb9c2cf569",
        "corpusId": 17922735,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/46d915c5f3bfa4c00f08370027a1bdcb9c2cf569",
        "title": "An Experience of the Creation and Approbation of the Learning Course \"NIT and TFE\" for Future Teachers",
        "abstract": "The article presents the experience of forming the ICT-competencies of future teachers of elementary school and early education. The course is developed on the Moodle platform for distance education. The course objective is training of future teachers to use ICT in their pedagogical activities, understanding the role of ICT, its opportunities and perspectives for improving educational process.",
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2012,
        "referenceCount": 4,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Engineering"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Engineering",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": null,
        "journal": {
          "pages": "207-214"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          }
        ],
        "citations": [],
        "references": [
          {
            "paperId": "9d5ac30213dcc9d64a959a4164e3e67405cede50",
            "title": "Information and communication technology in education: a curriculum for schools and programme of teacher development"
          },
          {
            "paperId": "be83dfd7c160caed006c01d94e5de3aadf9abaa1",
            "title": "The Site"
          },
          {
            "paperId": null,
            "title": "The practical tasks of the course \" NIT and TFE \" for students of pedagogical specialties. Scientific pedagogical journal \" Parus"
          },
          {
            "paperId": null,
            "title": "The course \" New information technologies and technical facilities of education"
          }
        ]
      },
      {
        "paperId": "a10318bd20b649981c2c42d93845d4227ad23a21",
        "corpusId": 53903535,
        "publicationVenue": {
          "id": "14af611b-2e7d-4afd-8856-2c137fe21b36",
          "name": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
          "type": "conference",
          "alternate_names": [
            "ICTERI",
            "Int Conf Inf Commun Technol Educ Res Ind Appl"
          ],
          "url": "http://www.wikicfp.com/cfp/program?id=1492"
        },
        "url": "https://www.semanticscholar.org/paper/a10318bd20b649981c2c42d93845d4227ad23a21",
        "title": "Formation of Digital Competence of Future Teachers of Elementary School",
        "abstract": null,
        "venue": "International Conference on Information and Communication Technologies in Education, Research, and Industrial Applications",
        "year": 2012,
        "referenceCount": 6,
        "citationCount": 10,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "openAccessPdf": null,
        "fieldsOfStudy": [
          "Computer Science",
          "Psychology"
        ],
        "s2FieldsOfStudy": [
          {
            "category": "Computer Science",
            "source": "external"
          },
          {
            "category": "Psychology",
            "source": "external"
          },
          {
            "category": "Computer Science",
            "source": "s2-fos-model"
          },
          {
            "category": "Education",
            "source": "s2-fos-model"
          }
        ],
        "publicationTypes": [
          "JournalArticle"
        ],
        "publicationDate": "2012-06-06",
        "journal": {
          "pages": "230-243"
        },
        "authors": [
          {
            "authorId": "40107319",
            "name": "Nataliya Kushnir"
          },
          {
            "authorId": "2127003",
            "name": "A. Manzhula"
          }
        ],
        "citations": [
          {
            "paperId": "7d4dc077671c385ee0aeaa463cba5fd13e5304bd",
            "title": "Distance Education on the Basis of Innovative Technologies. Problems of the Primary School Teacher Training in Ukraine"
          },
          {
            "paperId": "b07e6613c72e0f9d2e2bf0e7e9fd2bccbbada8a2",
            "title": "The Experience of the Master Classes as a Means of Formation of Readiness of Teachers to Implement Innovation"
          },
          {
            "paperId": "0819cbcc6c8125adec6bfc848895ed74f71afc82",
            "title": "Relatos digitales: activando las competencias comunicativa, narrativa y digital en la formación inicial del profesorado"
          },
          {
            "paperId": "17e0ae79424f03c9235243711d61c3a2a36bd92d",
            "title": "Future and Experienced Teachers Should Collaborate on ICT Integration"
          },
          {
            "paperId": "67998ad7bc779fb78aca1bba3fc2dfa42b2610e9",
            "title": "Bridging the Generation Gap in ICT Education"
          },
          {
            "paperId": "2c21b0dfa4a375040782f4b0fb7a7bbd95845dd7",
            "title": "Digital Storytelling : Activating Communicative , Narrative and Digital Competences in Initial Teacher Training"
          },
          {
            "paperId": "4665b0b6a39868e331b296c43f42910738650f02",
            "title": "Relatos digitales: activando las competencias comunicativa, narrativa y digital en la formación inicial del profesorado"
          },
          {
            "paperId": "3e31b72f9781efbceb4146b3e10fece6b841e0f7",
            "title": "Digital Storytelling: Activating Communicative, Narrative and Digital Competences in Initial Teacher Training Relatos digitales: activando las competencias comunicativa, narrativa y digital en la formación inicial del profesorado"
          },
          {
            "paperId": "275cbee16ac865813e8237f8021c8370fb290638",
            "title": "FLEXIBILITY ICT TRAINING FUTURE TEACHERS UNDER THE INFLUENCE OF FAST CHANGES DIGITAL WORLD"
          },
          {
            "paperId": "3b1cdb46a1a5d8044c1a443713ccf5a5d7db2ae0",
            "title": "New Approaches of Teaching ICT to Meet Educational Needs of Net Students Generation"
          }
        ],
        "references": [
          {
            "paperId": "6ac566f321c73264af11ec5bd47610777fc883a1",
            "title": "Digital Natives, Digital Immigrants"
          },
          {
            "paperId": "598f10c60a6c8916a2f8c3aa034cd581ad8e138e",
            "title": "Information technology in education"
          },
          {
            "paperId": "95eb15a894b18cf96e2ab7cc53b1a2f77f5a1ed5",
            "title": "Recognizing the potential of ICT in early childhood education"
          },
          {
            "paperId": "eab1cf7893458cc9a7776e2556c01dde4b79f328",
            "title": "Informatics Education - Supporting Computational Thinking, Third International Conference on Informatics in Secondary Schools - Evolution and Perspectives, ISSEP 2008, Torun, Poland, July 1-4, 2008, Proceedings"
          },
          {
            "paperId": "9d5ac30213dcc9d64a959a4164e3e67405cede50",
            "title": "Information and communication technology in education: a curriculum for schools and programme of teacher development"
          },
          {
            "paperId": "f6c3e05d34dfe9c2534e95dce5eb4e50ceb9be97",
            "title": "Millennials Rising: The Next Great Generation"
          }
        ]
      }
    ]
  }
}