{
  "author": {
    "author_id": 36190302600,
    "url": "https://www.scopus.com/authid/detail.uri?partnerID=HzOxMe3b&authorId=36190302600&origin=inward",
    "name": "Peschanenko Volodymyr S.",
    "affiliation": "Kherson State University",
    "document_count": 49,
    "h_index": 5,
    "citation_count": 105,
    "areas": [
      [
        "Computational Theory and Mathematics",
        "COMP",
        1703
      ],
      [
        "Information Systems and Management",
        "DECI",
        1802
      ],
      [
        "Automotive Engineering",
        "ENGI",
        2203
      ],
      [
        "Safety, Risk, Reliability and Quality",
        "ENGI",
        2213
      ],
      [
        "Information Systems",
        "COMP",
        1710
      ],
      [
        "Computer Networks and Communications",
        "COMP",
        1705
      ],
      [
        "Control and Systems Engineering",
        "ENGI",
        2207
      ],
      [
        "Computer Vision and Pattern Recognition",
        "COMP",
        1707
      ],
      [
        "Control and Optimization",
        "MATH",
        2606
      ],
      [
        "Modeling and Simulation",
        "MATH",
        2611
      ],
      [
        "Software",
        "COMP",
        1712
      ],
      [
        "Artificial Intelligence",
        "COMP",
        1702
      ],
      [
        "Mechanical Engineering",
        "ENGI",
        2210
      ],
      [
        "Human-Computer Interaction",
        "COMP",
        1709
      ],
      [
        "Management of Technology and Innovation",
        "BUSI",
        1405
      ],
      [
        "Health Informatics",
        "MEDI",
        2718
      ],
      [
        "Renewable Energy, Sustainability and the Environment",
        "ENER",
        2105
      ],
      [
        "Theoretical Computer Science",
        "MATH",
        2614
      ],
      [
        "Applied Mathematics",
        "MATH",
        2604
      ],
      [
        "Electrical and Electronic Engineering",
        "ENGI",
        2208
      ],
      [
        "Computer Science Applications",
        "COMP",
        1706
      ],
      [
        "Computational Mathematics",
        "MATH",
        2605
      ],
      [
        "Signal Processing",
        "COMP",
        1711
      ],
      [
        "Business, Management and Accounting (miscellaneous)",
        "BUSI",
        1401
      ],
      [
        "Computer Science (all)",
        "COMP",
        1700
      ],
      [
        "Computer Science (miscellaneous)",
        "COMP",
        1701
      ],
      [
        "Instrumentation",
        "PHYS",
        3105
      ],
      [
        "Hardware and Architecture",
        "COMP",
        1708
      ],
      [
        "Mathematics (all)",
        "MATH",
        2600
      ]
    ]
  },
  "publications": [
    {
      "eid": "2-s2.0-85166465804",
      "title": "P4Testgen: An Extensible Test Oracle For P4-16",
      "author_count": "10",
      "author_names": "Ruffy, Fabian;Liu, Jed;Kotikalapudi, Prathima;Havel, Vojtech;Tavante, Hanneli;Sherwood, Rob;Dubina, Vladyslav;Peschanenko, Volodymyr;Sivaraman, Anirudh;Foster, Nate",
      "author_ids": "57203417159;14018368500;57994394600;55813687800;54788650800;55848899900;57994237800;36190302600;55549279000;37006482600",
      "author_afids": "60021784;128014681;60033010;60033010;60033010;60033010;130330348;130330348;130330348;60007776",
      "publicationName": "SIGCOMM 2023 - Proceedings of the ACM SIGCOMM 2023 Conference",
      "description": "We present P4Testgen, a test oracle for the P416 language. P4Testgen supports automatic test generation for any P4 target and is designed to be extensible to many P4 targets. It models the complete semantics of the target's packet-processing pipeline including the P4 language, architectures and externs, and target-specific extensions. To handle non-deterministic behaviors and complex externs (e.g., checksums and hash functions), P4Testgen uses taint tracking and concolic execution. It also provides path selection strategies that reduce the number of tests required to achieve full coverage.We have instantiated P4Testgen for the V1model, eBPF, PNA, and Tofino P4 architectures. Each extension required effort commensurate with the complexity of the target. We validated the tests generated by P4Testgen by running them across the entire P4C test suite as well as the programs supplied with the Tofino P4 Studio. Using the tool, we have also confirmed 25 bugs in mature, production toolchains for BMv2 and Tofino.",
      "citedby_count": 2,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85137525401",
      "title": "Modern Methods and Software Systems of Molecular Modeling and Application of Behavior Algebra",
      "author_count": "5",
      "author_names": "Letychevskyi, O.;Volkov, V.;Tarasich, Yu;Sokolova, G.;Peschanenko, V.",
      "author_ids": "55557358400;57197473990;56436890300;57878437800;36190302600",
      "author_afids": "60068509;60068509;60010672;60010672;60010672",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "The main methods of molecular modeling and specialized software for the development and analysis of molecular models are considered. In particular, the article describes the results of the first stage of developing an environment for the analysis of the molecular and biomolecular interaction that is based on the formalism of behavior algebra and insertion modeling. The results of the experiment of applying the proposed approach to modeling the covalent nonpolar bond are given.",
      "citedby_count": 0,
      "authkeywords": "algebraic behavior | molecular modeling | symbolic modeling",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85132355599",
      "title": "Insertion Semantics of VHDL as Electronic Design Languge",
      "author_count": "5",
      "author_names": "Letychevskyi, O. O.;Odarushchenko, O. M.;Peschanenko, V. S.;Kharchenko, V. S.;Moskalets, V. V.",
      "author_ids": "55557358400;56026080100;36190302600;22034616000;57456824900",
      "author_afids": "60068509;128241153;60010672;60068522;128241153",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "The paper considers the problem of insertion semantics of hardware specifications, in particular, the VHDL language. The creation of semantics is necessary to represent the primary code of the VHDL language in the form of an insertion model using algebra of behaviors. This presentation allows the widespread use of formal methods of insertion modeling to verify electronic designs of safety critical systems. The main constructions of the VHDL language and their insertion semantics, such as process, architecture, and parallel operators are considered. The control flow of a VHDL program is constructed in the form of behavioral equations. Consecutive operators are represented as actions of behavior algebra. The problem of signal races and methods of its detection through detection of permutability properties is considered.",
      "citedby_count": 0,
      "authkeywords": "behavior algebra | hardware description language | insertion model | permutability | safety critical system | signal races | symbolic modeling",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85146437579",
      "title": "Algebraic Approach in Molecular Modeling",
      "author_count": "4",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Tarasich, Yuliia;Volkov, Vladislav",
      "author_ids": "55557358400;36190302600;56436890300;57197473990",
      "author_afids": "60068509;128614948;60010672;60068509",
      "publicationName": "International Conference on Electrical, Computer, Communications and Mechatronics Engineering, ICECCME 2022",
      "description": "The presence of a number of open problems in the fields of chemistry, physics, and biology suggests the need to find new approaches, tools, and methods for researching the original properties of organic and inorganic substances. Computer molecular modeling is the basis of many experimental studies is the use. For this time, a lot of special software systems were created. They were successfully used in such diverse areas as medicine, bioinformatics, pharmacology, materials science, and nanotechnology. But, despite a large amount of existing software, new discoveries and challenges in the field of molecular and, in particular, biomolecular modeling provoke the need to develop new methods and tools. In particular, there is a need to develop new algorithms for the use of a quantum-chemical apparatus for the analysis, first of all, of intermolecular interactions, which are the basis for modeling bioactive molecules and materials. One of these approaches is the algebraic approach proposed by the authors. The algebraic approach is based on behavior algebra and the theory of interaction between agents and environments. The article describes the construction of a tool for the study of molecular interactions, which is based on the formalism of behavior algebra and insertion modeling. Representation of the structure of substances at the level of their electronic structure, modeling of the interaction of organic and inorganic substances at the level of quantum-chemical mechanisms of interaction using an algebraic approach allows for solving open issues in natural sciences. In particular, it allows for studying the properties of substances, cell-virus interaction, radiation therapy, etc.",
      "citedby_count": 0,
      "authkeywords": "behavior algebra | insertion modeling | molecular docking | molecular dynamics | molecular modeling | Monte Carlo method | symbolic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85145189928",
      "title": "Algebraic Virtual Machine and Its Applications",
      "author_count": "3",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Volkov, Vlad",
      "author_ids": "55557358400;36190302600;57197473990",
      "author_afids": "128614948;128614948;60068509",
      "publicationName": "Communications in Computer and Information Science",
      "description": "This paper presents a software system called “Algebraic Virtual Machine (AVM), which handles industrial hardware specifications, programs in different languages, and models in algebraic language. It uses the formal algebraic methods that were developed in the scope of behavior algebra and help to resolve the problems of verification, analysis, testing, and cybersecurity. The new version of AVM will include the possibilities to formalize continuous process and significantly extends the usage of formal methods. It permits the possibility of creating your own methods and theories and trying them with industrial examples with minimal efforts. The machine learning technique is used for the definition of formal method efficiency, and the classification model is trained during algebraic processing. The formalization and checking for resistance of blockchain attack is considered as case study.",
      "citedby_count": 0,
      "authkeywords": "Behavior algebra | Formal methods | Model-based testing | Symbolic modeling | Verification",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85145170339",
      "title": "Algebraic Modeling as One of the Methods for Solving Organic Chemistry Problems",
      "author_count": "6",
      "author_names": "Letychevskyi, Oleksandr;Tarasich, Yuliia;Peschanenko, Volodymyr;Volkov, Vladislav;Sokolova, Hanna;Poltoratskyi, Maksym",
      "author_ids": "55557358400;56436890300;36190302600;57197473990;57878437800;56436805400",
      "author_afids": "128614948;128614948;128614948;60068509;60010672;128614948",
      "publicationName": "Communications in Computer and Information Science",
      "description": "A brief review of molecular modeling methods and specialized software and their use for creating and researching molecular models was considered. The authors considered the algebraic approach to modeling molecular interactions in some environments to determine the triggering of the studied properties. In particular, the article describes the results of the first steps of building a tool for the study of molecular, and in particular, biomolecular interaction, based on the formalism of behavioral algebra and insertion modeling. The experiment’s results of applying the proposed approach to modeling atoms interaction (creating of atomic bonds - valence method), constructing the electronic configuration of the molecule/substance (molecular orbitals method), and calculating their main parameters are given. The formalization and properties analysis is considered using the insertion modeling platform.",
      "citedby_count": 0,
      "authkeywords": "Algebraic behavior | Atoms bond modelling | Formal verification | Molecular models | Symbolic modeling",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85139058140",
      "title": "Applying Algebraic Virtual Machine to Cybersecurity Tasks",
      "author_count": "2",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr",
      "author_ids": "55557358400;36190302600",
      "author_afids": "128614948;128614948",
      "publicationName": "2022 IEEE 9th International Conference on Sciences of Electronics, Technologies of Information and Telecommunications, SETIT 2022",
      "description": "The paper presents the formal methods for application within the cybersecurity domain in the scope of the program system AVM (Algebraic Virtual Machine). It was developed on the basis of behavior algebra and the theory of interaction of agents and environments. AVM allows the use of different methods for verification of system properties, detection of the behavior given as algebraic patterns, and the definition of equivalency of the formal systems. Two case studies are considered as the application of the algebraic approach for resolving the problem of vulnerability detection and checking resistance to cyber-attacks. It can be efficiently used in model-driven development of safety-critical systems correspondingly to requirements in standards to apply formal methods for verification and testing.",
      "citedby_count": 1,
      "authkeywords": "algebraic matching | formal verification | model-driven development | symbolic modeling | vulnerability detection",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85138829192",
      "title": "Algebraic Modeling of Molecular Interactions",
      "author_count": "5",
      "author_names": "Letychevskyi, Oleksandr;Tarasich, Yuliia;Peschanenko, Volodymyr;Volkov, Vladislav;Sokolova, Hanna",
      "author_ids": "55557358400;56436890300;36190302600;57197473990;57878437800",
      "author_afids": "128614948;128614948;128614948;60068509;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The approach of algebraic modeling of molecular interactions in some environment to determine the triggering of the studied properties is considered in the present article. The main idea of this study is to represent the actions of elementary particles in different molecular structures, in particular the motion of electrons in orbitals as algebraic equations for further processing. Behavior algebra specifications are used as the modeling language. The article also describes the formalization of the examples of atoms interaction (creating of chemical bonds) on the example of Ionic Bond. The formalization and properties analysis is considered with the usage of the insertion modeling platform. The study is at an early stage of development and the approach is demonstrated by some examples.",
      "citedby_count": 0,
      "authkeywords": "Algebraic behavior | Formal verification | Molecular models | Symbolic modeling",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85138762808",
      "title": "Algebraic Virtual Machine Project",
      "author_count": "3",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Volkov, Vladislav",
      "author_ids": "55557358400;36190302600;57197473990",
      "author_afids": "128614948;128614948;60068509",
      "publicationName": "Communications in Computer and Information Science",
      "description": "This paper presents a program system called an algebraic virtual machine (AVM), which handles industrial hardware specifications, programs in different languages, and models in algebraic language. It uses the formal algebraic methods that were developed in the scope of behavior algebra and help to resolve the problems of verification, analysis, testing, and cybersecurity. It permits the possibility of creating your own methods and theories and trying them with industrial examples with minimal efforts. The machine learning technique is used for the definition of formal method efficiency, and the classification model is trained during algebraic processing. The formalization and checking for resistance of blockchain attack is considered.",
      "citedby_count": 0,
      "authkeywords": "Behavior algebra | Formal methods | Model-based testing | Symbolic modeling | Verification",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85133611888",
      "title": "Consensus Protocol Security Analysis Using an Algebraic Virtual Machine",
      "author_count": "3",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Horbatiuk, Sergiy",
      "author_ids": "55557358400;36190302600;57221682220",
      "author_afids": "60068509;60010672;60068509",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The paper presents the behavior algebra formal methods for application within the consensus protocol security analysis domain in the scope of the program system AVM (Algebraic Virtual Machine). It was developed on the basis of behavior algebra and the theory of interaction of agents and environments. AVM allows the use of different methods for analysis of system properties, detection of the behavior given as algebraic patterns, and symbolic modeling of system behavior. The simplified version of Proof of Stake protocol is considered as the example of application of the algebraic approach for resolving the problem of checking resistance to attacks and reachability of undesirable properties. The study presents formalization of the protocol and its properties as behavior algebra equations. Methods of property reachability and analysis in the scope of behavior algebra such as symbolic modelling and algebraic matching are considered. The works are in progress and the study demonstrates the first applications of the approach.",
      "citedby_count": 0,
      "authkeywords": "Algebraic modeling | blockchain | consensus protocol | cyberattack | formal methods | symbolic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85123841183",
      "title": "Fuzz Testing Technique and its Use in Cybersecurity Tasks",
      "author_count": "3",
      "author_names": "Letychevskyi, O. O.;Peschanenko, V. S.;Hryniuk, Y. V.",
      "author_ids": "55557358400;36190302600;57210377011",
      "author_afids": "60068509;60010672;60068509",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "The paper considers the technology of fuzz testing, which is testing software systems by feeding critical or unexpected input data to them. An overview of the current problem state is made and the main systems of fuzz testing are presented. An approach to the fuzz testing technology with the use of algebraic methods, in particular, symbolic modeling, is considered. The lightweight algorithm, which is designed to reduce test generation time, is considered. The algorithm is implemented in the environment of an insertion modeling system and tested in older system versions developed in Linux.",
      "citedby_count": 0,
      "authkeywords": "behavior algebra | fuzzing | insertion models | software vulnerability | symbolic modeling",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85124802953",
      "title": "Formal Methods of FPGA Project Verification Flow",
      "author_count": "7",
      "author_names": "Naumenko, Serhii;Moskalets, Viktoriia;Odarushchenko, Oleg;Odarushchenko, Elena;Peschanenko, Volodymyr;Degtyareva, Larysa;Letychevskyi, Oleksandr",
      "author_ids": "57457083400;57456824900;56026080100;56560220900;36190302600;57194600433;55557358400",
      "author_afids": "60106554;120767374;120767374;60106554;60010672;60106554;60068509",
      "publicationName": "Proceedings of the 11th IEEE International Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications, IDAACS 2021",
      "description": "FPGA technology for developing safety-based PLCs for industrial applications (for example NPP IC) became more popular. One of the main part of FPGA-based IC system lifecycle is verification. FPGA Project Verification main stages are described. Verification influence on product development time, cost and quality are described. The article presents a new approach to performing the functional testing stage. This approach is based on the use of formal algebraic methods. The main advantage of using this approach is the increase in testing efficiency due to the use of the procedure for automatic generation of test cases. More than 10 years' experience of verification approaches of Radics LLC verification team is presented.",
      "citedby_count": 2,
      "authkeywords": "Algebraic modeling | EDD - electronic detailed design | Formal verification methods | FPGA - field-programmable gate array | IC systems | NPP - nuclear power plant | PLC - programmable logic controller | Verification",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85091819010",
      "title": "Modeling Method for Development of Digital System Algorithms Based on Programmable Logic Devices",
      "author_count": "5",
      "author_names": "Letychevskyi, O. O.;Peschanenko, V. S.;Kharchenko, V. S.;Volkov, V. A.;Odarushchenko, O. M.",
      "author_ids": "55557358400;36190302600;22034616000;57197473990;56026080100",
      "author_afids": "60068509;60010672;60068522;60068509;125175681",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "The paper deals with state-of-the-art trends in the field of automated hardware development, specifically development of digital systems using programmable logic integrated circuits, as exemplified by field-programmable logic arrays. The paper suggests a modeling method of development using an algebraic model of design specifications, requirements and binary codes in order to apply formal methods of verification, model-based testing, as well as methods of algebraic matching. The specifications of the algebraic hardware model are behavior algebra determined on a set of actions and behaviors.",
      "citedby_count": 7,
      "authkeywords": "algebraic matching | behavior algebra | field-programmable gate arrays | symbolic modeling",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85096097163",
      "title": "Platform for modeling of algebraic behavior: Experience and conclusions",
      "author_count": "4",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Poltoratskyi, Maksym;Tarasich, Yuliia",
      "author_ids": "55557358400;36190302600;56436805400;56436890300",
      "author_afids": "60068509;60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "In the article the platform for modeling of algebraic behavior is considered. It is intent for formalization of the systems, especially distributed, their modelling and analysis of the properties. Platform is used for the formal verification, model-based testing and security issues detection. Behavior algebra specifications are used as the modeling language. The number of projects is considered in the paper implemented on platform in cybersecurity, blockchain solutions and legal requirements processing.",
      "citedby_count": 3,
      "authkeywords": "Algebraic behavior | Formal verification | Formalization | Insertion modeling | Symbolic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85079094726",
      "title": "Our Approach to Formal Verification of Token Economy Models",
      "author_count": "4",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Poltoratskyi, Maksym;Tarasich, Yuliia",
      "author_ids": "55557358400;36190302600;56436805400;56436890300",
      "author_afids": "122875280;122875280;60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The tokenomic modeling is one of the most efficient approaches for understanding and prediction of its subject’s behavior. There are many tools for simulation modeling of behavior in different domains but there is lack of examples in literature on the usage for tokenomic modeling. The paper considers the formal methods approach for tokenomic modeling. Thus, this article provides a brief description of the technology and the methods and tools developed by the authors for token economy modeling and for the analysis and study of its properties. The article also describes the formalization of the tokenomics model on the example of the SKILLONOMY project and presents the specific and symbolic SKILLONOMY models and its simulation results. The formalization and properties analysis is considered with usage of insertion modeling platform.",
      "citedby_count": 2,
      "authkeywords": "Blockchain | Crypto-economics | Insertion modeling | Symbolic modeling | Tokenomic modeling | Tokenomics",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85075108174",
      "title": "An Overview of the Modern Methods of Security and Protection of Software Systems",
      "author_count": "5",
      "author_names": "Letychevskyi, O. O.;Peschanenko, V. S.;Hryniuk, Y. V.;Radchenko, V. Yu;Yakovlev, V. M.",
      "author_ids": "55557358400;36190302600;57210377011;57209969475;57210367955",
      "author_afids": "60068509;100338536;60068509;123460762;60068509",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "Security and protection of software resources are one of the most important issues in the IT industry since attackers’ actions become increasingly sophisticated and losses caused by cyberattacks are growing. Traditional methods of cyberattack prevention become inefficient; therefore, development of new methods and tools to secure software resources becomes of essential need. The studies that are based on formal methods with the use of modern algebraic theories are especially interesting and promising.",
      "citedby_count": 1,
      "authkeywords": "algebraic modeling | behavior algebra | cybersecurity | formal methods | insertion programming | symbolic methods | symbolic modeling | vulnerability detection",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85096107851",
      "title": "Algebraic Matching of Vulnerabilities in a Low-Level Code",
      "author_count": "5",
      "author_names": "Letychevskyi, Oleksandr;Hryniuk, Yaroslav;Yakovlev, Viktor;Peschanenko, Volodymyr;Radchenko, Viktor",
      "author_ids": "55557358400;57210377011;57210367955;36190302600;57209969475",
      "author_afids": "60011313;60011313;60011313;130119892;130119892",
      "publicationName": "ISeCure",
      "description": "This paper explores the algebraic matching approach for detection of vulnerabilities in binary codes. The algebraic programming system is used for implementing this method. It is anticipated that models of vulnerabilities and programs to be verified are presented as behavior algebra and action language specifications. The methods of algebraic matching are based on rewriting rules and techniques with usage of conditional rewriting. This process is combined with symbolic modeling that gives a possibility to provide accurate detection of vulnerabilities. The paper provides examples of formalization of vulnerability models and translation of binary codes to behavior algebra expressions.",
      "citedby_count": 2,
      "authkeywords": "Algebraic Matching | Behavior Algebra | Rewriting Rules | Symbolic Modeling | Vulnerability Detection",
      " aggregationType": "Journal",
      " issn": "20082045"
    },
    {
      "eid": "2-s2.0-85072016361",
      "title": "Algebraic approach to verification and testing of distributed applications",
      "author_count": "5",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Radchenko, Viktor;Orlovsky, Maxim;Sobol, Andrey",
      "author_ids": "55557358400;36190302600;57209969475;57210113772;57210103782",
      "author_afids": "60011313;60010672;127081368;122909243;122909243",
      "publicationName": "ACM International Conference Proceeding Series",
      "description": "Challenges in developing distributed applications have given rise to various different design techniques and technologies. This paper presents an algebraic approach using formal verification and model-based testing that can be applied to different development stages. The insertion modeling system software developed by the authors of this paper is used to implement this approach and to apply it to the model-driven development of distributed systems based on blockchain consensus protocols.",
      "citedby_count": 3,
      "authkeywords": "Behavior algebra | Distributed application | Formal verification | Insertion modeling | Model-based testing",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85070488116",
      "title": "Algebraic Patterns of Vulnerabilities in Binary Code",
      "author_count": "5",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Radchenko, Viktor;Hryniuk, Yaroslav;Yakovlev, Viktor",
      "author_ids": "55557358400;36190302600;57209969475;57210377011;57210367955",
      "author_afids": "60068509-122875280;60010672-122875280;122875280;60068509;60068509",
      "publicationName": "Conference Proceedings of 2019 10th International Conference on Dependable Systems, Services and Technologies, DESSERT 2019",
      "description": "This paper presents an algebraic approach for formalizing and detecting vulnerabilities in binary code. It uses behaviour algebra equations for creating patterns of vulnerabilities and algebraic matching methods for vulnerability detection. Algebraic matching is based on symbolic modelling. This paper considers a known vulnerability, buffer overflow, as an example to demonstrate an algebraic approach for pattern creation.",
      "citedby_count": 5,
      "authkeywords": "algebraic matching | behaviour algebra | cyber reasoning systems | rewriting rules | symbolic modelling | vulnerability detection",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85069174391",
      "title": "Formal verification of token economy models",
      "author_count": "6",
      "author_names": "Letychevsky, O.;Peschanenko, V.;Radchenko, V.;Poltoratzkyi, M.;Kovalenko, P.;Mogylko, S.",
      "author_ids": "55557358400;36190302600;57209969475;56436805400;57209023088;57209982117",
      "author_afids": "122875280;122875280;122875280;60010672;122875596;122875596",
      "publicationName": "ICBC 2019 - IEEE International Conference on Blockchain and Cryptocurrency",
      "description": "This paper considers the formal methods approach for token economy modeling, analysis and studying of its properties. It uses an insertion modeling technique for verification of a token economy and behavior algebra specifications for formalization. The project SKILLONOMY is considered as an example of algebraic approach application. The formalization and properties analysis are considered with usage of the insertion modeling platform.",
      "citedby_count": 5,
      "authkeywords": "algebraic programing | blockchain | insertion modeling system | symbolic modeling | tokenomic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85069523758",
      "title": "Formalization and algebraic modeling of tokenomics projects",
      "author_count": "5",
      "author_names": "Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Radchenko, Viktor;Poltoratskyi, Maksym;Tarasich, Yuliia",
      "author_ids": "55557358400;36190302600;57209969475;56436805400;56436890300",
      "author_afids": "122875280;122875280;122875280;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "This article provides a brief description of the technology and the methods and tools developed by the authors for token economy modeling and for the analysis and study of its properties. The article also describes the formalization of the tokenomics model on the example of the SKILLONOMY project and presents the specific and symbolic SKILLONOMY models and its simulation results.",
      "citedby_count": 4,
      "authkeywords": "Blockchain | Crypto-economics | Insertion modeling | Symbolic modeling | Tokenomic modeling | Tokenomics",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85069520602",
      "title": "Random re-ordering of the parties in the consensus protocol",
      "author_count": "8",
      "author_names": "Sobol, Andrey;Skobelev, Volodymyr G.;Konchunas, Julian;Radchenko, Viktor;Sachtachtinskagia, Sabina;Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Orlovsky, Maxim",
      "author_ids": "57210103782;16450165400;57210114426;57209969475;57210114394;55557358400;36190302600;57210113772",
      "author_afids": "122909243;60068509;122909243;122910450;122909243-60019507;60068509;60010672;122909243-122908849",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Generation of a publicly verifiable bias-resistant distributed randomness is one of the actual problems in blockchain and its various applications. The complexity of this problem increases significantly for consensus algorithm operating on a decentralized network topology on the assumption that there are neither a trusted third party nor a trusted dealer. Such situation is caused by the fact that the logical structure of algorithms intended to solve the subtasks typical for this problem becomes much more complicated. Besides, there arise some subtasks caused by the complete distribution of the analyzed blockchain network. One of such nontrivial subtasks is the implementation of random re-ordering of the parties, based on generated randomness. This random reordering defines the roles of the parties in the next epoch, and is intended to support equal access of the parties to the functioning of the blockchain network. We present a simplified version of the generation of a publicly verifiable reliable distributed randomness for the consensus protocol operating on a decentralized network topology on the assumption that there are neither a trusted third party nor a trusted dealer. On this base we solve the problem of the random re-ordering for parties which will participate in the implementation of the next epoch.",
      "citedby_count": 0,
      "authkeywords": "Consensus protocols | Distributed randomness | Public verifiability | Random reordering",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85069467893",
      "title": "Formalization and algebraic modeling of university economics",
      "author_count": "3",
      "author_names": "Peschanenko, Volodymyr;Poltoratskyi, Maksym;Pryimak, Karina",
      "author_ids": "36190302600;56436805400;57210115605",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The article discusses the approach to modeling economic processes at the university using the methods of algebraic modeling and insertional modeling. The formal model of the eco-nomic processes of the university is presented in the article.",
      "citedby_count": 0,
      "authkeywords": "Economic modeling | Formal methods | Formalization of the eco-nomic model | Insertion modeling",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85057105507",
      "title": "Algorithm and Tools for Constructing Canonical Forms of Linear Semi-Algebraic Formulas",
      "author_count": "5",
      "author_names": "Lvov, M.;Peschanenko, V.;Letychevskyi, O.;Tarasich, Y.;Baiev, A.",
      "author_ids": "35772818200;36190302600;55557358400;56436890300;57194128427",
      "author_afids": "60010672;60010672;60068509;60010672;60010672",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "The results of testing formula simplification tools are presented in the first part of this paper. In the second part, an algorithm for constructing canonical forms of linear semi-algebraic formulas is described. The main result of the study is the definition of the canonical form of a linear semi-algebraic formula that has the property of uniqueness and other useful properties. An algorithm for constructing such a formula is described.",
      "citedby_count": 2,
      "authkeywords": "algebraic programming | canonical form | linear semialgebraic formula | software verification | system of linear inequalities",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-85051087232",
      "title": "Use of metods of algebraic programming for the formal verification of legal acts",
      "author_count": "2",
      "author_names": "Peschanenko, Volodymyr;Poltorackiy, Maksim",
      "author_ids": "36190302600;56436805400",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "This article briefly describes the programmable tool for the analysis of a normative legal document. A mechanism for checking legal requirements is presented. The model of the legal document is proposed in the form of a set of special rules. Verification is provided by means of algebraic programming and methods of symbolic transformation. This approach allows us to analyze the legislative base of structural and logical errors, check the contradictions, completeness and integrity of legal acts. Presently, the mechanism of claster analysis of text, which makes it possible to identify the frequency of occurrence of various vague language constructs.",
      "citedby_count": 0,
      "authkeywords": "Algebra of behavior | Algebraic programming | Law | Legal requirements",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048356846",
      "title": "Preface",
      "author_count": "10",
      "author_names": "Ermolayev, Vadim;Suárez-Figueroa, Mari Carmen;Yakovyna, Vitaliy;Kharchenko, Vyacheslav;Kobets, Vitaliy;Kravtsov, Hennadiy;Peschanenko, Vladimir;Prytula, Yaroslav;Nikitchenko, Mykola;Spivakovsky, Aleksander",
      "author_ids": "13104107100;56005389600;6602569305;22034616000;56006224700;55780812100;36190302600;57203185304;6602842336;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85034655018",
      "title": "An algebraic approach for analyzing of legal requirements",
      "author_count": "4",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Oleksandr;Peschanenko, Vladimir;Poltorackij, Maxsim",
      "author_ids": "57190804300;55557358400;36190302600;56436805400",
      "author_afids": "60068509;60068509;60010672;60010672",
      "publicationName": "Proceedings - 2017 IEEE 25th International Requirements Engineering Conference Workshops, REW 2017",
      "description": "In this paper, we present an Algebraic Programming System in which the algebraic approach is used to formally prove the correctness or irregularity of tax actions for tax payers corresponding to tax laws. The given taxation example illustrates the application of this system to detect the tax code inconsistencies in the decisions made by the Ukrainian Taxation Office. The Algebraic Programming System is used to detect such conflicts or prove correctness using automatic reasoning from the formalized legal requirements.",
      "citedby_count": 3,
      "authkeywords": "Algebra of behavior | Algebraic programming | Legal requirements",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85020532198",
      "title": "The canonical forms of logical formulae over the data types and their using in programs verification",
      "author_count": "4",
      "author_names": "Lvov, Michael;Peschanenko, Vladimir;Letychevskyi, Oleksandr;Tarasich, Yuliia",
      "author_ids": "35772818200;36190302600;55557358400;56436890300",
      "author_afids": "60010672;60010672;60068509;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "A brief review and the results of working with tools for the formulae simplifying are presented. The algorithm for constructing the canonical forms of linear semi-algebraic formulae over the enumerated and multiple types is described.",
      "citedby_count": 2,
      "authkeywords": "Canonical forms | Linear semi-algebraic formulae | Logical formulae | System of linear inequalities | Trapezoids",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85020521595",
      "title": "Formalization and algebraic verification of legal requirements",
      "author_count": "7",
      "author_names": "Godlevskyi, Alexander;Letichevskyi, Aleksander;Peschanenko, Vladimir;Letychevskyi, Oleksandr;Morokhovets, Maryna;Skobelev, Volodymyr;Poltorackiy, Maksym",
      "author_ids": "14826396900;57190804300;36190302600;55557358400;6602080517;16450165400;56436805400",
      "author_afids": "60068509;60068509;60010672;60068509;60068509;60068509;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "This paper outlines the technology of the formalization and verification of legal text documents. A formal model of a legal document is presented as an ordered set of rules. Every rule is presented as a triple containing pre- and post-conditions, as well as process parts. All rules are ordered in Use Case Maps (UCM) diagrams. Such a formal model can be verified for inconsistency and incompleteness, which are the causes of gaps and ambiguities in legal requirements. Verification is implemented by means of algebraic computation and symbolic modelling. The formalization of legal requirements is performed with the use of an intermediate language. An example of the procedure of registration from the Tax Code of Ukraine is given for the illustration of the algebraic method implemented in the Insertion Modeling System (IMS).",
      "citedby_count": 0,
      "authkeywords": "Algebraic computation | Basic protocols | Legal requirements | Symbolic modeling | Use case maps",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85020488385",
      "title": "Preface",
      "author_count": "10",
      "author_names": "Ermolayev, Vadim;Bassiliades, Nick;Fill, Hans Georg;Yakovyna, Vitaliy;Mayr, Heinrich C.;Kharchenko, Vyacheslav;Peschanenko, Vladimir;Shyshkina, Mariya;Nikitchenko, Mykola;Spivakovsky, Aleksander",
      "author_ids": "13104107100;6603620714;23034430300;6602569305;7103006723;22034616000;36190302600;56289490700;6602842336;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84997107013",
      "title": "Symbolic modelling in white-box model-based testing",
      "author_count": "3",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Oleksandr;Peschanenko, Vladimir",
      "author_ids": "57190804300;55557358400;36190302600",
      "author_afids": "60068509;60068509;60010672",
      "publicationName": "Proceedings - AIMS 2015, 3rd International Conference on Artificial Intelligence, Modelling and Simulation",
      "description": "This paper outlines the development of symbolic modelling in white-box testing technology within the scope of an insertion modelling system (IMS). It implements the symbolic execution of the tested system and generate traces that contain a scenario of system behaviour. The obtained traces were checked for conformance with either a formal model for system specifications or a design model. This technique provides for the possibility of obtaining a good index of code line coverage that is highly recommended in the testing of safety-critical systems.",
      "citedby_count": 1,
      "authkeywords": "basic protocols | model-based testing | symbolic execution | use-case maps | white-box testing",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-84955598384",
      "title": "Approach to behavior scenarios debugging",
      "author_count": "5",
      "author_names": "Drobintsev, P.;Kotlyarov, V.;Nikiforov, I.;Letichevsky, A.;Peschanenko, V.",
      "author_ids": "56049610600;9536159300;56583845400;35357916400;36190302600",
      "author_afids": "60017103;60017103;60017103;60068509;60010672",
      "publicationName": "Automatic Control and Computer Sciences",
      "description": "The paper presents two approaches to debugging of application model behavior scenarios: semi-automatic and automatic. The first approach allows the user to automate the process of finding a place in a concrete symbolic behavioral scenario that caused an error. The second approach allows to find together with places the cause of multiple errors in some set of generated behavior scenarios in a single analysis cycle.",
      "citedby_count": 2,
      "authkeywords": "automatic analysis of error causes | behavior model | causes of errors | Guide | semi-automatic analysis | symbolic scenario | symbolic trace",
      " aggregationType": "Journal",
      " issn": "01464116"
    },
    {
      "eid": "2-s2.0-84951030217",
      "title": "Insertion modeling and symbolic verification of large systems",
      "author_count": "4",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Oleksandr;Peschanenko, Volodymyr;Weigert, Thomas",
      "author_ids": "35357916400;55557358400;36190302600;6602077883",
      "author_afids": "60068509;60068509;60010672;112536454",
      "publicationName": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
      "description": "Insertion modeling has been developed over the last decade as an approach to a general theory of interaction between agents and an environment in complex distributed multiagent systems. The original work in this direction proposed a model of interaction between agents and environments based on an insertion function and the algebra of behaviors (similar to process algebra). Over the recent years, insertion modeling has been applied to the verification of requirement specifications of distributed interacting systems and to the generation of tests from such requirements. Our system, VRS (Verification of Requirements Specifications), has successfully verified specifications in the field of telecommunication systems, embedded systems, and real-time systems. Formal requirements in VRS are presented by means of local descriptions with a succession relation. Formalized requirements are represented in a formalism that combines logical specifications with control descriptions provided by the graphical syntax of UCM (Use Case Map) diagrams. This paper overviews the main concepts of insertion modeling, presents new algorithms developed for symbolic verification, especially a new predicate transformer for local descriptions, and provides a formal description of the method of generating traces from such specifications (which is the key technology used to verify requirements and derive test suites).",
      "citedby_count": 10,
      "authkeywords": "Large system development | Symbolic techniques | Verification",
      " aggregationType": "Book Series",
      " issn": "03029743"
    },
    {
      "eid": "2-s2.0-84939983289",
      "title": "Generating Symbolic Traces in the Insertion Modeling System",
      "author_count": "4",
      "author_names": "Letichevsky, A. A.;Letychevskyi, O. O.;Peschanenko, V. S.;Huba, A.",
      "author_ids": "35357916400;55557358400;36190302600;56798747900",
      "author_afids": "60068509;60068509;60010672;60068509",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "This paper describes a new generator of symbolic traces which is designed for the latest version of the insertion modeling system. The basic characteristics of the generator are the use of graphic representations of descriptions of multilevel models, division of local descriptions and consequence relation, possibility of adjustment to different search strategies, and application of a new predicate transformer that admits generality quantifiers with constraints relaxed relative to the previous versions.",
      "citedby_count": 5,
      "authkeywords": "insertion modeling | UCM | verification",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-84930344389",
      "title": "Preface",
      "author_count": "12",
      "author_names": "Batsakis, Sotiris;Mayr, Heinrich C.;Yakovyna, Vitaliy;Nikitchenko, Mykola;Zholtkevych, Grygoriy;Kharchenko, Vyacheslav;Kravtsov, Hennadiy;Kobets, Vitaliy;Peschanenko, Vladimir;Ermolayev, Vadim;Bobalo, Yuriy;Spivakovsky, Aleksander",
      "author_ids": "26631759300;7103006723;6602569305;6602842336;55557328000;22034616000;55780812100;56006224700;36190302600;13104107100;8410487000;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84930326692",
      "title": "An interleaving reduction for reachability checking in symbolic modeling",
      "author_count": "3",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Oleksandr;Peschanenko, Vladimir",
      "author_ids": "35357916400;55557358400;36190302600",
      "author_afids": "60068509;60068509;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "This paper is devoted to the whole problem of interleaving reduction in modeling of concurrent processes. The main notions of insertional modeling were described. The verification problem in terms of insertional modeling was examined. General algorithm of interleaving reduction in terms of insertional modeling was presented. A static and incremental algorithm of reduction for reachability checking was presented. The proof of correctness of presented algorithm was introduced. The results of experiments of such algorithm application was described.",
      "citedby_count": 2,
      "authkeywords": "Interleaving | Predicate transformer | Symbolic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84894640225",
      "title": "An approach to creating concretized test scenarios within test automation technology for industrial software projects",
      "author_count": "5",
      "author_names": "Kolchin, A.;Letichevsky, A.;Peschanenko, V.;Drobintsev, P.;Kotlyarov, V.",
      "author_ids": "56371355000;35357916400;36190302600;56049610600;9536159300",
      "author_afids": "60068509;60068509;60068509;60017103;60017103",
      "publicationName": "Automatic Control and Computer Sciences",
      "description": "The paper describes an approach for creation of effective test automation technology for industrial software projects based on a formal model of the system under test, performing its automatic symbolic verification of the model and generation of symbolic traces, then their automatic concretization, generation and execution of test suites. The technology includes means for test results analysis and tests correction and update. High quality of software products is ensured by a balance between static (verification) and dynamic (testing) analysis techniques starting from the earlier development phases and through automation of all phases of software development. Special emphasis is made on presentation of the algorithm of concretization and configuring test scenarios. © Allerton Press, Inc., 2013.",
      "citedby_count": 8,
      "authkeywords": "Predicate transformer | Software quality | Symbolic verification | Test automation | Test scenarios concretization",
      " aggregationType": "Journal",
      " issn": "01464116"
    },
    {
      "eid": "2-s2.0-84923624854",
      "title": "SMSV Foreword",
      "author_count": "3",
      "author_names": "Peschanenko, Vladimir;Nikitchenko, Mykola;Strecker, Martin",
      "author_ids": "36190302600;6602842336;15221675700",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84923615003",
      "title": "Specializations and symbolic modeling",
      "author_count": "3",
      "author_names": "Peschanenko, Vladimir;Guba, Anton;Shushpanov, Constantin",
      "author_ids": "36190302600;56035067600;56289710300",
      "author_afids": "60010672;60068509;114539766",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "We present the technique that allows splitting first-order logic formulae into parts which helps to use the special algorithms of satisfiability checking and predicate transformer, which are the specializations. We describe the mathematical description of the algorithm of the constructing specializations and a few particular approaches to them, which speed up modeling of industrial models. We prove the correctness of satisfiability and predicate transformer functions. We consider forward and backward applicability of basic protocols during symbolic modeling and verification We introduce the examples for each specialization. We provide the experiments with typical real examples.",
      "citedby_count": 0,
      "authkeywords": "Predicate transformer | Satisfiability | Symbolic modeling",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84923605886",
      "title": "Preface",
      "author_count": "9",
      "author_names": "Ermolayev, Vadim;Mayr, Heinrich C.;Nikitchenko, Mykola;Spivakovskiy, Aleksander;Zholtkevych, Grygoriy;Zavileysky, Mikhail;Kravtsov, Hennadiy;Kobets, Vitaliy;Peschanenko, Vladimir",
      "author_ids": "13104107100;7103006723;6602842336;16431204200;55557328000;55965708200;55780812100;56006224700;36190302600",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84904745245",
      "title": "Specializations in Symbolic Verification",
      "author_count": "3",
      "author_names": "Peschanenko, Vladimir;Guba, Anton;Shushpanov, Constantin",
      "author_ids": "36190302600;56035067600;56289710300",
      "author_afids": "60010672;60068509;114539766",
      "publicationName": "Communications in Computer and Information Science",
      "description": "We present the technique that allows splitting first-order logic formulae into parts which helps to use the special algorithms of satisfiability checking and predicate transformer, which are the specializations. We describe the mathematical description of the algorithm of the constructing specializations. We prove the correctness of satisfiability and predicate transformer functions. We consider forward and backward applicability of basic protocols during symbolic modeling and verification. We introduce the examples for each specialization. We provide the experiments with typical real examples. © Springer International Publishing Switzerland 2013.",
      "citedby_count": 1,
      "authkeywords": "predicate transformer | satisfiability | Symbolic modeling",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-84893953196",
      "title": "Invariants in symbolic modeling and verification of requirements",
      "author_count": "6",
      "author_names": "Letichevsky, Alexander;Godlevsky, Alexander;Guba, Anton;Kolchin, Alexander;Letychevskyi, Oleksandr;Peschanenko, Vladimir",
      "author_ids": "35357916400;14826396900;56035067600;56371355000;55557358400;36190302600",
      "author_afids": "60068509;60068509;60068509;60068509;60068509;60010672",
      "publicationName": "CSIT 2013 - 9th International Conference on Computer Science and Information Technologies, Revised Selected Papers",
      "description": "The paper presents the usage of invariants technique for symbolic modeling and verification of requirements for reactive systems. It includes checking of the safety, completeness, liveness, and consistency properties, deadlocks and livelocks detection. The paper describes the iterative method of double approximation and the method of undetermined coefficients for invariants generation. Benefits, disadvantages and comparison of this technique with existing methods are considered. The paper is illustrated by examples of invariants technique usage for symbolic verification. © 2013 IEEE.",
      "citedby_count": 3,
      "authkeywords": "basic protocols | Invariants | lower and upper approximation | requirements | symbolic modeling | verification",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-84872389887",
      "title": "About one efficient algorithm for reachability checking in modeling and its implementation",
      "author_count": "3",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Olexander;Peschanenko, Vladimir",
      "author_ids": "35357916400;55557358400;36190302600",
      "author_afids": "60068509;60068509;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The problem of reachability of states of transition systems is considered hereby. The notions of partial unfolding and permutability of two operators (including the notion of statically permutable operators) are presented. New algorithm for reachability problem in terms of insertion modeling, and implementation of this algorithm are described. An example of application of the proposed algorithm is considered. © 2013 Springer-Verlag Berlin Heidelberg.",
      "citedby_count": 1,
      "authkeywords": "insertion modeling | interleaving | reachability | verification",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-84875758966",
      "title": "Trapezoid method for solving systems of linear inequalities and its implementation in insertion modeling",
      "author_count": "2",
      "author_names": "Lvov, M. S.;Peschanenko, V. S.",
      "author_ids": "35772818200;36190302600",
      "author_afids": "60010672;60010672",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "A new method for solving systems of linear inequalities (trapezoid method) is developed. The method involves constructing canonical forms of a system of linear inequalities. Canonical forms represent a partition of the convex polyhedron of solutions of the system into a union of disjoint trapezoids. The result of using this method is a set of basis vectors of the polyhedron of solutions. An insertion model of the algorithm is presented. © 2012 Springer Science+Business Media New York.",
      "citedby_count": 2,
      "authkeywords": "algebraic programming | insertion modeling | modeling system IMS | system of linear inequalities",
      " aggregationType": "Journal",
      " issn": "10600396"
    },
    {
      "eid": "2-s2.0-84862106910",
      "title": "Insertion modeling system",
      "author_count": "3",
      "author_names": "Letichevsky, Alexander A.;Letychevskyi, Olexandr A.;Peschanenko, Vladimir S.",
      "author_ids": "35357916400;55557358400;36190302600",
      "author_afids": "60068509;60068509;60010672",
      "publicationName": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
      "description": "The paper relates to practical aspects of insertion modeling. Insertion modeling system is an environment for the development of insertion machines, used to represent insertion models of distributed systems. The architecture of insertion machines and insertion modeling system IMS is presented. Insertion machine for program verification is specified as an example, and as a starting point of 'verifiable programming' project. © 2012 Springer-Verlag Berlin Heidelberg.",
      "citedby_count": 16,
      "authkeywords": null,
      " aggregationType": "Book Series",
      " issn": "03029743"
    },
    {
      "eid": "2-s2.0-84892598822",
      "title": "Foreword",
      "author_count": "3",
      "author_names": "Strecker, Martin;Nikitchenko, Mykola;Peschanenko, Vladimir",
      "author_ids": "15221675700;6602842336;36190302600",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84892594714",
      "title": "Efficient algorithm for reachability checking in modeling",
      "author_count": "3",
      "author_names": "Letichevsky, Alexander;Letychevskyi, Olexander;Peschanenko, Vladimir",
      "author_ids": "35357916400;55557358400;36190302600",
      "author_afids": "60068509;60068509;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The problem of reachability of the states of transition systems is considered hereby. The notions of partial unfolding and permutability of two operators (including the notion of statically permutable operators) are presented. New algorithm for reachability problem in terms of insertion modeling is described. An example of application of such algorithm is considered.",
      "citedby_count": 0,
      "authkeywords": "Insertion modeling | Interleaving | Introduction | Reachability | Verification",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84890407163",
      "title": "Insertion modeling system and constraint programming",
      "author_count": "5",
      "author_names": "Letichevsky, Alexander A.;A.letychevskyi, Olexander;Peschanenko, Vladimir S.;Blynov, Igor O.;Klionov, Dmitry M.",
      "author_ids": "35357916400;55966134200;36190302600;55964562700;55965109600",
      "author_afids": "60068509;60068509;60010672;60010672;",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The paper relates to practical aspects of insertion modeling. Insertion modeling system is an environment for the development of insertion machines, used to represent insertion models of distributed systems. The architecture of insertion machines and insertion modeling system IMS is presented. Insertion machine for constraint programming is specified as an example, and as a starting point of 'verifiable programming' project.",
      "citedby_count": 3,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-77956185310",
      "title": "Properties of a predicate transformer of the VRS system",
      "author_count": "5",
      "author_names": "Letichevsky, A. A.;Godlevsky, A. B.;Letychevsky, A. A.;Potiyenko, S. V.;Peschanenko, V. S.",
      "author_ids": "35357916400;14826396900;55557358400;36190073400;36190302600",
      "author_afids": "60068509;60068509;60068509;60068509;60010672",
      "publicationName": "Cybernetics and Systems Analysis",
      "description": "Models specified in the language of basic protocols are considered. These models are attribute transition systems, their states are defined by formulas of multisort first-order predicate calculus over system attributes. Attributes of simple numeric and symbolic types, functional types, queues are allowed. Assignment operators, queue update operators, arbitrary formulas are used in postconditions of basic protocols. To pass from one state to another, a predicate transformer is constructed as a function of formula transformation. The following main property of the predicate transformer is proved: it calculates the strongest postcondition for symbolic states. © 2010 Springer Science+Business Media, Inc.",
      "citedby_count": 7,
      "authkeywords": "abstraction | symbolic modeling | verification",
      " aggregationType": "Journal",
      " issn": "10600396"
    }
  ]
}