{
  "author": {
    "author_id": 56006224700,
    "url": "https://www.scopus.com/authid/detail.uri?partnerID=HzOxMe3b&authorId=56006224700&origin=inward",
    "name": "Kobets Vitaliy M.",
    "affiliation": "Kherson State University",
    "document_count": 68,
    "h_index": 10,
    "citation_count": 322,
    "areas": [
      [
        "Computer Vision and Pattern Recognition",
        "COMP",
        1707
      ],
      [
        "Industrial and Manufacturing Engineering",
        "ENGI",
        2209
      ],
      [
        "Media Technology",
        "ENGI",
        2214
      ],
      [
        "Business and International Management",
        "BUSI",
        1403
      ],
      [
        "Information Systems",
        "COMP",
        1710
      ],
      [
        "Materials Science (miscellaneous)",
        "MATE",
        2501
      ],
      [
        "Management of Technology and Innovation",
        "BUSI",
        1405
      ],
      [
        "History",
        "ARTS",
        1202
      ],
      [
        "Mechanical Engineering",
        "ENGI",
        2210
      ],
      [
        "Management Science and Operations Research",
        "DECI",
        1803
      ],
      [
        "Statistics and Probability",
        "MATH",
        2613
      ],
      [
        "Economics and Econometrics",
        "ECON",
        2002
      ],
      [
        "Control and Systems Engineering",
        "ENGI",
        2207
      ],
      [
        "Aerospace Engineering",
        "ENGI",
        2202
      ],
      [
        "Computer Science Applications",
        "COMP",
        1706
      ],
      [
        "Automotive Engineering",
        "ENGI",
        2203
      ],
      [
        "Management Information Systems",
        "BUSI",
        1404
      ],
      [
        "Law",
        "SOCI",
        3308
      ],
      [
        "Economics, Econometrics and Finance (all)",
        "ECON",
        2000
      ],
      [
        "Computer Science (all)",
        "COMP",
        1700
      ],
      [
        "Modeling and Simulation",
        "MATH",
        2611
      ],
      [
        "Mathematics (all)",
        "MATH",
        2600
      ],
      [
        "Information Systems and Management",
        "DECI",
        1802
      ],
      [
        "Engineering (miscellaneous)",
        "ENGI",
        2201
      ],
      [
        "Electrical and Electronic Engineering",
        "ENGI",
        2208
      ],
      [
        "Safety, Risk, Reliability and Quality",
        "ENGI",
        2213
      ],
      [
        "Fluid Flow and Transfer Processes",
        "CENG",
        1507
      ],
      [
        "Statistics, Probability and Uncertainty",
        "DECI",
        1804
      ],
      [
        "Applied Mathematics",
        "MATH",
        2604
      ],
      [
        "Computer Networks and Communications",
        "COMP",
        1705
      ]
    ]
  },
  "publications": [
    {
      "eid": "2-s2.0-85176337236",
      "title": "Control of the Pivot Point Position of a Conventional Single- Screw Vessel",
      "author_count": "6",
      "author_names": "Kobets, Vitaliy;Popovych, Ihor;Zinchenko, Serhii;Nosov, Pavlo;Tovstokoryi, Oleh;Kyrychenko, Kostiantyn",
      "author_ids": "56006224700;57208214862;57214802895;57211927353;57226546928;57210016776",
      "author_afids": "60010672;60010672;60117518;60117518;60117518;60117518",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The issues of using the pivot point concept for the control of a conventional single-screw vessel are considered. The relevance of the task lies in the need for a more accurate assessment of the vessel’s trajectory and the necessary area for maneuvering, since conventional single-screw vessels have low maneuverability, and their share in the total number of vessels exceeds 85%. For manual maneuvering of the vessel, using the pivot point, it is important to know the position of the pivot point relative to a fixed point of the vessel’s hull. Traditionally, this point was the gravity center/middle frame of the vessel. The disadvantage of the existing approaches to the calculation of the pivot point position was the use of a simplified calculation scheme “gravity center - pivot point”, which did not take into account the dependence of the pivot point position on the rotation center position. In previous works, the authors of this article proposed the “gravity center - rotation center - pivot point” calculation scheme, which made it possible to more accurately estimate the pivot point position, taking into account the position of the rotation center. In the refined scheme proposed by the author, the pivot point position was determined relative to the moving rotation center, which is not convenient for manual control. In this article, for a single-screw conventional vessel, a formula and graphs of pivot point position relative to a fixed point on the vessel’s hull (gravity center/middle frame) are obtained, for the refined calculation scheme “gravity center - rotation center - pivot point”. The obtained formulas and graphs of the pivot point position relative to a fix point (gravity center/middle frame) allow us to use them both for automatic and manual control of the vessel’s movement. Mathematical modeling of a single-screw conventional vessel movement in the closed circuit “Control object - Control system” was carried out for the two considered calculation schemes. The simulation results showed that the use of the refined calculation schem allows for a 23% more accurate assessment of the vessel’s trajectory and the required maneuvering area.",
      "citedby_count": 0,
      "authkeywords": "automated system | center of rotation | human factor | maneuvering area | Navigation safety | pivot point",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85174492555",
      "title": "Creating of a General Purpose Language for the Construction of Dynamic Reports",
      "author_count": "3",
      "author_names": "Iatsiuta, Vlad;Kobets, Vitaliy;Ivanov, Oleksii",
      "author_ids": "58656342100;56006224700;57202445400",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "Lecture Notes in Business Information Processing",
      "description": "In digital environment, generating reports is an integral part of any business, and therefore there is a huge need for a tool for creating complex adaptive reports in investment, marketing activities, financial projects etc. The purpose of the paper is to formulate the requirements for GPL for the creation of custom reports in different business areas and build a software product that will use it. We have researched the possibilities of creating a universal language for building complex reports that is flexible enough to be used in any business domain. We have also identified the main requirements for such a language and the software product that would utilize it. We have paid particular attention to the peculiarities and problems associated with the creation and use of such a language, and have proposed ways to address them. As an experiment, we have created a prototype software module using a language based on mathematical formulas. The developed module can be used both for reports and for any calculations of companies engaged in product and business analytics.",
      "citedby_count": 0,
      "authkeywords": "Calculations | Domain-Specific Language | General-Purpose Language | Report | Software Module",
      " aggregationType": "Book Series",
      " issn": "18651348"
    },
    {
      "eid": "2-s2.0-85163098601",
      "title": "Intelligent System Control of the Vessel Executive Devices Redundant Structure",
      "author_count": "5",
      "author_names": "Zinchenko, Serhii;Kobets, Vitaliy;Tovstokoryi, Oleh;Nosov, Pavlo;Popovych, Ihor",
      "author_ids": "57214802895;56006224700;57226546928;57211927353;57208214862",
      "author_afids": "60117518;60010672;60117518;60117518;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The article examines the issues of optimal control of vessels with redundant structures of executive devices on the example of an offshore vessel with two stern azimuth control devices (ACD) and a bow thruster. Known technical solutions for optimal control of redundant structures in the aviation, space, marine and other industries. The nearest technical solutions in the shipping are dynamic positioning systems (DP-systems) of manufacturers Navis, Marine Technologies, Rolls Royce, Transas, Consberg. The main purpose of such systems is to maintain the vessel in a given position with the help of active control during work (drilling, cable laying, cargo overloading, etc.). The main components of DP-systems are: sensors for measuring the absolute and relative position of the vessel (DGPS and Reference Systems), on-board computer with software and redundant structures of executive devices. Redundant structures in DP-systems are used to increase the reliability of the automated system. The article developed a method of using redundant structures also for optimization of control processes. The purpose of the work is to automate and optimize the processes of controling vessels with redundant structures of executive devices. On the example offshore vessel with two stern ACD and a bow thruster, optimal controls are considered that ensure: minimum energy consumption for performing DP operations, maximum control forces in the channels of longitudinal and lateral movement, which are used to move away from the platform in the presence of a downwind, as well as reconfiguration of redundant structures. The results of the experiment showed that the optimization of control processes allows to reduce energy consumption by (35–50) % and increase the control forces of the structure in the channels of longitudinal and lateral movement. At the same time, the additional load on the calculation cycle of the on-board controller, caused by the solution of optimization problems, is 25–50 ms, which is within (2.5–5) %.",
      "citedby_count": 1,
      "authkeywords": "aim function | Intelligent system | mathematical modeling | optimal control | redundant structure",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85150269094",
      "title": "IDENTIFICATION OF FACTORS FOR PROVIDING THE HIGHER EDUCATION QUALITY ASSURANCE FOR STUDENTS",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Osypova, Nataliia V.",
      "author_ids": "56006224700;58145559800",
      "author_afids": "60010672;123125471",
      "publicationName": "International Journal for Quality Research",
      "description": "The goal of this paper is to estimate the factors for providing the higher education quality assurance for students through ICT and to increase motivation of students to learn the disciplines. European Foundation for Quality Management Excellence Model helps to develop business process for quality assurance. At the same time, ADKAR (Awareness, Desire, Knowledge, Ability, Reinforcement) Model explains how to implement these changes. We estimated the impact of relevant factors on satisfactory level of students. Among the factors are duplications in the topics of disciplines, taking into account surveys for disciplines, transparency of evaluation criteria and feedback on students’ work. The model helps determine the individual impact of each relevant factor on quality assurance and to prepare recommendations from implementation to institutionalization phase for providing the higher education quality assurance for students through ICT",
      "citedby_count": 0,
      "authkeywords": "Academic integrity | Feedback | ICT | Institutionalization phase | Quality assurance",
      " aggregationType": "Journal",
      " issn": "18006450"
    },
    {
      "eid": "2-s2.0-85108781526",
      "title": "Market Dynamics of Ensuring Financial Security and Sustainable Development of Enterprise",
      "author_count": "3",
      "author_names": "Khrapkina, Valentina;Kobets, Vitaliy;Stratonov, Vasyl",
      "author_ids": "57217654558;56006224700;57208740189",
      "author_afids": "60024416;60010672;60010672",
      "publicationName": "Studies in Microeconomics",
      "description": "The paper substantiates the need to study the level of financial security of an enterprise. To study the dynamics of financial security of an enterprise we consider a system-dynamic model and simulation of distributed financial flows of a representative industrial enterprise under the impact of random factors, which reflect the threats affecting its financial security. Information on the financial statements of firms is often confidential, which leads to the need to develop a simulation model of a firm’s activities and to conduct experimental research based on the enterprise’s size and reserve fund ensuring its financial security. During simulation experiments, three scenarios for metallurgical enterprise (pessimistic scenario, optimistic scenario and most probable scenario) were investigated, and it was established that for at least half of the cases, an enterprise needs to form a reserve fund to maintain autonomous operations and ensure the necessary level of financial security. JEL Classifications: C1, C9, D33",
      "citedby_count": 3,
      "authkeywords": "cash flow | current assets | Financial security | financial stability | simulation model of enterprise",
      " aggregationType": "Journal",
      " issn": "23210222"
    },
    {
      "eid": "2-s2.0-85170213837",
      "title": "EVALUATION OF INVESTMENT PORTFOLIO BY APPLICATION OF MULTI-CRITERIA DECISION MAKING METHODS USING ROBO-ADVISOR",
      "author_count": "1",
      "author_names": "Kobets, Vitaliy",
      "author_ids": "56006224700",
      "author_afids": "60010672",
      "publicationName": "Proceedings on Engineering Sciences",
      "description": "Paper describes the creation of algorithm for automated assessment of investment portfolio attractiveness. Portfolios selection procedure (algorithm) are considered. Comparison of multiple criteria evaluation methods and comparison of the prioritization ranking of different investment projects (portfolios) following changes to the requirement weights are introduced. Evolving of robo-advisor systems for portfolio management is described. Research goal is development of algorithm for automated assessment of investment attractiveness of portfolios using investment criteria. Ex-ante (predict) and ex-post (assess) evaluation are compered for project evaluation. Research methods include algorithms for assessing the investment attractiveness of portfolios using finance criteria. To integrate these criteria scoring system for selection of investment portfolios was implemented with transformation model from quantitative criteria to qualitative ones. Scoring method was applied for different investment portfolios with cryptocurrencies to choose most attractive for investors.",
      "citedby_count": 0,
      "authkeywords": "Algorithm | Investment attractiveness criteria | Investment portfolio | Risk assessment | Robo-advisor | Scoring method",
      " aggregationType": "Journal",
      " issn": "26202832"
    },
    {
      "eid": "2-s2.0-85149390750",
      "title": "Building an Optimal Investment Portfolio with Python Machine Learning Tools",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Savchenko, Serhii",
      "author_ids": "56006224700;57741626400",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "We have researched how machine-learning techniques can be applied in software tools for personal investment portfolio planning. This paper contains a brief overview of different types of machine learning algorithms and a description of the mathematical model used to build the optimal investment portfolio. The newly demanded and not implemented feature of Fintech software tools for personal investments (such as Robo-Advisor) is to forecast rates of financial instruments to quickly rebalance the structure of investment portfolio to increase potential income and decrease losses of investors. The price forecasting methods proposed in the paper can be used for this feature. During the experimental part of our research, we implemented a software tool that builds an optimal investment portfolio using price predictions created by LSTM neural network and linear regression method. The results were compared to a portfolio built using only historical data on financial instruments price. The research shows that using LSTM neural network forecasted values allows building better investment portfolios even during the global stock market recession.",
      "citedby_count": 0,
      "authkeywords": "Automated Financial Software | Investment Portfolio | Machine Learning | Robo-Advisor",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85145238528",
      "title": "Development of Software Architecture and Machine Learning Modules of Robo-Advisor System for Personalized Investment Portfolio Generation",
      "author_count": "2",
      "author_names": "Savchenko, Serhii;Kobets, Vitaliy",
      "author_ids": "57741626400;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "We researched how to use financial technology in the finance industry on the example of robo-advisors; defined the basic functionality of a robo-advisor; got the robo-advisors implementation based on analysis of the most popular financial services. We compared their functions, composed a list of critical features and described the high-level architectural design of a general robo-advisor tool, scope of using robo-advisors, their key features, and a brief overview of existing solutions. Using Markowitz model, we set up a concept of using a robo-advisor by investors who have different attitudes towards risks. Our goal is to cover the main features of financial robo-advisor and to describe a high-level architecture for such applications using prediction of financial instruments rates to rebalance investment portfolio. We have defined the main modules that represent the architecture of a typical robo-advisor. We also described different techniques, which could be applied building a personalized investment portfolio. We considered ARIMA models to predict stock prices. The experimental part demonstrates how to use LSTM neural networks and multiple linear regression techniques in the scope of the Robo-Advisor profitability-forecasting module.",
      "citedby_count": 0,
      "authkeywords": "ARIMA | Financial instruments | Investment portfolio | Markowitz model | Neural networks | Robo-advisor",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85145211287",
      "title": "Sustainable Robo-Advisor Bot and Investment Advice-Taking Behavior",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Petrov, Oleksandr;Koval, Svitlana",
      "author_ids": "56006224700;58036299700;57226132795",
      "author_afids": "60010672;60010672;60117186",
      "publicationName": "Lecture Notes in Business Information Processing",
      "description": "One of the main reasons why people use robo-advisors is that the traditional financial instruments (e. g. deposits, bonds) will promise zero returns in the near future. Robo-advisors using built-in algorithms to determine the assets of investment portfolios for short-run and long-run periods will be one of the promising options for the investor to obtain income in order to achieve his/her goals. Live Trading bots will be able to provide substantial passive in-come for investors, that is an attractive alternative, compared to the advice of traditional human advisors. The goal of this paper is to develop a robo-advisor bot to make investment decisions in order to choose the best financial instruments considering risk-return criterion using different investment strategies. The paper deals with the models of robo-advisor bot for different risk attitudes of investors. Each investor can choose among different investment strategies, such as buy-and-hold strategy, moving average strategy, relative strength index strategy, support and resistance strategy with different performance measures. All strategies dealing with risk-return criterion for precious metals demonstrate the greatest efficiency for risk-averse investors. RSI (relative strength index), buy-and-hold strategies are also effective for Netflix shares. Oil and cryptocurrencies are most appropriate for different strategies of risk-seeking investors. Tesla stock is the most appropriate for risk-neutral investors under definite period.",
      "citedby_count": 1,
      "authkeywords": "Financial instruments | Investment strategy | Risk-return criterion | Robo-advisor bot",
      " aggregationType": "Book Series",
      " issn": "18651348"
    },
    {
      "eid": "2-s2.0-85138837177",
      "title": "The Development of Investment Projects Attractiveness Assessment Software",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Berehovyi, Oleksandr",
      "author_ids": "56006224700;57907154700",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "Paper describes the creation of software for automated assessment of projects’ investment attractiveness. Research goal is development of software for automated assessment of investment attractiveness of projects using investment criteria. Research methods include algorithms for assessing the investment attractiveness of projects using defined criteria, software development on the BAS ERP platform using finance criteria. To integrate these criteria scoring system for selection of investment projects was implemented. Comparative analysis of the software for assessing the investment effectiveness of projects was carried out, the main criteria of assessing the investment attractiveness of projects were determined, and a software tool for automated analysis of the investment attractiveness of projects was developed to evaluate different projects taking into account definite criteria.",
      "citedby_count": 0,
      "authkeywords": "Algorithm | Investment attractiveness criteria | Project assessment | Scoring method | Software tools",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85138827972",
      "title": "Preface",
      "author_count": "9",
      "author_names": "Ignatenko, Oleksii;Kharchenko, Vyacheslav;Kobets, Vitaliy;Kravtsov, Hennadiy;Tarasich, Yuliia;Ermolayev, Vadim;Esteban, David;Yakovyna, Vitaliy;Spivakovsky, Aleksandr",
      "author_ids": "7006719813;22034616000;56006224700;55780812100;56436890300;13104107100;57383550600;6602569305;16431204200",
      "author_afids": "100562297;60068522;60010672;60010672;60010672;60070109;127394059;60024421;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85138763870",
      "title": "Automated Forming of Insurance Premium for Different Risk Attitude Investment Portfolio Using Robo-Advisor",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Popovych, Ihor",
      "author_ids": "56006224700;56667169600;57208214862",
      "author_afids": "60010672;60023137;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The volume of private investment is growing steadily nowadays. In this case, it is crucial to analyze investors’ behaviour, decision-making factors and the specifics of their investment portfolio formation and especially their cognitive constraints, which prevent them from effectively defining investment goals and profitable achieving them. This research shows that investors, even experienced and financially literate, often make significant mistakes when creating their own investment portfolios. Thus, the use of automated tools for determining the insurance premium and the optimal investment portfolio, which is a robo-adviser, becomes relevant. The paper presents the model for estimating personal insurance premium for different risk attitude investment portfolios using robo-advisor. Three types of investors are analyzed: conservative, aggressive, and moderately aggressive. The model helps determine the individual size of the insurance premium for each investor profile, taking into account his or her risk attitude.",
      "citedby_count": 1,
      "authkeywords": "Insurance premium | Investment portfolio | Risk attitude | Robo-advisor",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85138759000",
      "title": "Development of Robo-Advisor System for Personalized Investment and Insurance Portfolio Generation",
      "author_count": "2",
      "author_names": "Savchenko, Serhii;Kobets, Vitaliy",
      "author_ids": "57741626400;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "We researched how to use financial technology in the finance industry on the example of robo-advisors; defined the basic functionality of robo-advisor; got the robo-advisors implementation based on analysis of the most popular financial services. We compared their functionality, composed a list of critical features and described the high-level architectural design of a general robo-advisor tool, scope of application of robo-advisors, their key features, and a brief overview of existing solutions. Using Markowitz model, we set up a concept of a robo-advisor application for investors who have different attitudes towards risks. Our goal is to cover the main features of financial robo-advisor and to describe a high-level architecture for such applications. We have defined the main modules that represent the architecture of a typical robo-advisor. We also described different techniques, which could be applied for building a personalized investment and insurance portfolio.",
      "citedby_count": 3,
      "authkeywords": "Financial instruments | Investment portfolio | Markowitz model | Robo-advisor",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85131957452",
      "title": "Using Telegram Bots for Personalized Financial Advice for Staff of Manufacturing Engineering Enterprises",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Savchenko, Serhii",
      "author_ids": "56006224700;57741626400",
      "author_afids": "60010672;60010672",
      "publicationName": "Lecture Notes in Mechanical Engineering",
      "description": "This paper covers the research on using instant messengers’ chatbots to provide automated financial advice to manufacturing engineering enterprises employees in the scope of a chatbot application, which helps to calculate personal savings programs to ensure a constant level of consumption. The paper aims to develop telegram bots for personalized financial advice of manufacturing engineering enterprises staff. The application uses a model of life-cycle hypothesis and generates a customized saving plan based on the information provided by a user. The factors affecting decisions regarding advice include previous satisfaction with decision-making, investors’ preferences, perceived difficulty, the relationship between financial literacy, expertise, and confidence. Different approaches to developing messengers’ bots have been compared. The paper also gives a brief overview of the life-cycle approach, which suggests that finance managers plan consumption and savings behavior over the whole life cycle of their personnel. The research is focused on the Telegram platform and includes an overview of Telegram Bot API and the process of chatbot development using Java programming language.",
      "citedby_count": 0,
      "authkeywords": "Chatbot | Instant messenger | Life-cycle analysis | Savings plan",
      " aggregationType": "Book Series",
      " issn": "21954356"
    },
    {
      "eid": "2-s2.0-85124880309",
      "title": "Development of an electronic system for remote assessment of students' knowledge in cloud-based learning environment",
      "author_count": "3",
      "author_names": "Sherman, Mykhailo I.;Samchynska, Yaroslava B.;Kobets, Vitaliy M.",
      "author_ids": "7402148245;54973675000;56006224700",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The system for remote assessment of knowledge automates formation of task (tickets) with questions and tasks for conducting intermediate and final monitoring of knowledge of students is offered. In the process of developing an electronic system for knowledge assessment, the basic requirements for a web application and the modules that the system consists of were determined, the main roles of users in the system and their functionality were identified, access rights were established. The technical, functional, and non-functional features of the software product are described, web technologies for creating an application for knowledge assessment are considered. The diagram of system sequences, the use-case diagram, which schematically describing roles and functions of agents in an information system, the diagram of classes of a database structure are presented with UML description. Based on the defined requirements for the resource in cloud-based learning environment, the following technologies for its development were chosen: the server programming language PHP, JavaScript programming language and its libraries were used, as well as the MySQL database with PhpMyAdmin tool for administration of chosen database management system. OpenServer software complex system was used to develop and test the application functionality. The usage of the proposed electronic assessment system of knowledge contributes to the formation of an open information and cloud-based learning environment of a modern educational institution, enhances the efficiency and more rational distribution of teacher time in preparing tests or exams, activates repetition of educational material and knowledge assimilation, indirectly motivates students to more honest learning.",
      "citedby_count": 4,
      "authkeywords": "Distance learning | E-Assessment | Knowledge assessment | Monitoring of knowledge | Web application",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85112640977",
      "title": "A Model for Assessing the Rating of Higher Education School Academic Staff Members Based on the Fuzzy Inference System",
      "author_count": "4",
      "author_names": "Babichev, Sergii;Spivakovsky, Aleksander;Omelchuk, Serhii;Kobets, Vitaliy",
      "author_ids": "57189091127;16431204200;57226773564;56006224700",
      "author_afids": "60027307-60010672;60010672;60010672;60010672",
      "publicationName": "Lecture Notes on Data Engineering and Communications Technologies",
      "description": "In this paper, we present the model of assessment of higher education school academic staff members rating based on the complex use of Harrington’s desirability function and a fuzzy inference system. Four main directions of activity were evaluated within the framework of the proposed model: pedagogical activity; science and research; organization activity and other activity types. Each of the proposed types of activities was assessed separately using the Harrington desirability function based on prior determined scores, where the general activity index of the appropriate score was calculated as the weighted average of the private desirability values. The Mamdani inference algorithm with triangular and trapezoidal membership functions was used within the framework of the fuzzy inference process implementation to evaluate the general rating score of the appropriate academic staff member. The base of rules was proposed to form the output for general rating scores calculated based on the individual rating scores. The output of the system was presented for each of the appropriate activity types separately and based on the assessment of the general rating score that contained the separate rating scores as the components. To our best mind, the proposed model can help us to optimize the functional possibilities of higher school system operation.",
      "citedby_count": 1,
      "authkeywords": "Academic staff members’ rating score | Decision making | Fuzzy inference | Harrington desirability function | Higher education school | Mamdani inference algorithm | Membership functions",
      " aggregationType": "Book Series",
      " issn": "23674512"
    },
    {
      "eid": "2-s2.0-85112614869",
      "title": "Solution of the Problem of Optimizing Route with Using the Risk Criterion",
      "author_count": "5",
      "author_names": "Mamenko, Pavlo;Zinchenko, Serhii;Kobets, Vitaliy;Nosov, Pavlo;Popovych, Ihor",
      "author_ids": "57223971319;57214802895;56006224700;57211927353;57208214862",
      "author_afids": "60117518;60117518;60010672;60117518;60010672",
      "publicationName": "Lecture Notes on Data Engineering and Communications Technologies",
      "description": "The aim of the work is to determine the conditions of optimality in the task of plotting the course of the vessel and the operation of divergence of vessels in conditions of intensive navigation. The need for such work is dictated, firstly, by an increase in the intensity of shipping and, secondly, by the emergence of autonomous ships and transport systems, the traffic control algorithms of which obviously require an optimal approach. The criterion of optimality in problems of this class is the expected risk, one of the components of which is the risk of collision of ships. Based on the analysis of methods for constructing ship divergence algorithms, the task is to find a control algorithm that delivers the best results for all participants in the operation. This formulation of the task greatly facilitates the forecast of the actions of all participants in the discrepancy and is especially expedient in the case of participation in the operation of an autonomous system or a ship with which no contact has been established. Theoretically, the task belongs to the most difficult class of control problems - optimal control of a distributed dynamic system with a vector - a goal functional [3, 5, 8, 13–15]. The ability to obtain a general solution to the task of optimal ship control makes this study expedient.",
      "citedby_count": 30,
      "authkeywords": "Avoid collision | Mathematical model | Optimal control | Risk criterion | Safe separation | Vector-functional",
      " aggregationType": "Book Series",
      " issn": "23674512"
    },
    {
      "eid": "2-s2.0-85116625746",
      "title": "Spatial Models of Countries Economic Development under Pandemic Condition",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Pilshchyk, Elizaveta;Mykhaylova, Valentyna",
      "author_ids": "56006224700;57288535400;57219922652",
      "author_afids": "60010672;100338536;60010672",
      "publicationName": "2021 11th International Conference on Advanced Computer Information Technologies, ACIT 2021 - Proceedings",
      "description": "COVID-19 pandemic has strengthened the paternalistic state policy to protect its own interests; globalization is giving way to autonomous economic development of the world. The development of the world is beginning to depend more on neighboring countries than on the global economy. State decision-making on the future trajectory of economic development requires a balanced quantitative analysis of the explanation factors that have the greatest impact on economic development in the \"new reality\". The purpose of the work is to study the influence of the spatial location of countries on the level of their economic development in a pandemic. The processes of convergence and divergence of development of countries in a pandemic are analyzed. Different spatial models of countries' development are compared in terms of macroeconomic efficiency indicators. An econometric model of spatial development of European countries for forecasting the pace of economic development has been developed.",
      "citedby_count": 0,
      "authkeywords": "convergence | divergence | inequality | multifactor regression | spatial models",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85161960584",
      "title": "EU COUNTRIES CLUSTERING FOR THE STATE OF FOOD SECURITY USING MACHINE LEARNING TECHNIQUES",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Novak, Oleksandra",
      "author_ids": "56006224700;58316083100",
      "author_afids": "60010672;60023137",
      "publicationName": "Neuro-Fuzzy Modeling Techniques in Economics",
      "description": "The food security problem has emerged from the growing pressure of demographic problem and global inequality. Overall, the state of food security is optimal in the EU. This was achieved due to effective implementation of regulatory initiatives regarding EU countries food self-sufficiency and intra-EU food market protection. The purpose of the research paper was to cluster EU countries in terms of food security level using advanced mathematical modeling tools. To this end, we selected 5 food security factors (FAO Food production index, Total factor productivity in agriculture, Per capita agricultural expenditure, Consumer prices food, Net trade food index) to which we applied the following cluster analysis algorithms (self-organizing maps, dendrograms, k-means and k-medoids clustering). As a result of the conducted experimental research, it was found that self-organizing maps and dendrograms methods to be better suited for data visualization, whereas k-means and k-medoids give more accurate and detailed solutions. The obtained results gave us an opportunity to define the advantages and disadvantages of the selected clustering methods, as well as to present agripolicy recommendations for different groups of EU countries.",
      "citedby_count": 1,
      "authkeywords": "cluster analysis | food security | hierarchical clustering | k-means | k-medoids | self-organizing map",
      " aggregationType": "Journal",
      " issn": "23063289"
    },
    {
      "eid": "2-s2.0-85111787730",
      "title": "Bridging Business Analysts Competence Gaps: Labor Market Needs Versus Education Standards",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Buiak, Lesia",
      "author_ids": "56006224700;56667169600;57205435756",
      "author_afids": "60010672;60023137;60102163",
      "publicationName": "Communications in Computer and Information Science",
      "description": "Efficient human resource management needs accurate assessment and representation of available competencies as well as effective mapping of required competencies for specific jobs and positions. Thus, the definition and identification of competence gaps express differences between acquired and required competencies using a mathematical approach to support accurate competence analytics. Lack of skills and insufficient qualifications of employees are cited as major barriers to the adoption of new technologies in the context of Industry 4.0. These changes require skills for data analytics tasks. The purpose of this paper is to investigate gaps in the preparation of a business analyst between the requirements of the labor market and the standards of study programs. For the IT and other industries, the most important competencies from the study program of Ukrainian High Educational Institutes, which correspond to labor market requirements, were revealed using RStudio. Formation of business analysts’ competencies required in the labor market is created both higher education (47%) and experience of applicants on the labor market (53%).",
      "citedby_count": 3,
      "authkeywords": "Business analyst | Competencies | Complementarities of requirements | Educational standards | Generic and specific subject competencies | IT education | Soft and hard skills",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85110678562",
      "title": "Institutional Aspects of Integrated Quality Assurance of Engineering Study Programs at HEI Using ICT",
      "author_count": "4",
      "author_names": "Kobets, Vitaliy;Liubchenko, Vira;Popovych, Ihor;Koval, Svitlana",
      "author_ids": "56006224700;56667638800;57208214862;57226132795",
      "author_afids": "60010672;60008605;60010672;60117186",
      "publicationName": "Lecture Notes in Mechanical Engineering",
      "description": "Informatization of Ukrainian higher education institutions is a key priority of the state education policy, one of the directions to improve HEI’s IT infrastructure. The paper aims to develop an integrated quality assurance information system to enhance institutional aspects of higher education institutions’ study programs. Therefore, there is an urgent need for all stakeholders to develop, at the university level, a service-oriented architecture to assure the quality of higher education with mandatory elements, for example, student survey results, student ratings, university teachers’ rating, educational programs, results of uniqueness verification for scientific research and qualifying papers, review of educational programs for higher education applicants etc. It will allow to unify the approaches to electronic resource management and accelerate the integration of multi-level HEI quality assurance resources into a single portal. The paper presents a quality assurance information system, which allows processing students’ feedback to provide HEI’s authorities’ decision making.",
      "citedby_count": 28,
      "authkeywords": "Engineering study programs | Quality assurance management in HEI | Students’ feedback",
      " aggregationType": "Book Series",
      " issn": "21954356"
    },
    {
      "eid": "2-s2.0-85103247206",
      "title": "Institutional aspects of integrated quality assurance of study programs at HEI using ICT",
      "author_count": "4",
      "author_names": "Kobetsa, Vitaliy;Liubchenkob, Vira;Popovycha, Ihor;Kovalc, Svitlana",
      "author_ids": "56006224700;56667638800;57208214862;57226132795",
      "author_afids": "60010672;60008605;60010672;60117186",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Informatization of Ukrainian higher education institutions is a priority of the state educational policy, one of the directions of improving HEI's IT infra-structure. The paper aims to develop an integrated quality assurance infor-mation system to enhance institutional aspects of study programs at high ed-ucational institutes. Therefore, there is an urgent need to develop, at the uni-versity level, a standardized website structure designed to assure the quality of higher education with the identification of mandatory elements, for ex-ample, student survey results, rankings of students, lecturers staff, and edu-cational programs, results of verification of the uniqueness of scientific arti-cles and qualification works, review of educational programs for higher edu-cation applicants, e-library, electronic timetable, etc. This will allow us to unify approaches to electronic resource management and accelerate integrat-ing multi-level HEI elearning resources into a single portal. Paper presented developed quality assurance information system, which allows processing feedback of students for decision making of HEI's authorities.",
      "citedby_count": 30,
      "authkeywords": "Quality assurance management of HEI | Stu-dents' feedback | University management system",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85094143919",
      "title": "Models of Rental Payments Formation for Agricultural Land Plots Taking into Account the Ecological Level of Economy",
      "author_count": "6",
      "author_names": "Buiak, Lesia;Bashutska, Oksana;Pryshliak, Kateryna;Hryhorkiv, Vasyl;Hryhorkiv, Mariia;Kobets, Vitaliy",
      "author_ids": "57205435756;57205445241;57219594562;57199862936;57199860416;56006224700",
      "author_afids": "60102163;60102163;60102163;60102163;60102163;60010672",
      "publicationName": "2020 10th International Conference on Advanced Computer Information Technologies, ACIT 2020 - Proceedings",
      "description": "The article provides options for constructing a model for establishing rents for agricultural land. The process of optimizing the calculation of rent using economic and mathematical modeling is proposed. A general model of interaction between the tenant and the landowner is constructed. The econometric analysis of the rent in the Ternopil region is carried out. It is shown that the tenant and the owner adhere to myopic strategies in consequence of the insufficient level of economic institution development. Basis of short and long-term fiscal characteristics is calculated.",
      "citedby_count": 3,
      "authkeywords": "agricultural land | land relations | optimization | rent | rental payment",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85100898296",
      "title": "Mathematical support of the vessel information and risk control systems",
      "author_count": "6",
      "author_names": "Zinchenko, Serhii;Tovstokoryi, Captain Oleh;Nosov, Pavlo;Popovych, Ihor;Kobets, Vitaliy;Abramov, Gennadii",
      "author_ids": "57214802895;57226546928;57211927353;57208214862;56006224700;57221999910",
      "author_afids": "60117518;60117518;60117518;60010672;60010672;60117518",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The article discusses the issues of mathematical support of the Information and Risk Control System for the offshore vessel operating in high risk areas near oil or gas platforms, other large moving objects. Vessels operating in high-risk areas are equipped with dynamic positioning systems and excessive control, which allows to increase the reliability, maneuverability and quality of control. Minimally excessive control structure with two stern Azimuth Control Devices (ACD) is considered. This structure is the last “frontier” to provide three-dimensional vessel control, therefore it is interesting in practical use. The control surfaces for this structure were built, their extreme values and level lines were analyzed. To dispensation redundancy, three control splitting algorithms were considered, analytical expressions for control splitting were obtained. There was carried out a comparative analysis of the considered splitting algorithms between themselves and the prototype according to the minimum Risk - criterion. A comparative analysis showed that the splitting algorithm used in the prototype are special cases of the considered algorithms for dispensation redundancy. There were found controls that provide a “clean” rotation of the vessel without lateral force, which are not present in prototype. There were built control algorithms that provide complex vessel movements according to the minimum Risk - criterion in automatic mode. Operability and efficiency of the algorithmic and software of the vessel control system operating in high risk areas, verified by mathematical modeling at imitation modeling stand.",
      "citedby_count": 31,
      "authkeywords": "Control splitting | Excessive control | High-risk areas | Information and risk control system | Offshore vessel | Pivot point",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85100887566",
      "title": "Risk management with lean methodology",
      "author_count": "4",
      "author_names": "Komleva, Nataliia;Liubchenko, Vira;Zinovatna, Svitlana;Kobets, Vitaliy",
      "author_ids": "57191858904;56667638800;57219779480;56006224700",
      "author_afids": "60008605;60008605;60008605;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "In this paper, we propose to use the Lean Methodology to reduce losses due to the uncertainty of possible solutions during the execution of a process that results in a valuable product. According to the Lean principle of amplify learning, risk management is implemented using feedback from process participants in short time intervals. Each such interval is represented by a cycle with stages build-measure-learn; the reaction of process participants in the learning stage improves the build stage in the next iteration. We propose to perform a hierarchical decomposition of risks and introduce two categories of risks: final risk, which corresponds to losses due to uncertainty in the outcome of decisions, and indicated risk, which means the deviation of process characteristics from the planned normative values. Two types of characteristics are considered: observable characteristics, that can be directly measured when the increment is reached, and unobservable characteristics related to consumers’ perception of the increment and can be evaluated through surveys. The mechanism for evaluating individual characteristics of the process iteration, aggregating the critical values for all characteristics, and obtaining the indicated risk level based on them is proposed. Options for determining the final risks based on the obtained levels of indicated risks are proposed.",
      "citedby_count": 6,
      "authkeywords": "Decomposition of risks | Final risk | Indicated risk | Lean iterative process | Risk-based decision-making process",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85096149927",
      "title": "Identifying the gaps in the preparing of a business analyst between the requirements of the labor market and the standards of study programs: Case of Ukraine",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Buiak, Lesia",
      "author_ids": "56006224700;56667169600;57205435756",
      "author_afids": "60010672;60023137;60102163",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Efficient human resource management needs accurate assessment and representation of available competences as well as effective mapping of required competences for specific jobs and positions. Thus, definition and identification of competence gaps express differences between acquired and required competences using a mathematical approach to support accurate competence analytics. Lack of skills and insufficient qualifications of employees are cited as major barriers to the adoption of new technologies in the context of Industry 4.0. These changes require skills for data analytics tasks. The purpose of this paper is to investigate gaps in the preparing of a business analyst between the requirements of the labor market and the standards of study programs. For the IT and other industries, the most important competencies from study program of Ukrainian High Educational Institutes, which correspond to labor market requirements, were revealed using RStudio.",
      "citedby_count": 1,
      "authkeywords": "Business Analyst | Generic Competencies | IT Education | Study Programs | Subject Specific Competencies",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85096124292",
      "title": "Web-service management system for job search using competence-based approach",
      "author_count": "4",
      "author_names": "Kobets, Vitaliy;Tsiuriuta, Nikita;Lytvynenko, Valerii;Mykhaylova, Valentyna",
      "author_ids": "56006224700;57209262223;57209246238;57219922652",
      "author_afids": "60010672;60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Many different web services for job serching create opportunities for employers and employees, but only a few of them have a focus on IT specialists for firms in different industries. There is a demand on applicants with the required soft and specific subject competencies with minimal time expenditures. The purpose of the research is to develop the architecture of a web service managenent system for job search at firms using a competent approach according to the international standards of eCF. In present there is no analogue of our web-service management system for job searching using competence-based approach for both employers and employees. The architecture and technical tasks for the participants of our web-based job placement service were developed and described in our research. Web-service includes data which can help to estimate how specific subject competences, age and sex of employees impact on average wage for their vacancies using RStusio packages.",
      "citedby_count": 1,
      "authkeywords": "Data structure | ICT for education | Recruitment web-service | Required competences",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85096100643",
      "title": "Impact of the environmental externalities and technological progress on the stability of economic system development on the example of the ingulets river basin",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Shakhman, Iryna;Bystriantseva, Anastasiia",
      "author_ids": "56006224700;57198424698;57198431218",
      "author_afids": "60010672;60117186;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Our study demonstrates the introduction of a market-based mechanism for environmental management in conditions of a shortage of natural (water) resources. The purpose of this paper is to investigate the impact of environmental externalities and technological progress on the stability of economic system development. We considered a model of upstream and downstream firms with production negative externality, taking into account that producer pollutant and farm enterprise are situated along the Ingulets river. Experimental data and OLS method were used in this model. The results of the study and practical recommendations will allow participants of the technological process to respond quickly to changes in the state of the environment and make effective decisions aimed at ensuring the stability of the economic system and environmental safety. We found that enterprise's rate of technological development inspired by IT implementation has to be 0.28 times more than technological development of pollutant to save the stability of farm enterprise's output.",
      "citedby_count": 1,
      "authkeywords": "Enterprise stability | External environmental costs | IT capital | IT progress | Wastewater discharges | Water quality",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85096100239",
      "title": "Preface",
      "author_count": "9",
      "author_names": "Sokolov, Oleksandr;Zholtkevych, Grygoriy;Yakovyna, Vitaliy;Tarasich, Yulia;Kharchenko, Vyacheslav;Kobets, Vitaliy;Burov, Olexandr;Semerikov, Serhiy;Kravtsov, Hennadiy",
      "author_ids": "55134074800;55557328000;6602569305;56436890300;22034616000;56006224700;55190325000;56375008500;55780812100",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 3,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85095427647",
      "title": "Decision support system for quality management in learning process",
      "author_count": "4",
      "author_names": "Komleva, Nataliia;Liubchenko, Vira;Zinovatna, Svitlana;Kobets, Vitaliy",
      "author_ids": "57191858904;56667638800;57219779480;56006224700",
      "author_afids": "60008605;60008605;60008605;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The authors describe the design of a decision support system, which allows automating the works on extracting information from the survey results. The generalization of recent publications had confirmed the relevance of the primary purpose of the paper. The domain analysis determined what tasks the decision support system should solve. The results of domain analysis became the base for the requirements specification. Logical and process views represent the system architecture design. A denormalized data structure, which accelerates the acquisition of aggregated data in different dimensions, is developed. The system design provides the work with various data sources as well as incremental development of the decision support system.",
      "citedby_count": 3,
      "authkeywords": "Architectural Design | Data Structure | Decision Support System | Domain | Requirement Analysis",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85088496726",
      "title": "Data analysis of personalized investment decision making using robo-advisers",
      "author_count": "4",
      "author_names": "Kobets, V.;Yatsenko, V.;Mazur, A.;Zubrii, M.",
      "author_ids": "56006224700;56667169600;57202446486;57202444313",
      "author_afids": "60010672;60023137;60010672;60010672",
      "publicationName": "Science and Innovation",
      "description": "Introduction. Nowadays, the problem of the optimal balance between consumption and savings, transformed into investments is solved by using automated systems for making investment decisions, such as robo-advice services which have the mathematical algorithm based on the main principles of consumption-savings theories. Problem Statement. The task assignment of developed IT service is to maintain a constant level of client's consumption during life-long period through automated analysis of how much he/she has to consume and save each year. Results of consumption and savings proposals can be modified if initial financial data changes. Purpose. To develop investment plan of investors' profiles taking into account their risk preferences using data analysis of robo-adviser service. Materials and Methods. SWOT-analysis of robo-advice (RA) services and comparative characteristics of robo-advisers explain advantage of RA services. Microservice for calculating stable consumption, finance consulting model of robo-advisor to ensure a constant level of consumption for the client are developed using the following technologies: Python 3.6, Django 2.0, Django Rest framework, AngularJs, HTML5, CSS 3, Bootstrap. Results. We considered consumption-saving ratio in economics, emerging trends of robo-advice (RA) services for making investment decisions. A mathematical model of robo-advisor in long-run period was developed and the support of investment decision making was described using micro-service of robo-advisor. Conclusions. The development RA is intended primarily for private persons (investors) who invest in long-term financial instruments in order to provide them with a permanent passive income based on their chosen savings period and the moment of retirement.",
      "citedby_count": 6,
      "authkeywords": "Annuity | Data analysis | Long life decision making | Robo-advisor",
      " aggregationType": "Journal",
      " issn": "24099066"
    },
    {
      "eid": "2-s2.0-85079094124",
      "title": "Cluster Analysis of Countries Inequality Due to IT Development Through Macros Application",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Voynarenko, Mykhaylo",
      "author_ids": "56006224700;56667169600;56499392500",
      "author_afids": "60010672;60023137;60021463",
      "publicationName": "Communications in Computer and Information Science",
      "description": "Industry 4.0 is likely to be a way to reach both economic efficiency and social equity. Nevertheless, nobody can predict the social impact of Industry 4.0 on society, which transforms into Society 4.0. The purpose of this paper is to prepare cluster analysis of countries inequality due to IT development using software package and macros application. We researched impact of gross capital formation, research and development expenditure to create innovations, intellectual property and high-technology exports on inequality of countries using principal component analysis based on open data 2012–2015. Cluster analysis allows countries to be divided into homogeneous groups that describe the impact of IT development on these countries in the absence of training samples. An isotonic or isomorphic algorithm is used for cluster analysis. PCA method is used as an isotonic algorithm. The isomorphic algorithm includes in groups countries which are close in structure. We presented advantages of isomorphic algorithm versus isotonic one using Macros Application which give us necessary links between countries to develop dendrite diagram for clusters of countries under impact of IT factors. Thus we have received 7 clusters describing the diverse impact of IT factors on nonuniform income distribution across 45 countries. First group of clusters shows that IT factors motivates to decrease economic inequality. Second group of clusters demonstrate that IT factors lead to inequality. Third group of clusters presents that other factors (not IT factors) generate decreasing of inequality. Fourth group of clusters prove that other factors (not IT factors) generates expanding of inequality.",
      "citedby_count": 3,
      "authkeywords": "Cluster analysis | Industry 4.0 | Inequality | Isotonic and isomorphic algorithms | IT development | Macros application",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85067038865",
      "title": "Recruitment web-service management system using competence-based approach for manufacturing enterprises",
      "author_count": "5",
      "author_names": "Kobets, Vitaliy;Tsiuriuta, Nikita;Lytvynenko, Valerii;Novikov, Mykola;Chizhik, Sergey",
      "author_ids": "56006224700;57209262223;57209246238;57209251420;57209250036",
      "author_afids": "60010672;60010672;60010672;60010672;60010672",
      "publicationName": "Lecture Notes in Mechanical Engineering",
      "description": "Today there are many different web services for employment, but only a few of them have a focus on IT professionals for manufacturing enterprises. There is a need to select applicants with the required competencies with minimal time expenditures. The goal of the paper is to develop the architecture of a web service for the recruitment of employees at enterprises using a competent approach according to the international standards of eCF. In present there is no analogue of our recruitment web-service management system using competency-based approach for both manufacturing enterprises and employees. We prepared review and analysis the existing analogues of web-based job placement services, functional and non-functional requirements for web-based job placement for enterprises using competency approach. The high-level architecture and technical tasks for the participants of our web-based job placement service were also developed and described in our research. Data analysis of employers’ requirements was prepared for decision making of employee of manufacturing enterprises through software package.",
      "citedby_count": 2,
      "authkeywords": "Competences | Enterprises | ICT for education | Recruitment web-service",
      " aggregationType": "Book Series",
      " issn": "21954356"
    },
    {
      "eid": "2-s2.0-85143142933",
      "title": "INFLUENCE OF THE FOURTH INDUSTRIAL REVOLUTION ON DIVERGENCE AND CONVERGENCE OF ECONOMIC INEQUALITY FOR VARIOUS COUNTRIES",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria",
      "author_ids": "56006224700;56667169600",
      "author_afids": "60010672;60023137",
      "publicationName": "Neiro-Nechitki Tekhnolohii Modelyuvannya v Ekonomitsi",
      "description": "The choice between economic efficiency and social equity has become a key objection in economic development, since in the current economic system, which has become close to the Pareto optimum, the achievement of both of these goals is mutually exclusive. Further balancing between these goals is possible only with a fundamental change of current system of economic relations and getting access to new curves of production capabilities, which may become quite real within development of Industry 4.0 and 6th technological wave. Nevertheless, nobody can predict the social impact of Industry 4.0 on society, which in the context of future technological changes transforms into Society 4.0. The purpose of this paper is to conduct a cluster analysis of countries inequality due to IT development. We researched impact of gross capital formation, research and development expenditure to create innovations, intellectual property and high-technology exports on inequality of countries using principal component analysis based on open data for 2012–2015. 2 main clusters of 45 countries were identified which have convergence and divergence attributes due to IT development. It was also revealed the countries with inequalities in ensuring economic efficiency and social equity due to other reasons which are not connected with IT development.",
      "citedby_count": 5,
      "authkeywords": "cluster analysis | dendrite method | economic inequality | factor analysis | fourth industrial revolution | principal component analysis",
      " aggregationType": "Journal",
      " issn": "23063289"
    },
    {
      "eid": "2-s2.0-85069533556",
      "title": "Preface",
      "author_count": "10",
      "author_names": "Ermolayev, Vadim;Mallet, Frédéric;Yakovyna, Vitaliy;Kharchenko, Vyacheslav;Kobets, Vitaliy;Korniłowicz, Artur;Kravtsov, Hennadiy;Nikitchenko, Mykola;Semerikov, Serhiy;Spivakovsky, Aleksander",
      "author_ids": "13104107100;24328821200;6602569305;22034616000;56006224700;28267770100;55780812100;6602842336;56375008500;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 16,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85069459976",
      "title": "Cluster analysis of countries inequality due to IT development",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Voynarenko, Mykhaylo",
      "author_ids": "56006224700;56667169600;56499392500",
      "author_afids": "60010672;60023137;60021463",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The choice between economic efficiency and social equity has become a key objection in economic development, since in the current economic system, which has become close to the Pareto optimum, the achievement of both of these goals is mutually exclusive. There is only one way to reach both of these goals – the fundamental change of current system of economic relations and getting access to new curves of production capabilities, which may become quite real within development of Industry 4.0 and 6th technological wave. Nevertheless, nobody can predict the social impact of Industry 4.0 on society, which in the context of future technological changes transforms into Society 4.0. The purpose of this paper is to prepare cluster analysis of countries inequality due to IT development using software package. We researched impact of gross capital formation, research and development expenditure to create innovations, intellectual property and high-technology exports on inequality of countries using principal component analysis based on open data 2012-2015. We found 4 main clusters of 45 countries which have convergence and divergence attributes due to IT development. It was also revealed the countries which had inequality due to other reasons which are not connected with IT development.",
      "citedby_count": 3,
      "authkeywords": "Cluster analysis | Industry 4.0 | Inequality | IT development",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85069440726",
      "title": "Support of investors’ decision making in economic experiments using software tools",
      "author_count": "2",
      "author_names": "Kilinich, Daria;Kobets, Vitaliy",
      "author_ids": "57210120114;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "During making decision the logit and probit patterns serve to resolve different issues based on statistical data regarding expediency or inappropriateness: opening LTD, investing funds, hiring employees, entering a new market, introducing innovations, etc. The purpose of the research is to support the decision making in economic experiments using software tools and logit and probit analysis. To achieve this goal, the following tasks are defined: investigation of the range of application of the logit and probit models; calculation of open data using the RStudio; development of decision support models using open data sources. Methods and technologies of research: logit and probit models to predict the probability of dealing between traders of cryptocurrencies, cluster analysis of investor profiles through principal component analysis. To distinguish different types of investors we can use cluster analysis which help us to reveal main types of risk-attitude investors. After that we can construct correspondence between specific users and financial instruments.",
      "citedby_count": 5,
      "authkeywords": "Cluster analysis | Cryptocurrencies | Decision making | Economic experiments | Software tools",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85063463525",
      "title": "Evolutionary Revision Model for Improvement of Computer Science Curriculum",
      "author_count": "2",
      "author_names": "Kravtsov, Hennadiy;Kobets, Vitaliy",
      "author_ids": "55780812100;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The onrush of information technology raises the task of revising curricula of specialties in computer science. The objectives of the study are to define the requirements and develop a model of the curriculum revision system in computer science. Subject of the research: curriculum revision system in computer science. Research methods: review and analysis of scientific publications, modeling of complex systems, questionnaires, expert method of evaluation. The model of the revision system of the curriculum was created in accordance with the modern requirements of employers to the competence of university graduates in computer sciences. The architecture of this system is based on the research on the functionality of such elements as the Top Competences (required in the labor market), Employers’ Requirements, Learning outcomes (expected results of teachers) and the formation of the ICT curriculum. The expert method is used to assess the quality of the revision model of the curriculum on the example of a specialty in the field of computer science. Results of the research: the requirements of the labor market to the competence of university graduates were investigated, systematized and formulated in the field of computer science. These requirements are the basis for the formation of a new or improved university curriculum.",
      "citedby_count": 5,
      "authkeywords": "Curriculum in computer science | Curriculum revision model | Expert method | Learning outcomes | Requirements for the competences",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85063434364",
      "title": "Implementation of Robo-Advisor Services for Different Risk Attitude Investment Decisions Using Machine Learning Techniques",
      "author_count": "3",
      "author_names": "Snihovyi, Oleksandr;Kobets, Vitaliy;Ivanov, Oleksii",
      "author_ids": "57202445602;56006224700;57202445400",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "In this paper we have researched how to use machine learning in the financial industry on the example of robo-advisor; defined the basic functionality of robo-advisor, an implementation of robo-advisor based on analysis of the most popular financial services, such as Betterment, FutureAdvisor, Motif Investing, Schwab Intelligent and Wealthfront. We have also compared their functionality, formulated a list of critical features and described our own high-level architecture design of a general robo-advisor tool for private investors. Our goal is to build three application modules for a single robo-advisor which combines its architecture and modern financial instruments – cryptocurrencies for the first time. The first module is a Long short-term memory (LSTM) neural network, which forecasts cryptocurrencies prices daily. As a result of simulation experiment through the application using real data from open sources, we have found that the combination of criterion can explain 61% of cryptocurrencies prices variation. The second module uses robo-advising approach to build an investment plan for novice cryptocurrencies investors with different risk attitude investment decisions. The third module is ETL (Extract-Transform-Load) for a statistics dataset and neural networks models. Results of the investigation show that investing in cryptocurrencies can give 23.7% per year for risk-averse, 31.8% per year for risk-seeking investors and 16.5% annually for investors of hybrid type.",
      "citedby_count": 14,
      "authkeywords": "Financial instruments | Machine learning | Markowitz model | Neural networks | Robo-advisor",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85049772822",
      "title": "Forecasting Real Option Price Model by Means of Evolutionary and Genetic Algorithms",
      "author_count": "3",
      "author_names": "Zubrii, Mykyta;Mazur, Anastasia;Kobets, Vitaliy",
      "author_ids": "57202444313;57202446486;56006224700",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "Lecture Notes in Mechanical Engineering",
      "description": "Research goals and objective: to predict real option prices using evolutionary and genetic algorithms which affect the accuracy of price forecasting. The object of research: real option price model. The subject of research: forecasting evolutionary and genetic algorithms for real option price model. Research methods are genetic algorithm, evolutionary algorithm, statistical technique. Results of the research: in options trading one of the main tasks is to determine the fair price option, using which we can estimate what options are undervalued, and which ones are overvalued at the moment. The decision on the purchase or sale of a particular option is made according to these algorithms. In this paper we apply genetic and evolutionary algorithms in the areas of financial instruments in order to create software intended for analysis and forecast of real price option.",
      "citedby_count": 1,
      "authkeywords": "Financial instruments | Forecasting | Genetic and evolutionary algorithms | Optimization | Options",
      " aggregationType": "Book Series",
      " issn": "21954356"
    },
    {
      "eid": "2-s2.0-85065973782",
      "title": "Implementation of Robo-Advisors Using Neural Networks for Different Risk Attitude Investment Decisions",
      "author_count": "3",
      "author_names": "Snihovyi, Oleksandr;Ivanov, Oleksyi;Kobets, Vitaliy",
      "author_ids": "57202445602;57202445400;56006224700",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "9th International Conference on Intelligent Systems 2018: Theory, Research and Innovation in Applications, IS 2018 - Proceedings",
      "description": "This paper is a sequel to our previous works related to Robo-advisors and cryptocurrencies. Our goal now is to build two application modules for a single Robo-advisor. The first module is a Long short-term memory (LSTM) neural network which forecasts cryptocurrencies prices daily. The second module uses Robo-advising approach to build an investment plan for novice cryptocurrencies investors with different risk attitude investment decisions. The third module does ETL (Extract-Transform-Load) for a statistics dataset and neural networks models. Results of the investigation show that investing in cryptocurrencies can give 23.7% per year for risk-averse, 31.8% per year for risk-seeking investors and 16.5% annually for riskneutral investors.",
      "citedby_count": 8,
      "authkeywords": "Financial instruments | Machine learning | Markowitz model | Neural networks | Robo-advisor",
      " aggregationType": "Conference Proceeding",
      " issn": null
    },
    {
      "eid": "2-s2.0-85048375338",
      "title": "Neuro-fuzzy model of development forecasting and effective agrarian sector transformations of Ukraine",
      "author_count": "3",
      "author_names": "Nemchenko, Diana;Kobets, Vitaliy;Potravka, Larisa",
      "author_ids": "57202443616;56006224700;57202444369",
      "author_afids": "60010672;60010672;60117186",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Research goals and objective: to predict the economic dynamics of the synergetic transformation model of Ukrainian agrarian sector using a neural network on fuzzy data. The object of research: Neuro-Fuzzy Model of Economic Forecasting. The subject of research: forecasting the economic dynamics of the synergetic transformation model of Ukrainian agrarian sector using a neural network on fuzzy data. Research Methods are neuro model, fuzzy logic, assessment of the risk of Voronov and Maksimov Results of the research: We can say that the risk of this forecast, predicted by the neural network, is \"very low\", we can definitely trust the forecast, and the risk is calculated by the equation of the neuroregression \"low\", which indicates that we can trust the forecast, but with caution and further monitoring.",
      "citedby_count": 0,
      "authkeywords": "Economic forecasting | Fuzzy logic | Neuro model",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048369434",
      "title": "Cryptocurrencies prices forecasting with anaconda tool using machine learning techniques",
      "author_count": "3",
      "author_names": "Snihovyi, Oleksandr;Ivanov, Oleksii;Kobets, Vitaliy",
      "author_ids": "57202445602;57202445400;56006224700",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The research goal is to study criteria which affect the price of a cryptocurrency and their USAge for the price forecasting using Machine Learning techniques. The subject of research is forecasting of most famous cryptocurrency Bitcoin using the most popular Python Data Science Platform ' Anaconda. Research Methods are machine learning, data analysis, and multiple regression. A set of criteria which affect the price of the cryptocurrency were defined based on the analysis of public information. Their correctness was tested using Machine Learning algorithms. As a result of simulation experiment through the application using real data from open sources, we have found that selected combination of criterion can explain more than 70% of cryptocurrencies prices variation using either Multiple Regression or Random Trees or Long Short- Term Memory networks.",
      "citedby_count": 9,
      "authkeywords": "Bitcoin | Cryptocurrency | Data science | Forecasting | Long short-term memory | Lstm | Machine learning | Multiple regression | Python | Random forests",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048369334",
      "title": "GIS based model of quotas regulation and its impact on the extraction of ecosystems' natural resources and social welfare",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Bystriantseva, Anastasiia;Shakhman, Iryna",
      "author_ids": "56006224700;57198431218;57198424698",
      "author_afids": "60010672;60010672;60117186",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Research goal of the paper is to study ecosystem using Geographical Information System (GIS) based technology to develop valid recommendations for sand extraction from water body. Our subject of research is GIS Based Model of Quotas Regulation and its Impact on the Extraction of Ecosystems' Natural Resources and Social Welfare. We used such methods as optimization methods, GIS methods, differential-equations method, marginal benefit-cost analysis. An example of mathematical model for determining of ecological equilibrium during sand extracting in the ecosystem is developed using Google Maps. The influence of economic activity due to sand extraction on fish fauna is described. The GIS based ecological-economic model is developed on the logistic model basis for establishing regional quotas for extraction of natural resources during economic activity in the southern Ukraine. Regulatory economic mechanism of natural environment is proposed. It implies such quota for sand extraction from water body, which does not lead to deterioration of the natural environment and stimulate the increase in social welfare.",
      "citedby_count": 3,
      "authkeywords": "Ecosystem | Externality | GIS technology | Quota regulation",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048366394",
      "title": "Model of the curriculum revision system in computer science",
      "author_count": "2",
      "author_names": "Kravtsov, Hennadiy;Kobets, Vitaliy",
      "author_ids": "55780812100;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The onrush of information technology raises the task of revising curricula of specialties in computer science. The objectives of the study are to define the requirements and develop a model of the curriculum revision system in computer science. Subject of research: curriculum revision system in computer science. Research methods: review and analysis of scientific publications, modeling of complex systems, questionnaires, expert method of evaluation. The model of the revision system of the curriculum is built taking into account the modern requirements of employers to the competence of university graduates in computer sciences. The architecture of this system is built on the basis of research on the functionality of such elements as the Top Competences (required in the labor market), Employers' Requirements, Learning outcomes (expected results of teachers) and the formation of the ICT curriculum. The expert method is used to assess the quality of the revision model of the curriculum on the example of a specialty in the field of computer science. Results of the research: the requirements of the labor market to the competence of university graduates were investigated, systematized and formulated in the field of computer science. These requirements are the basis for the formation of a new or improvement of the existing curriculum at the university.",
      "citedby_count": 9,
      "authkeywords": "Curriculum in computer science | Curriculum revision model | Learning outcomes | Requirements for the competences",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048357972",
      "title": "Data analysis of private investment decision making using tools of Robo-advisers in long-run period",
      "author_count": "4",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Mazur, Anastasia;Zubrii, Mykyta",
      "author_ids": "56006224700;56667169600;57202446486;57202444313",
      "author_afids": "60010672;60023137;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The most popular automated systems are robo-advice services which have the mathematical algorithm based on the main principles of consumptionsavings theories. The purpose of this paper is to describe data analysis of private investment decision making using developed tool of robo-advisers in longrun period. We considered consumption-saving ratio in economics, emerging trends of robo-advice (RA) services for making investment decisions. SWOTanalysis of robo-advice services and comparative characteristics of roboadvisers explain advantage of RA services. We also developed mathematical model of robo-advisor in a long-run period and described support of investment decision making in long-run period via software module of robo-advisor. The task assignment of developed IT service is to maintain a constant level of client's consumption during life-long period through automated analysis of how much he/she has to consume and save each year. Results of consumption and savings proposals can be modified if initial financial data changes.",
      "citedby_count": 14,
      "authkeywords": "Annuity | Data analysis | Long life decision making | Robo-advisor",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048356846",
      "title": "Preface",
      "author_count": "10",
      "author_names": "Ermolayev, Vadim;Suárez-Figueroa, Mari Carmen;Yakovyna, Vitaliy;Kharchenko, Vyacheslav;Kobets, Vitaliy;Kravtsov, Hennadiy;Peschanenko, Vladimir;Prytula, Yaroslav;Nikitchenko, Mykola;Spivakovsky, Aleksander",
      "author_ids": "13104107100;56005389600;6602569305;22034616000;56006224700;55780812100;36190302600;57203185304;6602842336;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85048354929",
      "title": "Implementation of Robo-advisors tools for different risk attitude investment decisions",
      "author_count": "3",
      "author_names": "Ivanov, Oleksii;Snihovyi, Oleksandr;Kobets, Vitaliy",
      "author_ids": "57202445400;57202445602;56006224700",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "We researched: how to use Machine Learning in the financial industry on an example of Robo-Advisors; defined the basic functionality of Robo-Advisor; an implementation of Robo-Advisors based on analysis of the most popular financial services such as Betterment, FutureAdvisor, Motif Investing, Schwab Intelligent and Wealthfront. We compared their functionality, formulated a list of critical features and described the high-level architecture design of a general robo-advisor tool. Using Markowitz model we prepared a proof of concept of a robo-advisor application for investors with different attitudes to risks. Results of our investigation proposed data processing automatization from open sources of cryptocurrencies as the top trend nowadays.",
      "citedby_count": 10,
      "authkeywords": "Financial instruments | Markowitz model | Robo-advisor",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85044040081",
      "title": "Simulation agent-based model of heterogeneous firms through software module",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Weissblut, Alexander",
      "author_ids": "56006224700;56006697200",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "Research goals and objectives: study of the simplest agent-based model with heterogeneous firms using a software module. Object of research: microeconomics system with heterogeneous agents. Subject of research: agent-based model of microeconomic system with different types, equilibrium and disequilibrium states of the systems with specially developed desktop application. Research methods: optimization methods, bifurcation analysis, stability analysis, simulation methods, game theory. Results of the research: a market moves from stability to dynamic chaos with an increase in number of firms provided the firms have heterogeneous types. If no less than two-thirds of firms use naive expectations, the state of dynamic chaos will also appears in the market. The crucial factor which ensures market stability is the adaptive approach of firms’ competitive strategy.",
      "citedby_count": 2,
      "authkeywords": "Adaptive expectations | Agent-based model | Bifurcation | Heterogeneous type",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-85020519656",
      "title": "Mathematical model of microeconomic system with different social responsibilities in software module",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Weissblut, Alexander",
      "author_ids": "56006224700;56006697200",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Research goals and objectives: to study of the simplest possible mathematical model of microeconomic system with different social responsibilities of agents in accordance with agent based computational economics paradigm using a desktop application. Object of research: microeconomics system with heterogeneous agents. Subject of research: mathematical model of microeconomic system with different social responsibilities, equilibrium and disequilibrium states of the systems using desktop application. Research methods are: optimization methods, bifurcation analysis, stability analysis, simulation methods, game theoretic approach. Results of the research: dynamic models of microeconomic system with different social responsibilities (reciprocator and selfish types) were created using specially developed desktop application. Based on software module the conditions of stability, bifurcation and analysis were obtained. As a result of numerical investigation we have found that flip bifurcations occur with increasing of firms' number in the market. If two-thirds of firms use naive expectation, then there appears the state of dynamic chaos.",
      "citedby_count": 1,
      "authkeywords": "Bifurcation | Microeconomic system | Reciprocity | Stability",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85020507915",
      "title": "Implementation of stakeholders' requirements and innovations for ict curriculum through relevant competences",
      "author_count": "2",
      "author_names": "Kravtsov, Hennadiy;Kobets, Vitaliy",
      "author_ids": "55780812100;56006224700",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Research goals: determine the requirements of employers for the competence of university graduates in the field of information systems to create the curriculum. Object of research: curriculum in information systems. Subject of research: modern requirements to the competences of university graduates in the field of information systems, a methodological and technological model of a unified environment of distance learning based on cloud services. Research methods: review and analysis of scientific publications, modeling of complex systems, questionnaires. Results of the research: the labor market requirements for the competencies of university graduates in information systems were obtained, investigated and systematized. These requirements are the basis for the formation of a new university curriculum in information systems. Based on cloud services and technologies, an innovative model of the integrated electronic learning environment has been developed. The results were obtained during the Erasmus+ project MASTIS \"Establishing Modern Master-level Studies in Information Systems\" (2015-2018).",
      "citedby_count": 10,
      "authkeywords": "Cloud technology | Curriculum in information systems | Innovations in distance learning system | Requirements for the competence",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-85020494515",
      "title": "Design, development and use of decision support systems in the study of economic disciplines in higher education",
      "author_count": "3",
      "author_names": "Osipova, Nataliya;Kobets, Vitaliy;Bazanova, Tatyana",
      "author_ids": "57219930513;56006224700;57194519712",
      "author_afids": "60010672;60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Research goals and objectives: to describe the experience of the design, development and use of decision support systems (DSS) in the study of economic disciplines in higher education. Subject of research: design, development and use of decision support systems in the study of economic disciplines in higher education. Research methods used: comparative analysis, business analytics, design of software module, interactive decision making, analytical methods. Results of the research: The quality of a decision depends on the input information and a set of relevant economic indicators. Decision making support systems with calculation algorithms containing endogenous economic indicators, as well as the precedent knowledge base are designed to facilitate selection of alternatives in decision making using exogenous parameters. Automation of economic indicators' calculations has a didactic purpose for students of economic specialties. The DSS developed will facilitate decision-making in semi-structured and unstructured situations at micro and macro levels.",
      "citedby_count": 1,
      "authkeywords": "Calculation algorithms | Decision support systems | Economic indicators",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84978745043",
      "title": "Adaptive dynamic mechanism of modified double electronic auction",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy M.;Yatsenko, Valeria O.",
      "author_ids": "56006224700;56667169600",
      "author_afids": "60010672;60023137",
      "publicationName": "Actual Problems of Economics",
      "description": "The article presents the different formats of electronic auctions that change social welfare. New auction format was developed to research its effectiveness for true and hidden agents’ types. The developed model of adaptive dynamic mechanism for double electronic auction showed high efficiency in the terms of social welfare among the alternative formats.",
      "citedby_count": 0,
      "authkeywords": "Adaptive mechanism | e-auction | Social welfare",
      " aggregationType": "Journal",
      " issn": "19936788"
    },
    {
      "eid": "2-s2.0-84977577082",
      "title": "Adjusting business processes by the means of an autoregressive model using BPMN 2.0",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria",
      "author_ids": "56006224700;56667169600",
      "author_afids": "60010672;60023137",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Process approach in the management of modern business entity activities opens a wide range of opportunities, ways and methods of activity reorganization, improving the quality of customer interaction, optimization of internal and external business processes. An effective tool in analyzing business processes as a central category of the process approach is modeling that increases their adaptability and mobility. We propose approach to improve and adjust business process to time and profit increasing by the means of autoregressive model using BPMN 2.0 in contrast existing approaches without econometrics analysis of experimental data for BPMN.",
      "citedby_count": 7,
      "authkeywords": "BPMN | Business process | Profit | Regression",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84977540233",
      "title": "Using an evolutionary algorithm to improve investment strategies for industries in an economic system",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Poltoratskiy, Maksym",
      "author_ids": "56006224700;56436805400",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Evolutionary investment strategies have been found to adapt distribution of investors' fund to technological changes of economic industries. In this paper we use evolutionary algorithm (EA) to improve investment strategies in economic system comparing shares of most profitable investors with other ones. Proposed algorithm selects an optimal combination of investment share in different industries for improving of investment performance. In our experiment we use statistical data from official sources to examine effectiveness of proposed investment strategy. We find the investment strategies using evolutionary algorithm to teach investors how to increase their profit as much as possible and obtain more profit than investor with best start possibilities.",
      "citedby_count": 13,
      "authkeywords": "Evolutionary algorithm | Industry | Input-output model | Profitability | Technology",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84977515144",
      "title": "Preface",
      "author_count": "10",
      "author_names": "Ermolayev, Vadim;Spivakovskiy, Aleksander;Nikitchenko, Mykola;Ginige, Athula;Mayr, Heinrich C.;Plexousakis, Dimitris;Zholtkevych, Grygoriy;Burov, Oleksandr;Kharchenko, Vyacheslav;Kobets, Vitaliy",
      "author_ids": "13104107100;16431204200;6602842336;22334092000;7103006723;6602157883;55557328000;55190325000;22034616000;56006224700",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84977494148",
      "title": "Nonlinear Dynamic model of a microeconomic system with different reciprocity and expectations types of firms: Stability and bifurcations",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Weissblut, Alexander",
      "author_ids": "56006224700;56006697200",
      "author_afids": "60010672;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "This paper analyzes the dynamic interaction between selfish and reciprocity firms in the market of homogeneous product. The decisions of both types of firms in respect of their output strategies are investigated under naive, adaptive and generalized expectations. The standard postulate for competitive firms' model has been extended by the assumption that there is a share of reciprocity firms which, unlike selfish firms, maximize both private and social benefits as consumer surplus. It has been proved that the unique Nash equilibrium is stable for all affordable values of parameters in the model with adaptive expectations, and is unstable for the model with naive expectations at sufficiently large number of firms in the market. A special desktop application has been created for animation of model trajectory and demonstration of stable quantity trajectories and bifurcation diagrams of firms' output. Naive expectations of two-thirds of firms result in a state of dynamic chaos in the market leading to degeneration of the existing competition model between the two types of firms. The crucial factor which ensures the stable equilibrium in the market and the ability to predict firms' output is the adaptive approach which takes into account the adaptive expectations of firms planning their product quantity.",
      "citedby_count": 7,
      "authkeywords": "Adaptive expectations | Bifurcation | Consumer surplus | Microeconomic system | Naïve expectations | Reciprocity | Stability",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84930349200",
      "title": "Dynamic model of double electronic Vickrey auction",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Yatsenko, Valeria;Poltoratskiy, Maksim",
      "author_ids": "56006224700;56667169600;56436805400",
      "author_afids": "60010672;60023137;60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "The paper deals with different approaches to the definition of e-commerce, including special mechanisms for the distribution of goods and payments, such as auction model. Different formats of auctions that change welfare of their participants are investigated. Software modules were developed for researching the effectivenes of double electronic Vickrey auction. It is defined that in double Vickrey auction incentives for most buyers and sellers are created to reveal their true types. The developed software module of double Vickrey auction showed the highest efficiency in the terms of social welfare among alternative formats and disproved the ability of Vickrey auction to achieve results like market mechanism of perfect competition.",
      "citedby_count": 6,
      "authkeywords": "E-auction | E-commerce | Online auction | Social welfare | Vickrey auction",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84930344389",
      "title": "Preface",
      "author_count": "12",
      "author_names": "Batsakis, Sotiris;Mayr, Heinrich C.;Yakovyna, Vitaliy;Nikitchenko, Mykola;Zholtkevych, Grygoriy;Kharchenko, Vyacheslav;Kravtsov, Hennadiy;Kobets, Vitaliy;Peschanenko, Vladimir;Ermolayev, Vadim;Bobalo, Yuriy;Spivakovsky, Aleksander",
      "author_ids": "26631759300;7103006723;6602569305;6602842336;55557328000;22034616000;55780812100;56006224700;36190302600;13104107100;8410487000;16431204200",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84914124937",
      "title": "Forming an evolutionarily stable firm strategy under Cournot competition using social preferences",
      "author_count": "2",
      "author_names": "Kobets, Vitaliy;Poltoratskiy, Maksim",
      "author_ids": "56006224700;56436805400",
      "author_afids": "60010672;60010672",
      "publicationName": "Communications in Computer and Information Science",
      "description": "The paper investigates what kinds of firms’ social preferences (egoists, altruists or punishers) prove to be evolutionarily stable strategies under Cournot competition in the market of homogeneous product. Combining the traditional and evolutionary approaches to competition we define the conditions that forecast the attitude and profit dynamics of competitors under Cournot competition and adaptive behavior of rivals.",
      "citedby_count": 6,
      "authkeywords": "Evolutionarily stable strategies | Experiment | Institutions | Mechanisms | Social preferences",
      " aggregationType": "Book Series",
      " issn": "18650929"
    },
    {
      "eid": "2-s2.0-84906076266",
      "title": "Incentive compatible mechanism design of custom policy for complex social choice function",
      "author_count": "1",
      "author_names": "Kobets, Vitaliy M.",
      "author_ids": "56006224700",
      "author_afids": "60010672",
      "publicationName": "Actual Problems of Economics",
      "description": "The paper focuses on the design of state customs policy as to unique foreign product for traditional simple and proposed complex social choice functions. The comparative analysis of both models demonstrates the advantages of the complex function, which considers the welfare of domestic consumers. The proposal for state policy of reducing customs duty for unique foreign product under incentive compatible mechanism design is substantiated. © Vitaliy M. Kobets, 2014.",
      "citedby_count": 0,
      "authkeywords": "Consumer surplus | Customs policy | Social choice function | Social welfare",
      " aggregationType": "Journal",
      " issn": "19936788"
    },
    {
      "eid": "2-s2.0-84923605886",
      "title": "Preface",
      "author_count": "9",
      "author_names": "Ermolayev, Vadim;Mayr, Heinrich C.;Nikitchenko, Mykola;Spivakovskiy, Aleksander;Zholtkevych, Grygoriy;Zavileysky, Mikhail;Kravtsov, Hennadiy;Kobets, Vitaliy;Peschanenko, Vladimir",
      "author_ids": "13104107100;7103006723;6602842336;16431204200;55557328000;55965708200;55780812100;56006224700;36190302600",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84923582493",
      "title": "ITER Foreword",
      "author_count": "3",
      "author_names": "Payentko, Tanya;Kryukov, Sergey;Kobets, Vitaliy",
      "author_ids": "56074477300;57189466524;56006224700",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84923573820",
      "title": "Mechanism design for foreign producers of unique homogeneity product",
      "author_count": "1",
      "author_names": "Kobets, Vitaliy",
      "author_ids": "56006224700",
      "author_afids": "60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "Paper concerns to impact on custom receipts of duty rate changing from single to differentiated ones by customs house for foreign producers. To get maximal custom receipts for achieving of social goal state may introduce differentiated duty rates for foreign producers of unique product. Success of this state policy will depend on effectiveness of incentive compatibility conditions for these producers.",
      "citedby_count": 0,
      "authkeywords": "Custom policy | Differentiated duty | Mechanism design | Single duty | Social choice function",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84892619504",
      "title": "Foreword",
      "author_count": "3",
      "author_names": "Kobets, Vitaliy;Kryukov, Sergey;Payentko, Tanya",
      "author_ids": "56006224700;57189466524;56074477300",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84892602353",
      "title": "Preface",
      "author_count": "7",
      "author_names": "Ermolayev, Vadim;Mayr, Heinrich C.;Nikitchenko, Mykola;Spivakovsky, Aleksander;Zholtkevych, Grygoriy;Zavileysky, Mikhail;Kobets, Vitaliy",
      "author_ids": "13104107100;7103006723;6602842336;16431204200;55557328000;55965708200;56006224700",
      "author_afids": null,
      "publicationName": "CEUR Workshop Proceedings",
      "description": null,
      "citedby_count": 0,
      "authkeywords": null,
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-84892588042",
      "title": "Direct and indirect impact analysis of ukrainian industries on gross output and labor market in leontief model",
      "author_count": "1",
      "author_names": "Kobets, Vitaliy",
      "author_ids": "56006224700",
      "author_afids": "60010672",
      "publicationName": "CEUR Workshop Proceedings",
      "description": "In the paper are compared direct and indirect impact analysis of Ukrainian industries production on employment of labor market, profitability and gross output in 2010, it is developed recommendations for state policy to support of priority industries.",
      "citedby_count": 1,
      "authkeywords": "Direct and indirect influence | Externality | Final demand | Gross output | Industries | Input-output model | Multiplier",
      " aggregationType": "Conference Proceeding",
      " issn": "16130073"
    },
    {
      "eid": "2-s2.0-77952641967",
      "title": "Tariff policy of transport company-monopolist at delivery of products of m producers to n markets",
      "author_count": "1",
      "author_names": "Kobets, V. M.",
      "author_ids": "56006224700",
      "author_afids": null,
      "publicationName": "Actual Problems of Economics",
      "description": "The article studies the influence of single and differentiated tariffs of the monopoly shipper upon the social welfare under the conditions of random quantity of producers and markets. It is grounded that tariff policy of a shipper does not impact the consumers' welfare, however, the differentiation of the tariffs causes the decrease in the sector profit of the producers and the income increase for the shipper. Tariff differentiation for a transport company is developed; it provides an opportunity to control the incomes of the sector producers and of a transport company.",
      "citedby_count": 0,
      "authkeywords": "Cournot competition | Differentiated tariffs | Monopoly shipper | Production and delivery system | Single tariff",
      " aggregationType": "Journal",
      " issn": "19936788"
    }
  ]
}